Repository: lucacorbucci/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: fr, zh_hans

source: A well-crafted PR title helps team members quickly understand the purpose and scope of the changes being proposed. Here's a guide to help you write a good GitHub PR title:
fr: Un titre de PR bien choisi permet aux autres développeurs de rapidement comprendre l'intérêt et le scope des changements proposés. Voici un guide pour vous aider à écrire des bons titres de PR :
zh_hans: 一个精心撰写的公关标题能帮助团队成员迅速了解所提修改的目的和范围。以下指南可帮助您撰写一个好的 GitHub PR 标题：

source: 1. Be Clear and Concise: Provide a clear summary of the changes in a concise manner. 1. Use Actionable Verbs: Start with verbs like "Add," "Update," or "Fix" to indicate the purpose. 1. Include Relevant Information: Mention the affected feature or module for context. 1. Keep it Short: Avoid lengthy titles for easy readability. 1. Use Proper Capitalization and Punctuation: Follow grammar rules for clarity.
fr: 1. Soyez clair et concis : Donnez un résumé clair des changements de manière concise. 1. Utilisez des verbes actionnables : Commencez par des verbes comme "Add", "Update", ou "Fix" pour indiquer le but. 1. Inclure des renseignements pertinents : Mentionner la caractéristique ou le module concerné pour le contexte. 1. Gardez le court : Évitez les longs titres pour une lisibilité facile. 1. Utiliser une bonne capitalisation et une ponctuation : Suivre les règles de grammaire pour la clarté.
zh_hans: 1. 简明扼要： 以简明扼要的方式清楚地概述变化。1. 使用可操作的动词： 使用 "添加"、"更新 "或 "修复 "等动词来表明目的。1. 包含相关信息： 提及受影响的功能或模块以了解上下文。1. 简短：避免冗长的标题，以方便阅读。1. 使用正确的大小写和标点符号： 遵守语法规则，以确保清晰。

source: Let's start with a few examples for titles that should be avoided because they do not provide meaningful information:
fr: Commençons par quelques exemples de titres qui devraient être évités parce qu'ils ne fournissent pas d'information significative :
zh_hans: 让我们先举例说明几个应该避免使用的标题，因为它们不能提供有意义的信息：

source: Implement Algorithm
zh_hans: 执行算法

source: Database
zh_hans: 数据库

source: Add my_new_file.py to codebase
zh_hans: 在代码库中添加 my_new_file.py

source: Improve code in module
zh_hans: 改进模块中的代码

source: Change SomeModule
zh_hans: 更改 SomeModule

source: Here are a few positive examples which provide helpful information without repeating how they do it, as that is already visible in the "Files changed" section of the PR:
fr: Voici quelques bons exemples qui fournissent de l'information utile sans répéter comment ils le font, comme cela est déjà visible dans la section "Files changed" de la PR :
zh_hans: 这里有几个正面的例子，提供了有用的信息，但没有重复他们是如何做的，因为在 PR 的 "已更改文件 "部分已经可以看到：

source: Update docs banner to mention Flower Summit 2023
zh_hans: 更新文件横幅，提及 2023 年 Flower 峰会

source: Remove unnecessary XGBoost dependency
zh_hans: 移除不必要的 XGBoost 依赖性

source: Remove redundant attributes in strategies subclassing FedAvg
zh_hans: 删除 FedAvg 子类化策略中的多余属性

source: Add CI job to deploy the staging system when the `main` branch changes
zh_hans: 添加 CI 作业，以便在 "主 "分支发生变化时部署暂存系统

source: Add new amazing library which will be used to improve the simulation engine
zh_hans: 添加新的惊人库，用于改进模拟引擎

source: Next steps
fr: Prochaines étapes
zh_hans: 接下来的步骤

source: Once you have made your first PR, and want to contribute more, be sure to check out the following :
fr: Une fois que tu auras fait ton premier RP, et que tu voudras contribuer davantage, ne manque pas de consulter les sites suivants :
zh_hans: 一旦您完成了第一份 PR，并希望做出更多贡献，请务必查看以下内容：

source: `Good first contributions <https://flower.dev/docs/framework/contributor-ref-good-first-contributions.html>`_, where you should particularly look into the :code:`baselines` contributions.
fr: `Bonnes premières contributions <https://flower.dev/docs/framework/contributor-ref-good-first-contributions.html>`_, où vous devriez particulièrement regarder les contributions :code:`baselines`.
zh_hans: 好的第一批贡献 <https://flower.dev/docs/framework/contributor-ref-good-first-contributions.html>`_，在这里你应该特别看看 :code:`baselines` 的贡献。

source: Get started as a contributor
fr: Devenez un·e contributeur·ice
zh_hans: 成为贡献者

source: Prerequisites
fr: Prérequis
zh_hans: 先决条件

source: `Python 3.7 <https://docs.python.org/3.7/>`_ or above
fr: `Python 3.7 <https://docs.python.org/3.7/>`_ ou plus
zh_hans: Python 3.7 <https://docs.python.org/3.7/>`_ 或更高版本

source: `Poetry 1.3 <https://python-poetry.org/>`_ or above
fr: `Poetry 1.3 <https://python-poetry.org/>`_ ou plus
zh_hans: `Poetry 1.3 <https://python-poetry.org/>`_ 或更高版本

source: (Optional) `pyenv <https://github.com/pyenv/pyenv>`_
fr: (Optionnel) `pyenv <https://github.com/pyenv/pyenv>`_
zh_hans: (可选） `pyenv <https://github.com/pyenv/pyenv>`_

source: (Optional) `pyenv-virtualenv <https://github.com/pyenv/pyenv-virtualenv>`_
fr: (Optionnel) `pyenv-virtualenv <https://github.com/pyenv/pyenv-virtualenv>`_
zh_hans: (可选） `pyenv-virtualenv <https://github.com/pyenv/pyenv-virtualenv>`_

source: Flower uses :code:`pyproject.toml` to manage dependencies and configure development tools (the ones which support it). Poetry is a build tool which supports `PEP 517 <https://www.python.org/dev/peps/pep-0517/>`_.
fr: Flower utilise un fichier :code:`pyproject.toml` pour gérer les dependences et configurer les outils de développement (du moins ceux qui le supportent). Poetry est un outil qui support `PEP 517 <https://www.python.org/dev/peps/pep-0517/>`_.
zh_hans: Flower 使用 :code:`pyproject.toml` 来管理依赖关系和配置开发工具（支持它的）。Poetry 是一种支持 `PEP 517 <https://www.python.org/dev/peps/pep-0517/>`_ 的构建工具。

source: Developer Machine Setup
fr: Setup de la machine
zh_hans: 开发者机器设置

source: First, clone the `Flower repository <https://github.com/adap/flower>`_ from GitHub::
fr: Pour commencer, cloner la `repo Flower <https://github.com/adap/flower>`_ depuis GitHub::
zh_hans: 首先，从 GitHub 克隆 "Flower 存储库 <https://github.com/adap/flower>`_"：

source: Second, create a virtual environment (and activate it). If you chose to use :code:`pyenv` (with the :code:`pyenv-virtualenv` plugin) and already have it installed , you can use the following convenience script (by default it will use :code:`Python 3.8.17`, but you can change it by providing a specific :code:`<version>`)::
fr: Deuxièmement, créer un environnement virtuel (et l'activer). Si vous choisissez d'utiliser :code:`pyenv` (avec le plugin :code:`pyenv-virtualenv`) et que vous l'avez déjà installé, vous pouvez utiliser le script suivant (par défaut il utilisera :code:`Python 3.8.17`, mais vous pouvez le changer en fournissant une :code:`<version>` spécifique)::
zh_hans: 其次，创建虚拟环境（并激活它）。如果您选择使用 :code:`pyenv`（使用 :code:`pyenv-virtualenv`插件），并且已经安装了该插件，则可以使用下面的便捷脚本（默认情况下使用 :code:`Python3.8.17`，但您可以通过提供特定的 :code:`<版本>`来更改）：：

source: If you don't have :code:`pyenv` installed, you can use the following script that will install pyenv, set it up and create the virtual environment (with :code:`Python 3.8.17` by default)::
fr: Si vous n'avez pas :code:`pyenv` installé, vous pouvez utiliser le script suivant qui l'installera, le configurera et créera l'environnement virtuel (avec :code:`Python 3.8.17` par défaut)::
zh_hans: 如果没有安装 :code:`pyenv`，可以使用以下脚本安装 pyenv、设置并创建虚拟环境（默认使用 :code:`Python3.8.17）：：

source: Third, install the Flower package in development mode (think :code:`pip install -e`) along with all necessary dependencies::
fr: Troisièmement, installez le paquet Flower en mode de développement ( :code :`pip install -e`) avec toutes les dépendances nécessaires :
zh_hans: 第三，在开发模式下安装 Flower 软件包（想想 :code:`pip install -e`）以及所有必要的依赖项：：

source: Convenience Scripts
fr: Scripts pratiques
zh_hans: 便捷脚本

source: The Flower repository contains a number of convenience scripts to make recurring development tasks easier and less error-prone. See the :code:`/dev` subdirectory for a full list. The following scripts are amonst the most important ones:
fr: La repo de Flower contient un certain nombre de scripts de commodité pour rendre les tâches de développement récurrentes plus faciles et moins problématiques. Voir le sous-répertoire :code :`/dev` pour une liste complète. Les scripts suivants sont parmis les plus importants :
zh_hans: Flower 软件仓库包含大量便捷脚本，可使重复性开发任务更轻松、更不易出错。完整列表请参见 :code:`/dev` 子目录。以下是最重要的脚本：

source: Create/Delete Virtual Environment
fr: Créer/Supprimer l'environment virtuel
zh_hans: 创建/删除虚拟环境

source: Compile ProtoBuf Definitions
fr: Compiler les définitions ProtoBuf
zh_hans: 编译 ProtoBuf 定义

source: Auto-Format Code
fr: Formatter le code
zh_hans: 自动格式化代码

source: Run Linters and Tests
fr: Vérifier le format et tester le code
zh_hans: 运行分类器和测试

source: Run Github Actions (CI) locally
fr: Exécuter les GitHub Actions (CI) localement
zh_hans: 在本地运行 Github 操作 (CI)

source: Developers could run the full set of Github Actions workflows under their local environment by using `Act <https://github.com/nektos/act>_`. Please refer to the installation instructions under the linked repository and run the next command under Flower main cloned repository folder::
fr: Il est possible d'exécuter l'ensemble des Github Actions sous leur environnement local en utilisant `Act <https ://github.com/nektos/act>_`. En suivant le lien vous trouverez les instructions d'installation. Une fois installé, exécuter la commande suivante dans le dossier principale de Flower :
zh_hans: 开发人员可以使用 `Act <https://github.com/nektos/act>_` 在本地环境下运行全套 Github Actions 工作流程。请参考链接仓库下的安装说明，并在 Flower 主克隆仓库文件夹下运行下一条命令：：

source: The Flower default workflow would run by setting up the required Docker machines underneath.
fr: Le workflow par défaut de Flower sera exécuté en configurant les machines Docker requises en arrière plan.
zh_hans: Flower 默认工作流程将通过在下面设置所需的 Docker 机器来运行。

source: Build Release
zh_hans: 版本发布

source: Flower uses Poetry to build releases. The necessary command is wrapped in a simple script::
fr: Flower utilise Poetry pour construire les nouvelles versions. La commande nécessaire est comprise dans un script simple ::
zh_hans: Flower 使用 Poetry 创建发布版本。必要的命令封装在一个简单的脚本中：：

source: The resulting :code:`.whl` and :code:`.tar.gz` releases will be stored in the :code:`/dist` subdirectory.
fr: Les versions résultantes :code:`.whl` et :code:`.tar.gz` seront stockées dans le sous-répertoire:code:`/dist`.
zh_hans: 生成的 :code:`.whl` 和 :code:`.tar.gz` 版本将存储在 :code:`/dist` 子目录中。

source: Build Documentation
zh_hans: 构建文档

source: Flower's documentation uses `Sphinx <https://www.sphinx-doc.org/>`_. There's no convenience script to re-build the documentation yet, but it's pretty easy::
zh_hans: Flower 的文档使用 `Sphinx <https://www.sphinx-doc.org/>`_。目前还没有很方便的脚本来重新构建文档，不过这很容易：：

source: This will generate HTML documentation in ``doc/build/html``.
zh_hans: 这将在 ``doc/build/html`` 中生成 HTML 文档。

source: Example: FedBN in PyTorch - From Centralized To Federated
fr: Exemple : FedBN dans PyTorch - De la centralisation à la fédération
zh_hans: 示例： PyTorch 中的 FedBN - 从集中式到联邦式

source: This tutorial will show you how to use Flower to build a federated version of an existing machine learning workload with `FedBN <https://github.com/med-air/FedBN>`_, a federated training strategy designed for non-iid data. We are using PyTorch to train a Convolutional Neural Network(with Batch Normalization layers) on the CIFAR-10 dataset. When applying FedBN, only few changes needed compared to `Example: PyTorch - From Centralized To Federated <https://flower.dev/docs/examples/pytorch-from-centralized-to-federated.html>`_.
zh_hans: 本教程将向您展示如何使用 Flower 为现有的机器学习框架构建一个联邦学习的版本，并使用 "FedBN <https://github.com/med-air/FedBN>`_"（一种针对非 iid 数据设计的联邦训练策略）。我们使用 PyTorch 在 CIFAR-10 数据集上训练一个卷积神经网络（带有Batch Normalization层）。在应用 FedBN 时，只需对 `示例: PyTorch - 从集中式到联邦式 <https://flower.dev/docs/examples/pytorch-from-centralized-to-federated.html>`_ 做少量改动。

source: Centralized Training
fr: Formation centralisée
zh_hans: 集中式训练

source: All files are revised based on `Example: PyTorch - From Centralized To Federated <https://flower.dev/docs/examples/pytorch-from-centralized-to-federated.html>`_. The only thing to do is modifying the file called :code:`cifar.py`, revised part is shown below:
zh_hans: 所有文件均根据 `示例： PyTorch -从集中式到联邦式 <https://flower.dev/docs/examples/pytorch-from-centralized-to-federated.html>`_。唯一要做的就是修改名为 :code:`cifar.py` 的文件，修改部分如下所示：

source: The model architecture defined in class Net() is added with Batch Normalization layers accordingly.
fr: L'architecture du modèle définie dans la classe Net() est ajoutée avec les couches de normalisation par lots en conséquence.
zh_hans: 类 Net() 中定义的模型架构会相应添加Batch Normalization层。

source: You can now run your machine learning workload:
fr: Tu peux maintenant exécuter ta charge de travail d'apprentissage automatique :
zh_hans: 现在，您可以运行您的机器学习工作了：

source: So far this should all look fairly familiar if you've used PyTorch before. Let's take the next step and use what we've built to create a federated learning system within FedBN, the sytstem consists of one server and two clients.
fr: Jusqu'à présent, tout ceci devrait te sembler assez familier si tu as déjà utilisé PyTorch. Passons à l'étape suivante et utilisons ce que nous avons construit pour créer un système d'apprentissage fédéré au sein de FedBN, le système se compose d'un serveur et de deux clients.
zh_hans: 到目前为止，如果您以前使用过 PyTorch，这一切看起来应该相当熟悉。让我们进行下一步，使用我们所构建的内容在 FedBN 中创建一个联邦学习系统，该系统由一个服务器和两个客户端组成。

source: Federated Training
fr: Formation fédérée
zh_hans: 联邦培训

source: If you have read `Example: PyTorch - From Centralized To Federated <https://flower.dev/docs/examples/pytorch-from-centralized-to-federated.html>`_, the following parts are easy to follow, onyl :code:`get_parameters` and :code:`set_parameters` function in :code:`client.py` needed to revise. If not, please read the `Example: PyTorch - From Centralized To Federated <https://flower.dev/docs/examples/pytorch-from-centralized-to-federated.html>`_. first.
zh_hans: 如果你读过 `示例： PyTorch - 从集中式到联邦式 <https://flower.dev/docs/examples/pytorch-from-centralized-to-federated.html>`_，下面的部分就很容易理解了，只需要修改 :code:`get_parameters` 和 :code:`set_parameters` 中的 :code:`client.py` 函数。如果没有，请阅读 `示例： PyTorch - 从集中式到联邦式 <https://flower.dev/docs/examples/pytorch-from-centralized-to-federated.html>`_。

source: Our example consists of one *server* and two *clients*. In FedBN, :code:`server.py` keeps unchanged, we can start the server directly.
fr: Notre exemple consiste en un *serveur* et deux *clients*. Dans FedBN, :code:`server.py` reste inchangé, nous pouvons démarrer le serveur directement.
zh_hans: 我们的示例包括一个*服务器*和两个*客户端*。在 FedBN 中，:code:`server.py` 保持不变，我们可以直接启动服务器。

source: Finally, we will revise our *client* logic by changing :code:`get_parameters` and :code:`set_parameters` in :code:`client.py`, we will exclude batch normalization parameters from model parameter list when sending to or receiving from the server.
fr: Enfin, nous allons réviser notre logique *client* en modifiant :code:`get_parameters` et :code:`set_parameters` dans :code:`client.py`, nous allons exclure les paramètres de normalisation des lots de la liste des paramètres du modèle lors de l'envoi ou de la réception depuis le serveur.
zh_hans: 最后，我们将修改 *client* 的逻辑，修改 :code:`client.py` 中的 :code:`get_parameters` 和 :code:`set_parameters`，在向服务器发送或从服务器接收时，我们将从模型参数列表中排除batch normalization层的参数。

source: Now, you can now open two additional terminal windows and run
fr: Tu peux maintenant ouvrir deux autres fenêtres de terminal et lancer
zh_hans: 现在，您可以打开另外两个终端窗口并运行程序

source: in each window (make sure that the server is still running before you do so) and see your (previously centralized) PyTorch project run federated learning with FedBN strategy across two clients. Congratulations!
fr: dans chaque fenêtre (assure-toi que le serveur est toujours en cours d'exécution avant de le faire) et tu verras ton projet PyTorch (auparavant centralisé) exécuter l'apprentissage fédéré avec la stratégie FedBN sur deux clients. Félicitations !
zh_hans: 确保服务器仍在运行后，然后您就能看到您的 PyTorch 项目（之前是集中式的）通过 FedBN 策略在两个客户端上运行联合学习。祝贺！

source: Next Steps
fr: Prochaines étapes
zh_hans: 下一步工作

source: The full source code for this example can be found `here <https://github.com/adap/flower/blob/main/examples/pytorch-from-centralized-to-federated>`_. Our example is of course somewhat over-simplified because both clients load the exact same dataset, which isn't realistic. You're now prepared to explore this topic further. How about using different subsets of CIFAR-10 on each client? How about adding more clients?
zh_hans: 本示例的完整源代码可在 <https://github.com/adap/flower/blob/main/examples/pytorch-from-centralized-to-federated>`_ 找到。当然，我们的示例有些过于简单，因为两个客户端都加载了完全相同的数据集，这并不真实。让我们准备好进一步探讨这一主题。如在每个客户端使用不同的 CIFAR-10 子集，或者增加客户端的数量。

source: Example: JAX - Run JAX Federated
fr: Exemple : JAX - Exécuter JAX Federated
zh_hans: 示例： JAX - 运行联邦式 JAX

source: This tutorial will show you how to use Flower to build a federated version of an existing JAX workload. We are using JAX to train a linear regression model on a scikit-learn dataset. We will structure the example similar to our `PyTorch - From Centralized To Federated <https://github.com/adap/flower/blob/main/examples/pytorch-from-centralized-to-federated>`_ walkthrough. First, we build a centralized training approach based on the `Linear Regression with JAX <https://coax.readthedocs.io/en/latest/examples/linear_regression/jax.html>`_ tutorial`. Then, we build upon the centralized training code to run the training in a federated fashion.
zh_hans: 本教程将向您展示如何使用 Flower 构建现有 JAX 的联邦学习版本。我们将使用 JAX 在 scikit-learn 数据集上训练线性回归模型。我们将采用与 `PyTorch - 从集中式到联邦式 <https://github.com/adap/flower/blob/main/examples/pytorch-from-centralized-to-federated>`_ 教程中类似的示例结构。首先，我们根据 `JAX 的线性回归 <https://coax.readthedocs.io/en/latest/examples/linear_regression/jax.html>`_ 教程构建集中式训练方法。然后，我们在集中式训练代码的基础上以联邦方式运行训练。

source: Before we start building our JAX example, we need install the packages :code:`jax`, :code:`jaxlib`, :code:`scikit-learn`, and :code:`flwr`:
fr: Avant de commencer à construire notre exemple JAX, nous devons installer les paquets :code:`jax`, :code:`jaxlib`, :code:`scikit-learn`, et :code:`flwr` :
zh_hans: 在开始构建 JAX 示例之前，我们需要安装软件包 :code:`jax`、:code:`jaxlib`、:code:`scikit-learn` 和 :code:`flwr`：

source: Linear Regression with JAX
fr: Régression linéaire avec JAX
zh_hans: 使用 JAX 进行线性回归

source: We begin with a brief description of the centralized training code based on a :code:`Linear Regression` model. If you want a more in-depth explanation of what's going on then have a look at the official `JAX documentation <https://jax.readthedocs.io/>`_.
fr: Nous commençons par une brève description du code d'entraînement centralisé basé sur un modèle :code:`Régression linéaire`. Si tu veux une explication plus approfondie de ce qui se passe, jette un coup d'œil à la documentation officielle `JAX <https://jax.readthedocs.io/>`_.
zh_hans: 首先，我们将简要介绍基于 :code:`Linear Regression` 模型的集中式训练代码。如果您想获得更深入的解释，请参阅官方的 `JAX 文档 <https://jax.readthedocs.io/>`_。

source: Let's create a new file called :code:`jax_training.py` with all the components required for a traditional (centralized) linear regression training. First, the JAX packages :code:`jax` and :code:`jaxlib` need to be imported. In addition, we need to import :code:`sklearn` since we use :code:`make_regression` for the dataset and :code:`train_test_split` to split the dataset into a training and test set. You can see that we do not yet import the :code:`flwr` package for federated learning. This will be done later.
fr: Créons un nouveau fichier appelé :code:`jax_training.py` avec tous les composants nécessaires pour un apprentissage traditionnel (centralisé) de la régression linéaire. Tout d'abord, les paquets JAX :code:`jax` et :code:`jaxlib` doivent être importés. En outre, nous devons importer :code:`sklearn` puisque nous utilisons :code:`make_regression` pour le jeu de données et :code:`train_test_split` pour diviser le jeu de données en un jeu d'entraînement et un jeu de test. Tu peux voir que nous n'avons pas encore importé le paquet :code:`flwr` pour l'apprentissage fédéré, ce qui sera fait plus tard.
zh_hans: 让我们创建一个名为 :code:`jax_training.py` 的新文件，其中包含传统（集中式）线性回归训练所需的所有组件。首先，需要导入 JAX 包 :code:`jax` 和 :code:`jaxlib`。此外，我们还需要导入 :code:`sklearn`，因为我们使用 :code:`make_regression` 创建数据集，并使用 :code:`train_test_split` 将数据集拆分成训练集和测试集。您可以看到，我们还没有导入用于联邦学习的 :code:`flwr` 软件包，这将在稍后完成。

source: The :code:`load_data()` function loads the mentioned training and test sets.
fr: La fonction :code:`load_data()` charge les ensembles d'entraînement et de test mentionnés.
zh_hans: :code:`load_data()` 函数会加载上述训练集和测试集。

source: The model architecture (a very simple :code:`Linear Regression` model) is defined in :code:`load_model()`.
fr: L'architecture du modèle (un modèle :code:`Régression linéaire` très simple) est définie dans :code:`load_model()`.
zh_hans: 模型结构（一个非常简单的 :code:`Linear Regression` 线性回归模型）在 :code:`load_model()` 中定义。

source: We now need to define the training (function :code:`train()`), which loops over the training set and measures the loss (function :code:`loss_fn()`) for each batch of training examples. The loss function is separate since JAX takes derivatives with a :code:`grad()` function (defined in the :code:`main()` function and called in :code:`train()`).
fr: Nous devons maintenant définir l'entraînement (fonction :code:`train()`), qui boucle sur l'ensemble d'entraînement et mesure la perte (fonction :code:`loss_fn()`) pour chaque lot d'exemples d'entraînement. La fonction de perte est séparée puisque JAX prend des dérivés avec une fonction :code:`grad()` (définie dans la fonction :code:`main()` et appelée dans :code:`train()`).
zh_hans: 现在，我们需要定义训练函数（ :code:`train()`）。它循环遍历训练集，并计算每批训练数据的损失值（函数 :code:`loss_fn()`）。由于 JAX 使用 :code:`grad()` 函数提取导数（在 :code:`main()` 函数中定义，并在 :code:`train()` 中调用），因此损失函数是独立的。

source: The evaluation of the model is defined in the function :code:`evaluation()`. The function takes all test examples and measures the loss of the linear regression model.
fr: L'évaluation du modèle est définie dans la fonction :code:`evaluation()`. La fonction prend tous les exemples de test et mesure la perte du modèle de régression linéaire.
zh_hans: 模型的评估在函数 :code:`evaluation()` 中定义。该函数获取所有测试数据，并计算线性回归模型的损失值。

source: Having defined the data loading, model architecture, training, and evaluation we can put everything together and train our model using JAX. As already mentioned, the :code:`jax.grad()` function is defined in :code:`main()` and passed to :code:`train()`.
fr: Après avoir défini le chargement des données, l'architecture du modèle, l'entraînement et l'évaluation, nous pouvons tout assembler et entraîner notre modèle à l'aide de JAX. Comme nous l'avons déjà mentionné, la fonction :code:`jax.grad()` est définie dans :code:`main()` et transmise à :code:`train()`.
zh_hans: 在定义了数据加载、模型架构、训练和评估之后，我们就可以把这些放在一起，使用 JAX 训练我们的模型了。如前所述，:code:`jax.grad()` 函数在 :code:`main()` 中定义，并传递给 :code:`train()`。

source: You can now run your (centralized) JAX linear regression workload:
fr: Tu peux maintenant exécuter ta charge de travail (centralisée) de régression linéaire JAX :
zh_hans: 现在您可以运行（集中式）JAX 线性回归工作了：

source: So far this should all look fairly familiar if you've used JAX before. Let's take the next step and use what we've built to create a simple federated learning system consisting of one server and two clients.
fr: Jusqu'à présent, tout cela devrait te sembler assez familier si tu as déjà utilisé JAX. Passons à l'étape suivante et utilisons ce que nous avons construit pour créer un simple système d'apprentissage fédéré composé d'un serveur et de deux clients.
zh_hans: 到目前为止，如果你以前使用过 JAX，就会对这一切感到很熟悉。下一步，让我们利用已构建的代码创建一个简单的联邦学习系统（一个服务器和两个客户端）。

source: JAX meets Flower
fr: JAX rencontre Flower
zh_hans: JAX 结合 Flower
