Repository: lucacorbucci/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: fr, zh_hans

source: Once the server is running we can start the clients in different terminals. Build and run the client through your Xcode, one through Xcode Simulator and the other by deploying it to your iPhone. To see more about how to deploy your app to iPhone or Simulator visit `here <https://developer.apple.com/documentation/xcode/running-your-app-in-simulator-or-on-a-device>`_.
zh_hans: 服务器运行后，我们就可以在不同的终端启动客户端。通过 Xcode 构建并运行客户端，一个通过 Xcode 模拟器，另一个通过部署到 iPhone。要了解更多有关如何将应用程序部署到 iPhone 或模拟器的信息，请访问 `此处 <https://developer.apple.com/documentation/xcode/running-your-app-in-simulator-or-on-a-device>`_。

source: Congratulations! You've successfully built and run your first federated learning system in your ios device. The full `source code <https://github.com/adap/flower/blob/main/examples/ios>`_ for this example can be found in :code:`examples/ios`.
zh_hans: 恭喜您！ 您已经成功地在 ios 设备中构建并运行了第一个联邦学习系统。本示例的`完整源代码 <https://github.com/adap/flower/blob/main/examples/ios>`_ 可在 :code:`examples/ios` 中找到。

source: Check out this Federated Learning quickstart tutorial for using Flower with Jax to train a linear regression model on a scikit-learn dataset.
zh_hans: 查看此联邦学习快速入门教程，了解如何使用 Flower 和 Jax 在 scikit-learn 数据集上训练线性回归模型。

source: Quickstart JAX
fr: Démarrage rapide de JAX
zh_hans: 快速入门 JAX

source: Check out this Federated Learning quickstart tutorial for using Flower with MXNet to train a Sequential model on MNIST.
zh_hans: 查看此联邦学习 快速入门教程，了解如何使用 Flower 和 MXNet 在 MNIST 上训练序列模型。

source: Quickstart MXNet
fr: Démarrage rapide de MXNet
zh_hans: 快速入门 MXNet

source: In this tutorial, we will learn how to train a :code:`Sequential` model on MNIST using Flower and MXNet.
fr: Dans ce tutoriel, nous allons apprendre à former un modèle :code:`Sequential` sur MNIST à l'aide de Flower et de MXNet.
zh_hans: 在本教程中，我们将学习如何使用 Flower 和 MXNet 在 MNIST 上训练 :code:`Sequential` 模型。

source: It is recommended to create a virtual environment and run everything within this `virtualenv <https://flower.dev/docs/recommended-env-setup.html>`_.
fr: Il est recommandé de créer un environnement virtuel et de tout exécuter dans ce `virtualenv <https://flower.dev/docs/recommended-env-setup.html>`_.
zh_hans: 建议创建一个虚拟环境，并在此 `virtualenv <https://flower.dev/docs/recommended-env-setup.html>`_ 中运行所有内容。

source: *Clients* are responsible for generating individual model parameter updates for the model based on their local datasets. These updates are then sent to the *server* which will aggregate them to produce an updated global model. Finally, the *server* sends this improved version of the model back to each *client*. A complete cycle of parameters updates is called a *round*.
fr: *Les clients* sont chargés de générer des mises à jour individuelles des paramètres du modèle en fonction de leurs ensembles de données locales. Ces mises à jour sont ensuite envoyées au *serveur* qui les agrège pour produire un modèle global mis à jour. Enfin, le *serveur* renvoie cette version améliorée du modèle à chaque *client*. Un cycle complet de mises à jour des paramètres s'appelle un *round*.
zh_hans: *客户端*负责根据其本地数据集为模型生成单独的模型参数更新。然后，这些参数更新将被发送到*服务器*，由*服务器*汇总后生成一个更新的全局模型。最后，*服务器*将这一改进版模型发回给每个*客户端*。一个完整的参数更新周期称为一*轮*。

source: Now that we have a rough idea of what is going on, let's get started. We first need to install Flower. You can do this by running:
fr: Maintenant que nous avons une idée approximative de ce qui se passe, commençons. Nous devons d'abord installer Flower. Tu peux le faire en lançant :
zh_hans: 现在，我们已经有了一个大致的概念，让我们开始吧。首先，我们需要安装 Flower。运行：

source: Since we want to use MXNet, let's go ahead and install it:
fr: Puisque nous voulons utiliser MXNet, allons-y et installons-le :
zh_hans: 既然我们要使用 MXNet，那就继续安装吧：

source: Now that we have all our dependencies installed, let's run a simple distributed training with two clients and one server. Our training procedure and network architecture are based on MXNet´s `Hand-written Digit Recognition tutorial <https://mxnet.apache.org/api/python/docs/tutorials/packages/gluon/image/mnist.html>`_.
fr: Maintenant que toutes nos dépendances sont installées, lançons une formation distribuée simple avec deux clients et un serveur. Notre procédure de formation et l'architecture du réseau sont basées sur le tutoriel de reconnaissance de chiffres écrits à la main du MXNet <https://mxnet.apache.org/api/python/docs/tutorials/packages/gluon/image/mnist.html>`_.
zh_hans: 现在，我们已经安装了所有依赖项，让我们用两个客户端和一个服务器来运行一个简单的分布式训练。我们的训练程序和网络架构基于 MXNet 的 `手写数字识别教程 <https://mxnet.apache.org/api/python/docs/tutorials/packages/gluon/image/mnist.html>`_"。

source: In a file called :code:`client.py`, import Flower and MXNet related packages:
fr: Dans un fichier appelé :code:`client.py`, importe Flower et les paquets liés au MXNet :
zh_hans: 在名为 :code:`client.py` 的文件中，导入 Flower 和 MXNet 相关软件包：

source: In addition, define the device allocation in MXNet with:
fr: En outre, définis l'attribution de l'appareil dans MXNet avec :
zh_hans: 此外，还可以在 MXNet 中定义设备分配：

source: We use MXNet to load MNIST, a popular image classification dataset of handwritten digits for machine learning. The MXNet utility :code:`mx.test_utils.get_mnist()` downloads the training and test data.
fr: Nous utilisons MXNet pour charger MNIST, un ensemble de données de classification d'images populaire de chiffres manuscrits pour l'apprentissage automatique. L'utilitaire MXNet :code:`mx.test_utils.get_mnist()` télécharge les données d'entraînement et de test.
zh_hans: 我们使用 MXNet 加载 MNIST，这是一个用于机器学习的流行手写数字图像分类数据集。MXNet 工具 :code:`mx.test_utils.get_mnist()` 会下载训练和测试数据。

source: Define the training and loss with MXNet. We train the model by looping over the dataset, measure the corresponding loss, and optimize it.
fr: Définis l'entraînement et la perte avec MXNet. Nous entraînons le modèle en parcourant en boucle l'ensemble des données, nous mesurons la perte correspondante et nous l'optimisons.
zh_hans: 用 MXNet 定义训练和损失值。我们在数据集上循环训练模型，测量相应的损失值，并对其进行优化。

source: Next, we define the validation of our machine learning model. We loop over the test set and measure both loss and accuracy on the test set.
fr: Ensuite, nous définissons la validation de notre modèle d'apprentissage automatique. Nous effectuons une boucle sur l'ensemble de test et mesurons à la fois la perte et la précision sur l'ensemble de test.
zh_hans: 接下来，我们定义机器学习模型的验证。我们在测试集上循环，测量测试集上的损失值和准确率。

source: After defining the training and testing of a MXNet machine learning model, we use these functions to implement a Flower client.
fr: Après avoir défini la formation et le test d'un modèle d'apprentissage automatique MXNet, nous utilisons ces fonctions pour mettre en œuvre un client Flower.
zh_hans: 在定义了 MXNet 机器学习模型的训练和测试后，我们使用这些函数实现了 Flower 客户端。

source: Our Flower clients will use a simple :code:`Sequential` model:
fr: Nos clients Flower utiliseront un modèle simple :code:`Sequential` :
zh_hans: 我们的 Flower 客户端将使用简单的 :code:`Sequential` 模型：

source: After loading the dataset with :code:`load_data()` we perform one forward propagation to initialize the model and model parameters with :code:`model(init)`. Next, we implement a Flower client.
fr: Après avoir chargé l'ensemble de données avec :code:`load_data()`, nous effectuons une propagation vers l'avant pour initialiser le modèle et les paramètres du modèle avec :code:`model(init)`. Ensuite, nous implémentons un client Flower.
zh_hans: 使用 :code:`load_data()` 加载数据集后，我们会执行一次前向传播，使用 :code:`model(init)` 初始化模型和模型参数。接下来，我们实现一个 Flower 客户端。

source: The Flower server interacts with clients through an interface called :code:`Client`. When the server selects a particular client for training, it sends training instructions over the network. The client receives those instructions and calls one of the :code:`Client` methods to run your code (i.e., to train the neural network we defined earlier).
fr: Le serveur Flower interagit avec les clients par le biais d'une interface appelée :code:`Client`. Lorsque le serveur sélectionne un client particulier pour la formation, il envoie des instructions de formation sur le réseau. Le client reçoit ces instructions et appelle l'une des méthodes :code:`Client` pour exécuter ton code (c'est-à-dire pour former le réseau neuronal que nous avons défini plus tôt).
zh_hans: Flower 服务器通过一个名为 :code:`Client` 的接口与客户端交互。当服务器选择一个特定的客户端进行训练时，它会通过网络发送训练指令。客户端接收到这些指令后，会调用 :code:`Client` 方法之一来运行您的代码（即训练我们之前定义的神经网络）。

source: Flower provides a convenience class called :code:`NumPyClient` which makes it easier to implement the :code:`Client` interface when your workload uses MXNet. Implementing :code:`NumPyClient` usually means defining the following methods (:code:`set_parameters` is optional though):
fr: Flower fournit une classe de commodité appelée :code:`NumPyClient` qui facilite l'implémentation de l'interface :code:`Client` lorsque ta charge de travail utilise MXNet. L'implémentation de :code:`NumPyClient` signifie généralement la définition des méthodes suivantes (:code:`set_parameters` est cependant facultatif) :
zh_hans: Flower 提供了一个名为 :code:`NumPyClient` 的便捷类，当您的工作负载使用 MXNet 时，它可以让您更轻松地实现 :code:`Client` 接口。实现 :code:`NumPyClient` 通常意味着定义以下方法（:code:`set_parameters` 是可选的）：

source: return the model weight as a list of NumPy ndarrays
fr: renvoie le poids du modèle sous la forme d'une liste de ndarrays NumPy
zh_hans: 以 NumPy ndarrays 列表形式返回模型参数

source: :code:`set_parameters` (optional)
fr: :code:`set_parameters` (optionnel)
zh_hans: :code:`set_parameters` （可选）

source: update the local model weights with the parameters received from the server
fr: mettre à jour les poids du modèle local avec les paramètres reçus du serveur
zh_hans: 用从服务器接收到的参数更新本地模型参数

source: set the local model weights
fr: fixe les poids du modèle local
zh_hans: 设置本地模型参数

source: train the local model
fr: entraîne le modèle local
zh_hans: 训练本地模型

source: receive the updated local model weights
fr: recevoir les poids du modèle local mis à jour
zh_hans: 接收更新的本地模型参数

source: test the local model
fr: teste le modèle local
zh_hans: 测试本地模型

source: They can be implemented in the following way:
fr: Ils peuvent être mis en œuvre de la manière suivante :
zh_hans: 它们可以通过以下方式实现：

source: We can now create an instance of our class :code:`MNISTClient` and add one line to actually run this client:
fr: Nous pouvons maintenant créer une instance de notre classe :code:`MNISTClient` et ajouter une ligne pour exécuter ce client :
zh_hans: 现在我们可以创建一个 :code:`MNISTClient` 类的实例，并添加一行来实际运行该客户端：

source: That's it for the client. We only have to implement :code:`Client` or :code:`NumPyClient` and call :code:`fl.client.start_client()`. The string :code:`"0.0.0.0:8080"` tells the client which server to connect to. In our case we can run the server and the client on the same machine, therefore we use :code:`"0.0.0.0:8080"`. If we run a truly federated workload with the server and clients running on different machines, all that needs to change is the :code:`server_address` we pass to the client.
fr: C'est tout pour le client. Il nous suffit d'implémenter :code:`Client` ou :code:`NumPyClient` et d'appeler :code:`fl.client.start_client()`. La chaîne :code:`"0.0.0:8080"` indique au client à quel serveur se connecter. Dans notre cas, nous pouvons exécuter le serveur et le client sur la même machine, c'est pourquoi nous utilisons :code:`"0.0.0:8080"`. Si nous exécutons une charge de travail véritablement fédérée avec le serveur et les clients s'exécutant sur des machines différentes, tout ce qui doit changer est :code:`server_address` que nous transmettons au client.
zh_hans: 对于客户端就需要做这么多。我们仅需要实现 :code:`Client`或者:code:`NumPyClient`然后调用:code:`fl.client.start_client()`。字符串 :code:`"0.0.0.0:8080"` 告诉客户端要连接到哪个服务器。在我们的例子中，我们可以在同一台机器上运行服务器和客户端，因此我们使用:code:`"0.0.0.0:8080"`。如果我们运行真正联邦学习的工作负载，服务器和客户端在不同的机器上运行，则需要更改的只是我们传递给客户端的 server_address 。

source: With both client and server ready, we can now run everything and see federated learning in action. Federated learning systems usually have a server and multiple clients. We therefore have to start the server first:
fr: Le client et le serveur étant prêts, nous pouvons maintenant tout exécuter et voir l'apprentissage fédéré en action. Les systèmes d'apprentissage fédéré ont généralement un serveur et plusieurs clients. Nous devons donc commencer par démarrer le serveur :
zh_hans: 客户端和服务器都准备就绪后，我们现在就可以运行一切，看看联邦学习的运行情况。联邦学习系统通常有一个服务器和多个客户端。因此，我们必须先启动服务器：

source: Once the server is running we can start the clients in different terminals. Open a new terminal and start the first client:
fr: Une fois que le serveur fonctionne, nous pouvons démarrer les clients dans différents terminaux. Ouvre un nouveau terminal et démarre le premier client :
zh_hans: 服务器运行后，我们就可以在不同终端启动客户端了。打开一个新终端，启动第一个客户端：

source: Open another terminal and start the second client:
fr: Ouvre un autre terminal et démarre le deuxième client :
zh_hans: 打开另一台终端，启动第二个客户端：

source: Each client will have its own dataset. You should now see how the training does in the very first terminal (the one that started the server):
fr: Chaque client aura son propre ensemble de données. Tu devrais maintenant voir comment la formation se déroule dans le tout premier terminal (celui qui a démarré le serveur) :
zh_hans: 每个客户端都有自己的数据集。现在你应该看到第一个终端（启动服务器的终端）的训练效果了：

source: Congratulations! You've successfully built and run your first federated learning system. The full `source code <https://github.com/adap/flower/blob/main/examples/quickstart-mxnet/client.py>`_ for this example can be found in :code:`examples/quickstart-mxnet`.
zh_hans: 恭喜您！您已经成功构建并运行了第一个联邦学习系统。本示例的`完整源代码 <https://github.com/adap/flower/blob/main/examples/quickstart-mxnet/client.py>`_ 可在 :code:`examples/quickstart-mxnet` 中找到。

source: Check out this Federated Learning quickstart tutorial for using Flower with Pandas to perform Federated Analytics.
zh_hans: 查看此联邦学习快速入门教程，了解如何使用 Flower 和 Pandas 执行联邦分析。

source: Quickstart Pandas
fr: Démarrage rapide des Pandas
zh_hans: 快速入门Pandas

source: Let's build a federated analytics system using Pandas and Flower!
fr: Construisons un système d'analyse fédéré à l'aide de Pandas et de Flower !
zh_hans: 让我们使用 Pandas 和 Flower 建立一个联邦分析系统！

source: Please refer to the `full code example <https://github.com/adap/flower/tree/main/examples/quickstart-pandas>`_ to learn more.
zh_hans: 请参阅 `完整代码示例 <https://github.com/adap/flower/tree/main/examples/quickstart-pandas>`_" 了解更多信息。

source: Check out this Federated Learning quickstart tutorial for using Flower with PyTorch to train a CNN model on MNIST.
zh_hans: 查看此联邦学习快速入门教程，了解如何使用 Flower 和 PyTorch 在 MNIST 上训练 CNN 模型。

source: In this tutorial we will learn how to train a Convolutional Neural Network on CIFAR10 using Flower and PyTorch.
fr: Dans ce tutoriel, nous allons apprendre à entraîner un réseau neuronal convolutif sur CIFAR10 à l'aide de Flower et PyTorch.
zh_hans: 在本教程中，我们将学习如何使用 Flower 和 PyTorch 在 CIFAR10 上训练卷积神经网络。

source: First of all, it is recommended to create a virtual environment and run everything within a `virtualenv <https://flower.dev/docs/recommended-env-setup.html>`_.
fr: Tout d'abord, il est recommandé de créer un environnement virtuel et de tout exécuter au sein d'un `virtualenv <https://flower.dev/docs/recommended-env-setup.html>`_.
zh_hans: 首先，建议创建一个虚拟环境，并在 `virtualenv <https://flower.dev/docs/recommended-env-setup.html>`_ 中运行一切。

source: Since we want to use PyTorch to solve a computer vision task, let's go ahead and install PyTorch and the **torchvision** library:
fr: Puisque nous voulons utiliser PyTorch pour résoudre une tâche de vision par ordinateur, allons-y et installons PyTorch et la bibliothèque **torchvision** :
zh_hans: 既然我们想用 PyTorch 解决计算机视觉任务，那就继续安装 PyTorch 和 **torchvision** 库吧：

source: Now that we have all our dependencies installed, let's run a simple distributed training with two clients and one server. Our training procedure and network architecture are based on PyTorch's `Deep Learning with PyTorch <https://pytorch.org/tutorials/beginner/blitz/cifar10_tutorial.html>`_.
fr: Maintenant que nous avons installé toutes nos dépendances, lançons une formation distribuée simple avec deux clients et un serveur. Notre procédure de formation et l'architecture de notre réseau sont basées sur `Deep Learning with PyTorch <https://pytorch.org/tutorials/beginner/blitz/cifar10_tutorial.html>`_ de PyTorch.
zh_hans: 现在我们已经安装了所有的依赖项，让我们用两个客户端和一个服务器来运行一个简单的分布式训练。我们的训练过程和网络架构基于 PyTorch 的《Deep Learning with PyTorch <https://pytorch.org/tutorials/beginner/blitz/cifar10_tutorial.html>`_》。

source: In a file called :code:`client.py`, import Flower and PyTorch related packages:
fr: Dans un fichier appelé :code:`client.py`, importe Flower et les paquets liés à PyTorch :
zh_hans: 在名为 :code:`client.py` 的文件中，导入 Flower 和 PyTorch 相关软件包：

source: In addition, we define the device allocation in PyTorch with:
fr: En outre, nous définissons l'attribution des appareils dans PyTorch avec :
zh_hans: 此外，我们还在 PyTorch 中定义了设备分配：

source: We use PyTorch to load CIFAR10, a popular colored image classification dataset for machine learning. The PyTorch :code:`DataLoader()` downloads the training and test data that are then normalized.
fr: Nous utilisons PyTorch pour charger CIFAR10, un ensemble de données de classification d'images colorées populaire pour l'apprentissage automatique. Le :code:`DataLoader()` de PyTorch télécharge les données d'entraînement et de test qui sont ensuite normalisées.
zh_hans: 我们使用 PyTorch 来加载 CIFAR10，这是一个用于机器学习的流行彩色图像分类数据集。PyTorch :code:`DataLoader()`下载训练数据和测试数据，然后进行归一化处理。

source: Define the loss and optimizer with PyTorch. The training of the dataset is done by looping over the dataset, measure the corresponding loss and optimize it.
fr: Définis la perte et l'optimiseur avec PyTorch L'entraînement de l'ensemble de données se fait en bouclant sur l'ensemble de données, en mesurant la perte correspondante et en l'optimisant.
zh_hans: 使用 PyTorch 定义损失和优化器。数据集的训练是通过循环数据集、测量相应的损失值并对其进行优化来完成的。

source: Define then the validation of the machine learning network. We loop over the test set and measure the loss and accuracy of the test set.
fr: Définis ensuite la validation du réseau d'apprentissage automatique. Nous passons en boucle sur l'ensemble de test et mesurons la perte et la précision de l'ensemble de test.
zh_hans: 然后定义机器学习网络的验证。我们在测试集上循环，计算测试集的损失值和准确率。

source: After defining the training and testing of a PyTorch machine learning model, we use the functions for the Flower clients.
fr: Après avoir défini l'entraînement et le test d'un modèle d'apprentissage automatique PyTorch, nous utilisons les fonctions pour les clients Flower.
zh_hans: 在定义了 PyTorch 机器学习模型的训练和测试之后，我们将这些功能用于 Flower 客户端。

source: The Flower clients will use a simple CNN adapted from 'PyTorch: A 60 Minute Blitz':
fr: Les clients de Flower utiliseront un CNN simple adapté de "PyTorch : A 60 Minute Blitz" :
zh_hans: Flower 客户端将使用一个简单的从“PyTorch： 60 分钟突击"改编的CNN：

source: After loading the data set with :code:`load_data()` we define the Flower interface.
fr: Après avoir chargé l'ensemble des données avec :code:`load_data()`, nous définissons l'interface Flower.
zh_hans: 使用 :code:`load_data()` 加载数据集后，我们定义了 Flower 接口。

source: Flower provides a convenience class called :code:`NumPyClient` which makes it easier to implement the :code:`Client` interface when your workload uses PyTorch. Implementing :code:`NumPyClient` usually means defining the following methods (:code:`set_parameters` is optional though):
fr: Flower fournit une classe de commodité appelée :code:`NumPyClient` qui facilite la mise en œuvre de l'interface :code:`Client` lorsque ta charge de travail utilise PyTorch. Mettre en œuvre :code:`NumPyClient` signifie généralement définir les méthodes suivantes (:code:`set_parameters` est cependant facultatif) :
zh_hans: Flower 提供了一个名为 :code:`NumPyClient` 的便捷类，当您的工作负载使用 PyTorch 时，它使 :code:`Client` 接口的实现变得更容易。实现 :code:`NumPyClient` 通常意味着定义以下方法（:code:`set_parameters` 是可选的）：

source: which can be implemented in the following way:
fr: qui peut être mis en œuvre de la manière suivante :
zh_hans: 可以通过以下方式实现：

source: We can now create an instance of our class :code:`CifarClient` and add one line to actually run this client:
fr: Nous pouvons maintenant créer une instance de notre classe :code:`CifarClient` et ajouter une ligne pour exécuter ce client :
zh_hans: 现在我们可以创建一个 :code:`CifarClient` 类的实例，并添加一行来实际运行该客户端：

source: That's it for the client. We only have to implement :code:`Client` or :code:`NumPyClient` and call :code:`fl.client.start_client()`. The string :code:`"[::]:8080"` tells the client which server to connect to. In our case we can run the server and the client on the same machine, therefore we use :code:`"[::]:8080"`. If we run a truly federated workload with the server and clients running on different machines, all that needs to change is the :code:`server_address` we point the client at.
fr: C'est tout pour le client. Il nous suffit d'implémenter :code:`Client` ou :code:`NumPyClient` et d'appeler :code:`fl.client.start_client()`. La chaîne :code:`"[: :]:8080"` indique au client à quel serveur se connecter. Dans notre cas, nous pouvons exécuter le serveur et le client sur la même machine, c'est pourquoi nous utilisons :code:`"[: :]:8080"`. Si nous exécutons une charge de travail véritablement fédérée avec le serveur et les clients fonctionnant sur des machines différentes, tout ce qui doit changer est l'adresse :code:`server_address` vers laquelle nous dirigeons le client.
zh_hans: 对于客户来说就是这样了。我们只需实现 :code:`Client` 或 :code:`NumPyClient` 并调用:code:`fl.client.start_client()` 即可。字符串 :code:`"[::]:8080"` 告诉客户端要连接到哪个服务器。在我们的例子中，我们可以在同一台机器上运行服务器和客户端，因此我们使用 :code:`"[::]:8080"`。如果我们运行真正联邦的工作负载，服务器和客户端运行在不同的机器上，则需要更改的只是我们指向客户端的 server_address 。

source: Congratulations! You've successfully built and run your first federated learning system. The full `source code <https://github.com/adap/flower/blob/main/examples/quickstart-pytorch/client.py>`_ for this example can be found in :code:`examples/quickstart-pytorch`.
zh_hans: 恭喜您！您已经成功构建并运行了第一个联邦学习系统。本示例的`完整源代码 <https://github.com/adap/flower/blob/main/examples/quickstart-pytorch/client.py>`_ 可以在 :code:`examples/quickstart-pytorch` 中找到。

source: Check out this Federated Learning quickstart tutorial for using Flower with PyTorch Lightning to train an Auto Encoder model on MNIST.
zh_hans: 查看此联邦学习快速入门教程，了解如何使用 Flower 和 PyTorch Lightning 在 MNIST 上训练自动编码器模型。

source: Quickstart PyTorch Lightning
fr: Démarrage rapide de PyTorch Lightning
zh_hans: 快速入门 PyTorch Lightning

source: Let's build a horizontal federated learning system using PyTorch Lightning and Flower!
zh_hans: 让我们使用 PyTorch Lightning 和 Flower 构建一个水平联邦学习系统！

source: Please refer to the `full code example <https://github.com/adap/flower/tree/main/examples/quickstart-pytorch-lightning>`_ to learn more.
zh_hans: 请参阅 `完整代码示例 <https://github.com/adap/flower/tree/main/examples/quickstart-pytorch-lightning>`_ 了解更多信息。

source: Check out this Federated Learning quickstart tutorial for using Flower with scikit-learn to train a linear regression model.
zh_hans: 查看此联邦学习快速入门教程，了解如何使用 Flower 和 scikit-learn 训练线性回归模型。

source: Quickstart scikit-learn
fr: Démarrage rapide de scikit-learn
zh_hans: scikit-learn快速入门

source: In this tutorial, we will learn how to train a :code:`Logistic Regression` model on MNIST using Flower and scikit-learn.
fr: Dans ce tutoriel, nous allons apprendre à former un :code:`modèle de régression logistique` sur MNIST en utilisant Flower et scikit-learn.
zh_hans: 在本教程中，我们将学习如何使用 Flower 和 scikit-learn 在 MNIST 上训练一个 :code:`Logistic Regression` 模型。

source: Since we want to use scikt-learn, let's go ahead and install it:
fr: Puisque nous voulons utiliser scikt-learn, allons-y et installons-le :
zh_hans: 既然我们要使用 scikt-learn，那就继续安装吧：
