Repository: lucacorbucci/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: fr, zh_hans

source: There are three ways to customize the way Flower orchestrates the learning process on the server side:
fr: Il y a trois façons de personnaliser la manière dont Flower orchestre le processus d'apprentissage du côté du serveur :
zh_hans: 有三种方法可以自定义 Flower 在服务器端协调学习过程的方式：

source: Use an existing strategy, for example, :code:`FedAvg`
fr: Utilise une stratégie existante, par exemple :code:`FedAvg`
zh_hans: 使用现有策略，例如 :code:`FedAvg`

source: Customize an existing strategy with callback functions
fr: Personnalise une stratégie existante avec des fonctions de rappel
zh_hans: 使用回调函数定制现有策略

source: Implement a novel strategy
fr: Mets en place une nouvelle stratégie
zh_hans: 实施新策略

source: Use an existing strategy
fr: Utilise une stratégie existante
zh_hans: 使用现有策略

source: Flower comes with a number of popular federated learning strategies built-in. A built-in strategy can be instantiated as follows:
fr: Flower intègre un certain nombre de stratégies d'apprentissage fédéré populaires. Une stratégie intégrée peut être instanciée comme suit :
zh_hans: Flower 内置了许多流行的联邦学习策略。内置策略的实例化方法如下：

source: This creates a strategy with all parameters left at their default values and passes it to the :code:`start_server` function. It is usually recommended to adjust a few parameters during instantiation:
fr: Cela crée une stratégie dont tous les paramètres sont laissés à leur valeur par défaut et la transmet à la fonction :code:`start_server`. Il est généralement recommandé d'ajuster quelques paramètres lors de l'instanciation :
zh_hans: 这会创建一个所有参数都保持默认值的策略，并将其传递给 :code:`start_server` 函数。通常建议在实例化过程中调整一些参数：

source: Existing strategies provide several ways to customize their behaviour. Callback functions allow strategies to call user-provided code during execution.
fr: Les stratégies existantes offrent plusieurs façons de personnaliser leur comportement. Les fonctions de rappel permettent aux stratégies d'appeler le code fourni par l'utilisateur pendant l'exécution.
zh_hans: 现有的策略提供了多种自定义行为的方法。回调函数允许策略在执行过程中调用用户提供的代码。

source: Configuring client fit and client evaluate
fr: Configurer l'adaptation et l'évaluation du client
zh_hans: 配置客户匹配和客户评估

source: The server can pass new configuration values to the client each round by providing a function to :code:`on_fit_config_fn`. The provided function will be called by the strategy and must return a dictionary of configuration key values pairs that will be sent to the client. It must return a dictionary of arbitraty configuration values :code:`client.fit` and :code:`client.evaluate` functions during each round of federated learning.
fr: Le serveur peut transmettre de nouvelles valeurs de configuration au client à chaque tour en fournissant une fonction à :code:`on_fit_config_fn`. La fonction fournie sera appelée par la stratégie et doit renvoyer un dictionnaire de paires de valeurs de clés de configuration qui seront envoyées au client. Elle doit renvoyer un dictionnaire de valeurs de configuration arbitraires :code:`client.fit` et :code:`client.evaluate` au cours de chaque tour d'apprentissage fédéré.
zh_hans: 服务器可以通过向 :code:`on_fit_config_fn` 提供一个函数，在每一轮向客户端传递新的配置值。提供的函数将被策略调用，并且必须返回一个配置键值对的字典，该字典将被发送到客户端。在每一轮联邦学习期间，它必须返回一个任意配置值 dictionary :code:`client.fit`和 :code:`client.evaluate`函数。

source: The :code:`on_fit_config_fn` can be used to pass arbitrary configuration values from server to client, and poetentially change these values each round, for example, to adjust the learning rate. The client will receive the dictionary returned by the :code:`on_fit_config_fn` in its own :code:`client.fit()` function.
fr: Le :code:`on_fit_config_fn` peut être utilisé pour passer des valeurs de configuration arbitraires du serveur au client, et changer poétiquement ces valeurs à chaque tour, par exemple pour ajuster le taux d'apprentissage. Le client recevra le dictionnaire renvoyé par le :code:`on_fit_config_fn` dans sa propre fonction :code:`client.fit()`.
zh_hans: :code:`on_fit_config_fn`可用于将任意配置值从服务器传递到客户端，并在每一轮改变这些值，例如，调整学习率。客户端将在自己的 :code:`client.fit()` 函数中接收 :code:`on_fit_config_fn` 返回的字典。

source: Similar to :code:`on_fit_config_fn`, there is also :code:`on_evaluate_config_fn` to customize the configuration sent to :code:`client.evaluate()`
fr: Comme pour :code:`on_fit_config_fn`, il existe aussi :code:`on_evaluate_config_fn` pour personnaliser la configuration envoyée à :code:`client.evaluate()`
zh_hans: 与 :code:`on_fit_config_fn` 类似，还有 :code:`on_evaluate_config_fn` 用于定制发送到 :code:`client.evaluate()` 的配置

source: Configuring server-side evaluation
fr: Configuration de l'évaluation côté serveur
zh_hans: 配置服务器端评估

source: Server-side evaluation can be enabled by passing an evaluation function to :code:`evaluate_fn`.
fr: L'évaluation côté serveur peut être activée en passant une fonction d'évaluation à :code:`evaluate_fn`.
zh_hans: 服务器端评估可通过向 :code:`evaluate_fn` 传递评估函数来启用。

source: Writing a fully custom strategy is a bit more involved, but it provides the most flexibility. Read the `Implementing Strategies <how-to-implement-strategies.html>`_ guide to learn more.
zh_hans: 编写完全自定义的策略涉及的内容较多，但灵活性最高。阅读 `实施策略 <how-to-implement-strategies.html>_ 指南，了解更多信息。

source: Tutorial
fr: Tutoriel
zh_hans: 教程

source: Quickstart tutorials
zh_hans: 快速入门教程

source: How-to guides
fr: Guides
zh_hans: 操作指南

source: Legacy example guides
zh_hans: 旧版指南范例

source: Explanations
fr: Explications
zh_hans: 说明

source: API reference
fr: Référence pour l'API
zh_hans: 应用程序接口参考

source: Reference docs
fr: Référence pour la documentation
zh_hans: 参考文档

source: Contributor tutorials
zh_hans: 贡献者教程

source: Contributor how-to guides
zh_hans: 投稿指南

source: Contributor explanations
zh_hans: 贡献者解释

source: Contributor references
zh_hans: 贡献者参考资料

source: Check out the documentation of the main Flower Framework enabling easy Python development for Federated Learning.
zh_hans: 查看主 Flower Framework 的文档，轻松实现联邦学习的 Python 开发。

source: Flower Framework Documentation
zh_hans: Flower 框架文档

source: Welcome to Flower's documentation. `Flower <https://flower.dev>`_ is a friendly federated learning framework.
fr: Bienvenue sur la documentation de Flower. `Flower <https://flower.dev>`_ est un framework de federated learning convivial et facile à utiliser.
zh_hans: 欢迎访问 Flower 文档。`Flower <https://flower.dev>`_ 是一个友好的联邦学习框架。

source: Join the Flower Community
fr: Rejoignez la communauté de Flower
zh_hans: 加入 Flower 社区

source: The Flower Community is growing quickly - we're a friendly group of researchers, engineers, students, professionals, academics, and other enthusiasts.
fr: Le communauté de Flower s'agrandit rapidement - on est un super groupe de chercheurs, ingénieurs, étudiants, professionnels, académiques, et autres hobbyistes.
zh_hans: Flower 社区发展迅速--我们是一个由研究人员、工程师、学生、专业人士、学者和其他爱好者组成的友好团体。

source: Join us on Slack
zh_hans: 在 Slack 上加入我们

source: Flower Framework
zh_hans: Flower 框架

source: The user guide is targeted at researchers and developers who want to use Flower to bring existing machine learning workloads into a federated setting. One of Flower's design goals was to make this simple. Read on to learn more.
fr: Ce guide utilisateur s'adresse à des chercheurs et des développeurs qui veulent utiliser Flower pour transposer des workloads de Machine Learning existantes dans un scenario fédéré. Un des buts de Flower est de rendre cela le plus evident possible. Lisez la suite pour en apprendre plus.
zh_hans: 该用户指南面向希望使用 Flower 将现有机器学习工作负载引入联邦环境的研究人员和开发人员。Flower 的设计目标之一就是让这一切变得简单。请继续阅读，了解更多信息。

source: Tutorials
fr: Tutoriels
zh_hans: 教程

source: A learning-oriented series of federated learning tutorials, the best place to start.
fr: Une serie de tutoriels de Federated Learning, l'endroit parfait pour débuter.
zh_hans: 以学习为导向的联邦学习教程系列，最好的起点。

source: QUICKSTART TUTORIALS: :doc:`PyTorch <tutorial-quickstart-pytorch>` | :doc:`TensorFlow <tutorial-quickstart-tensorflow>` | :doc:`🤗 Transformers <tutorial-quickstart-huggingface>` | :doc:`JAX <tutorial-quickstart-jax>` | :doc:`Pandas <tutorial-quickstart-pandas>` | :doc:`fastai <tutorial-quickstart-fastai>` | :doc:`PyTorch Lightning <tutorial-quickstart-pytorch-lightning>` | :doc:`MXNet <tutorial-quickstart-mxnet>` | :doc:`scikit-learn <tutorial-quickstart-scikitlearn>` | :doc:`XGBoost <tutorial-quickstart-xgboost>` | :doc:`Android <tutorial-quickstart-android>` | :doc:`iOS <tutorial-quickstart-ios>`
zh_hans: 快速入门教程: :doc:`PyTorch <tutorial-quickstart-pytorch>` | :doc:`TensorFlow <tutorial-quickstart-tensorflow>` | :doc:`🤗 Transformers <tutorial-quickstart-huggingface>` | :doc:`JAX <tutorial-quickstart-jax>` | :doc:`Pandas <tutorial-quickstart-pandas>` | :doc:`fastai <tutorial-quickstart-fastai>` | :doc:`PyTorch Lightning <tutorial-quickstart-pytorch-lightning>` | :doc:`MXNet <tutorial-quickstart-mxnet>` | :doc:`scikit-learn <tutorial-quickstart-scikitlearn>` | :doc:`XGBoost <tutorial-quickstart-xgboost>` | :doc:`Android <tutorial-quickstart-android>` | :doc:`iOS <tutorial-quickstart-ios>`

source: We also made video tutorials for PyTorch:
zh_hans: 我们还为 PyTorch 制作了视频教程：

source: And TensorFlow:
zh_hans: 还有 TensorFlow：

source: Problem-oriented how-to guides show step-by-step how to achieve a specific goal.
fr: Guides orientés sur la résolutions étapes par étapes de problèmes ou objectifs specifiques.
zh_hans: 以问题为导向的 "如何做 "指南逐步展示如何实现特定目标。

source: Understanding-oriented concept guides explain and discuss key topics and underlying ideas behind Flower and collaborative AI.
fr: Guides orientés sur la compréhension et l'explication des sujets et idées de fonds sur lesquels sont construits Flower et l'IA collaborative.
zh_hans: 以理解为导向的概念指南解释并讨论了Flower和协作式人工智能背后的关键主题和基本思想。

source: References
zh_hans: 参考资料

source: Information-oriented API reference and other reference material.
fr: Référence de l'API orientée sur l'information pure.
zh_hans: 以信息为导向的 API 参考资料和其他参考资料。

source: Contributor docs
zh_hans: 贡献者文档

source: The Flower community welcomes contributions. The following docs are intended to help along the way.
zh_hans: Flower 社区欢迎您的贡献。以下文档旨在为您提供帮助。

source: Flower CLI reference
zh_hans: Flower CLI 参考

source: flwr (Python API reference)
zh_hans: flwr（Python API 参考）

source: client
zh_hans: 客户端

source: Flower client.
zh_hans: Flower 客户端。

source: Abstract base class for Flower clients.
zh_hans: Flower 客户端的抽象基类。

source: Evaluate the provided parameters using the locally held dataset.
zh_hans: 使用本地数据集评估所提供的参数。

source: Parameters
zh_hans: 参数

source: The evaluation instructions containing (global) model parameters received from the server and a dictionary of configuration values used to customize the local evaluation process.
zh_hans: 评估指令包含从服务器接收的（全局）模型参数，以及用于定制本地评估流程的配置值字典。

source: Returns
zh_hans: 返回

source: The evaluation result containing the loss on the local dataset and other details such as the number of local data examples used for evaluation.
zh_hans: 评估结果包含本地数据集上的损失值和其他详细信息，如用于评估的本地数据的数量。

source: Return type
zh_hans: 返回类型

source: Refine the provided parameters using the locally held dataset.
zh_hans: 利用本地数据集完善所提供的参数。

source: The training instructions containing (global) model parameters received from the server and a dictionary of configuration values used to customize the local training process.
zh_hans: 训练指令，包含从服务器接收的（全局）模型参数，以及用于定制本地训练过程的配置值字典。

source: The training result containing updated parameters and other details such as the number of local training examples used for training.
zh_hans: 训练结果包含更新的参数和其他详细信息，如用于训练的本地训练示例的数量。

source: Return the current local model parameters.
zh_hans: 返回当前本地模型参数。

source: The get parameters instructions received from the server containing a dictionary of configuration values.
zh_hans: 从服务器接收的获取参数指令包含配置值字典。

source: The current local model parameters.
zh_hans: 当前的本地模型参数。

source: Return set of client's properties.
zh_hans: 返回客户端的属性集。

source: The get properties instructions received from the server containing a dictionary of configuration values.
zh_hans: 从服务器接收的获取属性指令包含配置值字典。

source: The current client properties.
zh_hans: 当前客户端属性。

source: Return client (itself).
zh_hans: 返回客户端（本身）。

source: start_client
zh_hans: 启动客户端

source: Start a Flower client node which connects to a Flower server.
zh_hans: 启动一个 Flower 客户节点，连接到 Flower 服务器。

source: The IPv4 or IPv6 address of the server. If the Flower server runs on the same machine on port 8080, then `server_address` would be `"[::]:8080"`.
zh_hans: 服务器的 IPv4 或 IPv6 地址：如果 Flower 服务器在同一台机器上运行，端口为 8080，则`server_address`应为`"[::]:8080"`。

source: A callable that instantiates a Client. (default: None)
zh_hans: 用于实例化客户端的可调用程序。(默认值：无）

source: An implementation of the abstract base class `flwr.client.Client` (default: None)
zh_hans: 抽象基类 `flwr.client.Client` 的实现（默认值：无）

source: The maximum length of gRPC messages that can be exchanged with the Flower server. The default should be sufficient for most models. Users who train very large models might need to increase this value. Note that the Flower server needs to be started with the same value (see `flwr.server.start_server`), otherwise it will not know about the increased limit and block larger messages.
zh_hans: 可与 Flower 服务器交换的 gRPC 信息的最大长度：默认值对大多数模型都足够了。训练超大模型的用户可能需要增加该值。请注意，Flower 服务器需要以相同的值启动（请参阅 `flwr.server.start_server`），否则它将不知道增加的限制并阻止更大的消息。

source: The PEM-encoded root certificates as a byte string or a path string. If provided, a secure connection using the certificates will be established to an SSL-enabled Flower server.
zh_hans: 字节字符串或路径字符串形式的 PEM 编码根证书。如果提供，将使用这些证书与启用 SSL 的 Flower 服务器建立安全连接。

source: Configure the transport layer. Allowed values: - 'grpc-bidi': gRPC, bidirectional streaming - 'grpc-rere': gRPC, request-response (experimental) - 'rest': HTTP (experimental)
zh_hans: 配置传输层：允许的值包括 - 'grpc-bidi': gRPC，双向流 - 'grpc-rere': gRPC，请求-响应（实验性） - 'rest': HTTP（实验性）

source: Examples
zh_hans: 实例

source: Starting a gRPC client with an insecure server connection:
zh_hans: 使用不安全的服务器连接启动 gRPC 客户端：

source: Starting an SSL-enabled gRPC client:
zh_hans: 启动支持 SSL 的 gRPC 客户端：

source: Abstract base class for Flower clients using NumPy.
zh_hans: 使用 NumPy 的 Flower 客户端的抽象基类。

source: The current (global) model parameters.
zh_hans: 当前（全局）模型参数。

source: Configuration parameters which allow the server to influence evaluation on the client. It can be used to communicate arbitrary values from the server to the client, for example, to influence the number of examples used for evaluation.
zh_hans: 允许服务器影响客户端评估的配置参数。它可用于将任意值从服务器传送到客户端，例如，影响用于评估的示例数量。

source: * **loss** (*float*) -- The evaluation loss of the model on the local dataset. * **num_examples** (*int*) -- The number of examples used for evaluation. * **metrics** (*Dict[str, Scalar]*) -- A dictionary mapping arbitrary string keys to values of type bool, bytes, float, int, or str. It can be used to communicate arbitrary values back to the server.
zh_hans: **loss** (*float*) -- 模型在本地数据集上的评估损失值。**num_examples** (*int*) -- 用于评估的示例数量。**metrics** (*Dict[str, Scalar]*) -- 将任意字符串键映射到 bool、bytes、float、int 或 str 类型值的字典。它可用于将任意值传回服务器。

source: **loss** (*float*) -- The evaluation loss of the model on the local dataset.
zh_hans: **loss** (*float*) -- 模型在本地数据集上的评估损失值。

source: **num_examples** (*int*) -- The number of examples used for evaluation.
zh_hans: **num_examples** (*int*) -- 用于评估的示例数量。

source: **metrics** (*Dict[str, Scalar]*) -- A dictionary mapping arbitrary string keys to values of type bool, bytes, float, int, or str. It can be used to communicate arbitrary values back to the server.
zh_hans: **metrics** (*Dict[str, Scalar]*) -- 将任意字符串键映射到 bool、bytes、float、int 或 str 类型值的字典。它可用于将任意值传回服务器。

source: The previous return type format (int, float, float) and the extended format (int, float, float, Dict[str, Scalar]) have been deprecated and removed since Flower 0.19.
zh_hans: 自 Flower 0.19 起，之前的返回类型格式（int、float、float）和扩展格式（int、float、float、Dict[str, Scalar]）已被弃用和移除。

source: Train the provided parameters using the locally held dataset.
zh_hans: 使用本地数据集训练所提供的参数。

source: Configuration parameters which allow the server to influence training on the client. It can be used to communicate arbitrary values from the server to the client, for example, to set the number of (local) training epochs.
zh_hans: 允许服务器影响客户端训练的配置参数。它可用于将任意值从服务器传送到客户端，例如设置（本地）训练遍历数。

source: * **parameters** (*NDArrays*) -- The locally updated model parameters. * **num_examples** (*int*) -- The number of examples used for training. * **metrics** (*Dict[str, Scalar]*) -- A dictionary mapping arbitrary string keys to values of type bool, bytes, float, int, or str. It can be used to communicate arbitrary values back to the server.
zh_hans: **parameters** (*NDArrays*) -- 本地更新的模型参数。**num_examples** (*int*) -- 用于训练的示例数量。**metrics** (*Dict[str, Scalar]*) -- 将任意字符串键映射到 bool、bytes、float、int 或 str 类型值的字典。它可用于将任意值传回服务器。

source: **parameters** (*NDArrays*) -- The locally updated model parameters.
zh_hans: **parameters** (*NDArrays*) -- 本地更新的模型参数。

source: **num_examples** (*int*) -- The number of examples used for training.
zh_hans: **num_examples** (*int*) -- 用于训练的数据数量。

source: Configuration parameters requested by the server. This can be used to tell the client which parameters are needed along with some Scalar attributes.
zh_hans: 服务器请求的配置参数。这可以用来告诉客户端需要哪些参数以及一些标量属性。

source: **parameters** -- The local model parameters as a list of NumPy ndarrays.
zh_hans: **parameters** -- NumPy ndarrays 的本地模型参数列表。

source: Return a client's set of properties.
zh_hans: 返回客户端的属性集。

source: Configuration parameters requested by the server. This can be used to tell the client which properties are needed along with some Scalar attributes.
zh_hans: 服务器请求的配置参数。这可以用来告诉客户端需要哪些属性以及一些标量属性。

source: **properties** -- A dictionary mapping arbitrary string keys to values of type bool, bytes, float, int, or str. It can be used to communicate arbitrary property values back to the server.
zh_hans: **properties** -- 将任意字符串键映射到 bool、bytes、float、int 或 str 类型值的字典。它可用于将任意属性值传回服务器。

source: Convert to object to Client type and return it.
zh_hans: 将对象转换为客户类型并返回。

source: Start a Flower NumPyClient which connects to a gRPC server.
zh_hans: 启动 Flower NumPyClient，连接到 gRPC 服务器。

source: An implementation of the abstract base class `flwr.client.NumPyClient`.
zh_hans: 抽象基类 `flwr.client.NumPyClient` 的实现。

source: Starting a client with an insecure server connection:
zh_hans: 使用不安全的服务器连接启动客户端：

source: Start a Ray-based Flower simulation server.
zh_hans: 启动基于 Ray 的Flower模拟服务器。

source: A function creating client instances. The function must take a single `str` argument called `cid`. It should return a single client instance of type Client. Note that the created client instances are ephemeral and will often be destroyed after a single method invocation. Since client instances are not long-lived, they should not attempt to carry state over method invocations. Any state required by the instance (model, dataset, hyperparameters, ...) should be (re-)created in either the call to `client_fn` or the call to any of the client methods (e.g., load evaluation data in the `evaluate` method itself).
zh_hans: 创建客户端实例的函数。该函数必须接受一个名为 `cid` 的 `str` 参数。它应返回一个 Client 类型的客户端实例。请注意，创建的客户端实例是短暂的，通常在调用一个方法后就会被销毁。由于客户机实例不是长期存在的，它们不应试图在方法调用时携带状态数据。实例所需的任何状态数据（模型、数据集、超参数......）都应在调用 `client_fn` 或任何客户端方法（例如，在 `evaluate` 方法中加载评估数据）时（重新）创建。

source: The total number of clients in this simulation. This must be set if `clients_ids` is not set and vice-versa.
zh_hans: 本次模拟的客户总数。如果未设置 `clients_ids`，则必须设置该参数，反之亦然。

source: List `client_id`s for each client. This is only required if `num_clients` is not set. Setting both `num_clients` and `clients_ids` with `len(clients_ids)` not equal to `num_clients` generates an error.
zh_hans: 列出每个客户的 `client_id`。只有在未设置 `num_clients` 时才需要这样做。同时设置`num_clients`和`clients_ids`，且`len(clients_ids)`不等于`num_clients`，会产生错误。

source: "num_gpus": 0.0}` CPU and GPU resources for a single client. Supported keys are `num_cpus` and `num_gpus`. To understand the GPU utilization caused by `num_gpus`, as well as using custom resources, please consult the Ray documentation.
zh_hans: "num_gpus"： 0.0` 单个客户端的 CPU 和 GPU 资源。支持的键值为 `num_cpus` 和 `num_gpus`。要了解 `num_gpus` 所导致的 GPU 利用率，以及使用自定义资源的情况，请查阅 Ray 文档。

source: An implementation of the abstract base class `flwr.server.Server`. If no instance is provided, then `start_server` will create one.
zh_hans: 抽象基类 `flwr.server.Server`的实现。如果没有提供实例，`start_server` 将创建一个。

source: Currently supported values are `num_rounds` (int, default: 1) and `round_timeout` in seconds (float, default: None).
zh_hans: 目前支持的值有：`num_rounds`（int，默认值：1）和以秒为单位的`round_timeout`（float，默认值：无）。

source: An implementation of the abstract base class `flwr.server.Strategy`. If no strategy is provided, then `start_server` will use `flwr.server.strategy.FedAvg`.
zh_hans: 抽象基类 `flwr.server.strategy` 的实现。如果没有提供策略，`start_server` 将使用 `flwr.server.strategy.FedAvg`。

source: An implementation of the abstract base class `flwr.server.ClientManager`. If no implementation is provided, then `start_simulation` will use `flwr.server.client_manager.SimpleClientManager`.
zh_hans: 抽象基类 `flwr.server.ClientManager` 的实现。如果没有提供实现，`start_simulation` 将使用 `flwr.server.client_manager.SimpleClientManager`。

source: Optional dictionary containing arguments for the call to `ray.init`. If ray_init_args is None (the default), Ray will be initialized with the following default args: { "ignore_reinit_error": True, "include_dashboard": False } An empty dictionary can be used (ray_init_args={}) to prevent any arguments from being passed to ray.init.
zh_hans: 可选字典，包含调用 `ray.init` 时的参数。如果 ray_init_args 为 None（默认值），则将使用以下默认参数初始化 Ray： { "ignore_reinit_error"： True, "include_dashboard"： False } 可以使用空字典（ray_init_args={}）来防止向 ray.init 传递任何参数。

source: Optional dictionary containing arguments for the call to `ray.init`. If ray_init_args is None (the default), Ray will be initialized with the following default args:
zh_hans: 可选字典，包含调用 `ray.init` 时的参数。如果 ray_init_args 为 None（默认值），则将使用以下默认参数初始化 Ray：

source: An empty dictionary can be used (ray_init_args={}) to prevent any arguments from being passed to ray.init.
zh_hans: 可以使用空字典 (ray_init_args={}) 来防止向 ray.init 传递任何参数。

source: Set to True to prevent `ray.shutdown()` in case `ray.is_initialized()=True`.
zh_hans: 设为 True 可在 `ray.is_initialized()=True` 情况下阻止 `ray.shutdown()` 。

source: Optionally specify the type of actor to use. The actor object, which persists throughout the simulation, will be the process in charge of running the clients' jobs (i.e. their `fit()` method).
zh_hans: 可选择指定要使用的actor类型。actor对象将在整个模拟过程中持续存在，它将是负责运行客户端作业（即其 `fit()`方法）的进程。

source: If you want to create your own Actor classes, you might need to pass some input argument. You can use this dictionary for such purpose.
zh_hans: 如果您想创建自己的 Actor 类，可能需要传递一些输入参数。为此，您可以使用本字典。

source: (default: "DEFAULT") Optional string ("DEFAULT" or "SPREAD") for the VCE to choose in which node the actor is placed. If you are an advanced user needed more control you can use lower-level scheduling strategies to pin actors to specific compute nodes (e.g. via NodeAffinitySchedulingStrategy). Please note this is an advanced feature. For all details, please refer to the Ray documentation: https://docs.ray.io/en/latest/ray-core/scheduling/index.html
zh_hans: (默认："DEFAULT"）可选字符串（"DEFAULT "或 "SPREAD"），供 VCE 选择将行为体放置在哪个节点上。如果你是需要更多控制权的高级用户，可以使用低级调度策略将actor固定到特定计算节点（例如，通过 NodeAffinitySchedulingStrategy）。请注意，这是一项高级功能。有关详细信息，请参阅 Ray 文档：https://docs.ray.io/en/latest/ray-core/scheduling/index.html

source: **hist** -- Object containing metrics from training.
zh_hans: **hist** -- 包含训练指标的对象。

source: server
fr: serveur
zh_hans: 服务器

source: Flower server.
zh_hans: Flower 服务器。

source: Start a Flower server using the gRPC transport layer.
zh_hans: 使用 gRPC 传输层启动 Flower 服务器。
