Repository: lucacorbucci/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: fr, zh_hans

source: **General improvements** ([#2309](https://github.com/adap/flower/pull/2309), [#2310](https://github.com/adap/flower/pull/2310), [2313](https://github.com/adap/flower/pull/2313), [#2316](https://github.com/adap/flower/pull/2316), [2317](https://github.com/adap/flower/pull/2317),[#2349](https://github.com/adap/flower/pull/2349), [#2360](https://github.com/adap/flower/pull/2360), [#2402](https://github.com/adap/flower/pull/2402), [#2446](https://github.com/adap/flower/pull/2446) [#2561](https://github.com/adap/flower/pull/2561))
zh_hans: **普通改进**（[#2309](https://github.com/adap/flower/pull/2309), [#2310](https://github.com/adap/flower/pull/2310), [2313](https://github.com/adap/flower/pull/2313), [#2316](https://github.com/adap/flower/pull/2316), [2317](https://github.com/adap/flower/pull/2317),[#2349](https://github.com/adap/flower/pull/2349), [#2360](https://github.com/adap/flower/pull/2360), [#2402](https://github.com/adap/flower/pull/2402), [#2446](https://github.com/adap/flower/pull/2446) [#2561](https://github.com/adap/flower/pull/2561))

source: Flower received many improvements under the hood, too many to list here.
fr: Flower a reçu de nombreuses améliorations sous le capot, trop nombreuses pour être énumérées ici.
zh_hans: Flower 进行了许多改进，这里就不一一列举了。

source: **Add new** `Bulyan` **strategy** ([#1817](https://github.com/adap/flower/pull/1817), [#1891](https://github.com/adap/flower/pull/1891))
zh_hans: **添加新**"Bulyan "**策略**（[#1817](https://github.com/adap/flower/pull/1817), [#1891](https://github.com/adap/flower/pull/1891)

source: The new `Bulyan` strategy implements Bulyan by [El Mhamdi et al., 2018](https://arxiv.org/abs/1802.07927)
zh_hans: 新的 "Bulyan"策略通过[El Mhamdi 等人，2018]（https://arxiv.org/abs/1802.07927）实现

source: Incompatible changes
fr: Changements incompatibles
zh_hans: 不兼容的更改

source: **Remove support for Python 3.7** ([#2280](https://github.com/adap/flower/pull/2280), [#2299](https://github.com/adap/flower/pull/2299), [#2304](https://github.com/adap/flower/pull/2304), [#2306](https://github.com/adap/flower/pull/2306), [#2355](https://github.com/adap/flower/pull/2355), [#2356](https://github.com/adap/flower/pull/2356))
zh_hans: **移除对 Python 3.7 的支持** ([#2280](https://github.com/adap/flower/pull/2280), [#2299](https://github.com/adap/flower/pull/2299), [#2304](https://github.com/adap/flower/pull/2304), [#2306](https://github.com/adap/flower/pull/2306), [#2355](https://github.com/adap/flower/pull/2355), [#2356](https://github.com/adap/flower/pull/2356))

source: Python 3.7 support was deprecated in Flower 1.5, and this release removes support. Flower now requires Python 3.8.
zh_hans: 在 Flower 1.5 中，Python 3.7 支持已被弃用，本版本将删除该支持。Flower 现在需要 Python 3.8。

source: **Remove experimental argument** `rest` **from** `start_client` ([#2324](https://github.com/adap/flower/pull/2324))
zh_hans: **从** `start_client` 中移除** `rest` **实验参数 ([#2324](https://github.com/adap/flower/pull/2324))

source: The (still experimental) argument `rest` was removed from `start_client` and `start_numpy_client`. Use `transport="rest"` to opt into the experimental REST API instead.
zh_hans: 删除了 `start_client` 和 `start_numpy_client` 中的参数 `rest`（仍属试验性质）。请使用 `transport="rest"` 来选择使用试验性 REST API。

source: Thanks to our contributors
fr: Merci à nos contributeurs
zh_hans: 感谢我们的贡献者

source: We would like to give our special thanks to all the contributors who made the new version of Flower possible (in `git shortlog` order):
fr: Nous tenons à remercier tout particulièrement tous les contributeurs qui ont rendu possible la nouvelle version de Flower (dans l'ordre `git shortlog`) :
zh_hans: 在此，我们要特别感谢所有为 Flower 的新版本做出贡献的人员（按 `git shortlog` 顺序排列）：

source: **Introduce new simulation engine** ([#1969](https://github.com/adap/flower/pull/1969), [#2221](https://github.com/adap/flower/pull/2221), [#2248](https://github.com/adap/flower/pull/2248))
zh_hans: **引入新的模拟引擎** ([#1969](https://github.com/adap/flower/pull/1969), [#2221](https://github.com/adap/flower/pull/2221), [#2248](https://github.com/adap/flower/pull/2248))

source: The new simulation engine has been rewritten from the ground up, yet it remains fully backwards compatible. It offers much improved stability and memory handling, especially when working with GPUs. Simulations transparently adapt to different settings to scale simulation in CPU-only, CPU+GPU, multi-GPU, or multi-node multi-GPU environments.
zh_hans: 新的模拟引擎从头开始重新编写，但仍完全向后兼容。它的稳定性和内存处理能力大大提高，尤其是在使用 GPU 时。仿真可透明地适应不同的设置，以在仅 CPU、CPU+GPU、多 GPU 或多节点多 GPU 环境中扩展模拟。

source: Comprehensive documentation includes a new [how-to run simulations](https://flower.dev/docs/framework/how-to-run-simulations.html) guide, new [simulation-pytorch](https://flower.dev/docs/examples/simulation-pytorch.html) and [simulation-tensorflow](https://flower.dev/docs/examples/simulation-tensorflow.html) notebooks, and a new [YouTube tutorial series](https://www.youtube.com/watch?v=cRebUIGB5RU&list=PLNG4feLHqCWlnj8a_E1A_n5zr2-8pafTB).
zh_hans: 综合文档包括新的[how-to run simulations](https://flower.dev/docs/framework/how-to-run-simulations.html) guide, new [simulation-pytorch](https://flower.dev/docs/examples/simulation-pytorch.html) and [simulation-tensorflow](https://flower.dev/docs/examples/simulation-tensorflow.html) notebooks, and a new [YouTube tutorial series](https://www.youtube.com/watch?v=cRebUIGB5RU&list=PLNG4feLHqCWlnj8a_E1A_n5zr2-8pafTB)。

source: **Restructure Flower Docs** ([#1824](https://github.com/adap/flower/pull/1824), [#1865](https://github.com/adap/flower/pull/1865), [#1884](https://github.com/adap/flower/pull/1884), [#1887](https://github.com/adap/flower/pull/1887), [#1919](https://github.com/adap/flower/pull/1919), [#1922](https://github.com/adap/flower/pull/1922), [#1920](https://github.com/adap/flower/pull/1920), [#1923](https://github.com/adap/flower/pull/1923), [#1924](https://github.com/adap/flower/pull/1924), [#1962](https://github.com/adap/flower/pull/1962), [#2006](https://github.com/adap/flower/pull/2006), [#2133](https://github.com/adap/flower/pull/2133), [#2203](https://github.com/adap/flower/pull/2203), [#2215](https://github.com/adap/flower/pull/2215), [#2122](https://github.com/adap/flower/pull/2122), [#2223](https://github.com/adap/flower/pull/2223), [#2219](https://github.com/adap/flower/pull/2219), [#2232](https://github.com/adap/flower/pull/2232), [#2233](https://github.com/adap/flower/pull/2233), [#2234](https://github.com/adap/flower/pull/2234), [#2235](https://github.com/adap/flower/pull/2235), [#2237](https://github.com/adap/flower/pull/2237), [#2238](https://github.com/adap/flower/pull/2238), [#2242](https://github.com/adap/flower/pull/2242), [#2231](https://github.com/adap/flower/pull/2231), [#2243](https://github.com/adap/flower/pull/2243), [#2227](https://github.com/adap/flower/pull/2227))
zh_hans: **重构 Flower 文档** ([#1824](https://github.com/adap/flower/pull/1824), [#1865](https://github.com/adap/flower/pull/1865), [#1884](https://github.com/adap/flower/pull/1884), [#1887](https://github.com/adap/flower/pull/1887), [#1919](https://github.com/adap/flower/pull/1919), [#1922](https://github.com/adap/flower/pull/1922), [#1920](https://github.com/adap/flower/pull/1920), [#1923](https://github.com/adap/flower/pull/1923), [#1924](https://github.com/adap/flower/pull/1924), [#1962](https://github.com/adap/flower/pull/1962), [#2006](https://github.com/adap/flower/pull/2006), [#2133](https://github.com/adap/flower/pull/2133), [#2203](https://github.com/adap/flower/pull/2203), [#2215](https://github.com/adap/flower/pull/2215), [#2122](https://github.com/adap/flower/pull/2122), [#2223](https://github.com/adap/flower/pull/2223), [#2219](https://github.com/adap/flower/pull/2219), [#2232](https://github.com/adap/flower/pull/2232), [#2233](https://github.com/adap/flower/pull/2233), [#2234](https://github.com/adap/flower/pull/2234), [#2235](https://github.com/adap/flower/pull/2235), [#2237](https://github.com/adap/flower/pull/2237), [#2238](https://github.com/adap/flower/pull/2238), [#2242](https://github.com/adap/flower/pull/2242), [#2231](https://github.com/adap/flower/pull/2231), [#2243](https://github.com/adap/flower/pull/2243), [#2227](https://github.com/adap/flower/pull/2227))

source: Much effort went into a completely restructured Flower docs experience. The documentation on [flower.dev/docs](flower.dev/docs) is now divided into Flower Framework, Flower Baselines, Flower Android SDK, Flower iOS SDK, and code example projects.
zh_hans: Flower 文档体验的全面重构耗费了大量精力。现在，[flower.dev/docs](flower.dev/docs)上的文档分为 Flower Framework、Flower Baselines、Flower Android SDK、Flower iOS SDK 和代码示例项目。

source: **Introduce Flower Swift SDK** ([#1858](https://github.com/adap/flower/pull/1858), [#1897](https://github.com/adap/flower/pull/1897))
zh_hans: **介绍 Flower Swift SDK** ([#1858](https://github.com/adap/flower/pull/1858), [#1897](https://github.com/adap/flower/pull/1897))

source: This is the first preview release of the Flower Swift SDK. Flower support on iOS is improving, and alongside the Swift SDK and code example, there is now also an iOS quickstart tutorial.
zh_hans: 这是 Flower Swift SDK 的首个预览版。Flower 对 iOS 的支持正在不断改进，除了 Swift SDK 和代码示例外，现在还有 iOS 快速入门教程。

source: **Introduce Flower Android SDK** ([#2131](https://github.com/adap/flower/pull/2131))
zh_hans: **介绍Flower Android SDK** ([#2131](https://github.com/adap/flower/pull/2131))

source: This is the first preview release of the Flower Kotlin SDK. Flower support on Android is improving, and alongside the Kotlin SDK and code example, there is now also an Android quickstart tutorial.
zh_hans: 这是 Flower Kotlin SDK 的首个预览版。Flower 对 Android 的支持正在不断改进，除了 Kotlin SDK 和代码示例，现在还有 Android 快速入门教程。

source: **Introduce new end-to-end testing infrastructure** ([#1842](https://github.com/adap/flower/pull/1842), [#2071](https://github.com/adap/flower/pull/2071), [#2072](https://github.com/adap/flower/pull/2072), [#2068](https://github.com/adap/flower/pull/2068), [#2067](https://github.com/adap/flower/pull/2067), [#2069](https://github.com/adap/flower/pull/2069), [#2073](https://github.com/adap/flower/pull/2073), [#2070](https://github.com/adap/flower/pull/2070), [#2074](https://github.com/adap/flower/pull/2074), [#2082](https://github.com/adap/flower/pull/2082), [#2084](https://github.com/adap/flower/pull/2084), [#2093](https://github.com/adap/flower/pull/2093), [#2109](https://github.com/adap/flower/pull/2109), [#2095](https://github.com/adap/flower/pull/2095), [#2140](https://github.com/adap/flower/pull/2140), [#2137](https://github.com/adap/flower/pull/2137), [#2165](https://github.com/adap/flower/pull/2165))
zh_hans: *介绍新的端到端测试** ([#1842](https://github.com/adap/flower/pull/1842), [#2071](https://github.com/adap/flower/pull/2071), [#2072](https://github.com/adap/flower/pull/2072), [#2068](https://github.com/adap/flower/pull/2068), [#2067](https://github.com/adap/flower/pull/2067), [#2069](https://github.com/adap/flower/pull/2069), [#2073](https://github.com/adap/flower/pull/2073), [#2070](https://github.com/adap/flower/pull/2070), [#2074](https://github.com/adap/flower/pull/2074), [#2082](https://github.com/adap/flower/pull/2082), [#2084](https://github.com/adap/flower/pull/2084), [#2093](https://github.com/adap/flower/pull/2093), [#2109](https://github.com/adap/flower/pull/2109), [#2095](https://github.com/adap/flower/pull/2095), [#2140](https://github.com/adap/flower/pull/2140), [#2137](https://github.com/adap/flower/pull/2137), [#2165](https://github.com/adap/flower/pull/2165))

source: A new testing infrastructure ensures that new changes stay compatible with existing framework integrations or strategies.
zh_hans: 新的测试设施可确保新的变更与现有的框架集成或策略保持兼容。

source: **Deprecate Python 3.7**
zh_hans: ** 过时的 Python 3.7**

source: Since Python 3.7 reached its end of life (EOL) on 2023-06-27, support for Python 3.7 is now deprecated and will be removed in an upcoming release.
zh_hans: 由于 Python 3.7 已于 2023-06-27 弃用 (EOL)，对 Python 3.7 的支持现已废弃，并将在即将发布的版本中移除。

source: **Add new** `FedTrimmedAvg` **strategy** ([#1769](https://github.com/adap/flower/pull/1769), [#1853](https://github.com/adap/flower/pull/1853))
zh_hans: **添加新的**`FedTrimmedAvg`**策略**（[#1769](https://github.com/adap/flower/pull/1769), [#1853](https://github.com/adap/flower/pull/1853)

source: The new `FedTrimmedAvg` strategy implements Trimmed Mean by [Dong Yin, 2018](https://arxiv.org/abs/1803.01498).
zh_hans: 新的 "FedTrimmedAvg "策略实现了[Dong Yin, 2018]（https://arxiv.org/abs/1803.01498）的 "Trimmed Mean"。

source: **Introduce start_driver** ([#1697](https://github.com/adap/flower/pull/1697))
zh_hans: **引入 start_driver**（[#1697](https://github.com/adap/flower/pull/1697)）

source: In addition to `start_server` and using the raw Driver API, there is a new `start_driver` function that allows for running `start_server` scripts as a Flower driver with only a single-line code change. Check out the `mt-pytorch` code example to see a working example using `start_driver`.
zh_hans: 除了 `start_server` 和使用原始驱动 API 之外，还有一个新的 `start_driver` 函数，只需修改一行代码，就能将 `start_server` 脚本作为 Flower 驱动程序运行。请查看 `mt-pytorch` 代码示例，了解使用 `start_driver` 的工作示例。

source: **Add parameter aggregation to** `mt-pytorch` **code example** ([#1785](https://github.com/adap/flower/pull/1785))
zh_hans: 为 `mt-pytorch` **代码示例**添加参数聚合 ([#1785](https://github.com/adap/flower/pull/1785))

source: The `mt-pytorch` example shows how to aggregate parameters when writing a driver script. The included `driver.py` and `server.py` have been aligned to demonstrate both the low-level way and the high-level way of building server-side logic.
zh_hans: `mt-pytorch`示例展示了如何在编写驱动程序脚本时聚合参数。附带的 `driver.py` 和 `server.py` 已经进行了调整，以演示构建服务器端逻辑的低级方法和高级方法。

source: **Migrate experimental REST API to Starlette** ([2171](https://github.com/adap/flower/pull/2171))
zh_hans: **将实验性 REST API 移植到 Starlette** ([2171](https://github.com/adap/flower/pull/2171))

source: The (experimental) REST API used to be implemented in [FastAPI](https://fastapi.tiangolo.com/), but it has now been migrated to use [Starlette](https://www.starlette.io/) directly.
zh_hans: REST API（试验性）曾在 [FastAPI](https://fastapi.tiangolo.com/) 中实现，但现在已迁移到直接使用 [Starlette](https://www.starlette.io/) 。

source: Please note: The REST request-response API is still experimental and will likely change significantly over time.
zh_hans: 请注意：REST 请求-响应 API 仍处于试验阶段，随着时间的推移可能会发生重大变化。

source: **Introduce experimental gRPC request-response API** ([#1867](https://github.com/adap/flower/pull/1867), [#1901](https://github.com/adap/flower/pull/1901))
zh_hans: **引入实验性 gRPC 请求-响应 API** （[#1867](https://github.com/adap/flower/pull/1867), [#1901](https://github.com/adap/flower/pull/1901)

source: In addition to the existing gRPC API (based on bidirectional streaming) and the experimental REST API, there is now a new gRPC API that uses a request-response model to communicate with client nodes.
zh_hans: 除了现有的 gRPC 应用程序接口（基于双向流）和试验性 REST 应用程序接口外，现在还有一个新的 gRPC 应用程序接口，它使用请求-响应模型与客户端节点通信。

source: Please note: The gRPC request-response API is still experimental and will likely change significantly over time.
zh_hans: 请注意：gRPC 请求-响应 API 仍处于试验阶段，随着时间的推移可能会发生重大变化。

source: **Replace the experimental** `start_client(rest=True)` **with the new** `start_client(transport="rest")` ([#1880](https://github.com/adap/flower/pull/1880))
zh_hans: **用新的** `start_client(transport="rest")` 替换实验性** `start_client(rest=True)` ([#1880](https://github.com/adap/flower/pull/1880))

source: The (experimental) `start_client` argument `rest` was deprecated in favour of a new argument `transport`. `start_client(transport="rest")` will yield the same behaviour as `start_client(rest=True)` did before. All code should migrate to the new argument `transport`. The deprecated argument `rest` will be removed in a future release.
zh_hans: 已废弃（试验性的）`start_client`参数`rest`，改用新参数`transport`。`start_client(transport="rest")`将产生与以前的`start_client(rest=True)`相同的行为。所有代码都应迁移到新参数 `transport`。过时的参数 `rest` 将在今后的版本中删除。

source: **Add a new gRPC option** ([#2197](https://github.com/adap/flower/pull/2197))
zh_hans: ** 添加一个新的 gRPC 选项**（[#2197](https://github.com/adap/flower/pull/2197)）

source: We now start a gRPC server with the `grpc.keepalive_permit_without_calls` option set to 0 by default. This prevents the clients from sending keepalive pings when there is no outstanding stream.
zh_hans: 现在我们启动一个 gRPC 服务器，并将 `grpc.keepalive_permit_without_calls` 选项默认设置为 0。这将防止客户端在没有未处理数据流时发送 keepalive pings。

source: **Improve example notebooks** ([#2005](https://github.com/adap/flower/pull/2005))
zh_hans: **改进示例笔记** ([#2005](https://github.com/adap/flower/pull/2005))

source: There's a new 30min Federated Learning PyTorch tutorial!
zh_hans: 有一个新的 30 分钟的联邦学习 PyTorch 教程！

source: **Example updates** ([#1772](https://github.com/adap/flower/pull/1772), [#1873](https://github.com/adap/flower/pull/1873), [#1981](https://github.com/adap/flower/pull/1981), [#1988](https://github.com/adap/flower/pull/1988), [#1984](https://github.com/adap/flower/pull/1984), [#1982](https://github.com/adap/flower/pull/1982), [#2112](https://github.com/adap/flower/pull/2112), [#2144](https://github.com/adap/flower/pull/2144), [#2174](https://github.com/adap/flower/pull/2174), [#2225](https://github.com/adap/flower/pull/2225), [#2183](https://github.com/adap/flower/pull/2183))
zh_hans: **更新Example** ([#1772](https://github.com/adap/flower/pull/1772), [#1873](https://github.com/adap/flower/pull/1873), [#1981](https://github.com/adap/flower/pull/1981), [#1988](https://github.com/adap/flower/pull/1988), [#1984](https://github.com/adap/flower/pull/1984), [#1982](https://github.com/adap/flower/pull/1982), [#2112](https://github.com/adap/flower/pull/2112), [#2144](https://github.com/adap/flower/pull/2144), [#2174](https://github.com/adap/flower/pull/2174), [#2225](https://github.com/adap/flower/pull/2225), [#2183](https://github.com/adap/flower/pull/2183))

source: Many examples have received significant updates, including simplified advanced-tensorflow and advanced-pytorch examples, improved macOS compatibility of TensorFlow examples, and code examples for simulation. A major upgrade is that all code examples now have a `requirements.txt` (in addition to `pyproject.toml`).
zh_hans: 许多示例都进行了重大更新，包括简化了 advanced-tensorflow 和 advanced-pytorch 示例，改进了 TensorFlow 示例的 macOS 兼容性，以及模拟代码示例。一项重大升级是所有代码示例现在都有了 "requirements.txt"（除 "pyproject.toml "外）。

source: **General improvements** ([#1872](https://github.com/adap/flower/pull/1872), [#1866](https://github.com/adap/flower/pull/1866), [#1884](https://github.com/adap/flower/pull/1884), [#1837](https://github.com/adap/flower/pull/1837), [#1477](https://github.com/adap/flower/pull/1477), [#2171](https://github.com/adap/flower/pull/2171))
zh_hans: **普通改进**（[#1872](https://github.com/adap/flower/pull/1872), [#1866](https://github.com/adap/flower/pull/1866), [#1884](https://github.com/adap/flower/pull/1884), [#1837](https://github.com/adap/flower/pull/1837), [#1477](https://github.com/adap/flower/pull/1477), [#2171](https://github.com/adap/flower/pull/2171))

source: None
fr: Aucun
zh_hans: 无

source: **Introduce support for XGBoost (**`FedXgbNnAvg` **strategy and example)** ([#1694](https://github.com/adap/flower/pull/1694), [#1709](https://github.com/adap/flower/pull/1709), [#1715](https://github.com/adap/flower/pull/1715), [#1717](https://github.com/adap/flower/pull/1717), [#1763](https://github.com/adap/flower/pull/1763), [#1795](https://github.com/adap/flower/pull/1795))
fr: **Introduire la prise en charge de XGBoost (**`FedXgbNnAvg` **stratégie et exemple)** ([#1694](https://github.com/adap/flower/pull/1694), [#1709](https://github.com/adap/flower/pull/1709), [#1715](https://github.com/adap/flower/pull/1715), [#1717](https://github.com/adap/flower/pull/1717), [#1763](https://github.com/adap/flower/pull/1763), [#1795](https://github.com/adap/flower/pull/1795))
zh_hans: **引入对XGBoost的支持（**`FedXgbNnAvg` **策略和示例）** ([#1694](https://github.com/adap/flower/pull/1694), [#1709](https://github.com/adap/flower/pull/1709), [#1715](https://github.com/adap/flower/pull/1715), [#1717](https://github.com/adap/flower/pull/1717), [#1763](https://github.com/adap/flower/pull/1763), [#1795](https://github.com/adap/flower/pull/1795))

source: XGBoost is a tree-based ensemble machine learning algorithm that uses gradient boosting to improve model accuracy. We added a new `FedXgbNnAvg` [strategy](https://github.com/adap/flower/tree/main/src/py/flwr/server/strategy/fedxgb_nn_avg.py), and a [code example](https://github.com/adap/flower/tree/main/examples/quickstart_xgboost_horizontal) that demonstrates the usage of this new strategy in an XGBoost project.
fr: Nous avons ajouté une nouvelle [stratégie] `FedXgbNnAvg` (https://github.com/adap/flower/tree/main/src/py/flwr/server/strategy/fedxgb_nn_avg.py), et un [exemple de code] (https://github.com/adap/flower/tree/main/examples/quickstart_xgboost_horizontal) qui démontre l'utilisation de cette nouvelle stratégie dans un projet XGBoost.
zh_hans: XGBoost 是一种基于树的集合机器学习算法，它使用梯度提升来提高模型的准确性。我们添加了一个新的 "FedXgbNnAvg"[策略](https://github.com/adap/flower/tree/main/src/py/flwr/server/strategy/fedxgb_nn_avg.py)和一个[代码示例](https://github.com/adap/flower/tree/main/examples/quickstart_xgboost_horizontal)，演示如何在 XGBoost 项目中使用这个新策略。

source: **Introduce iOS SDK (preview)** ([#1621](https://github.com/adap/flower/pull/1621), [#1764](https://github.com/adap/flower/pull/1764))
fr: **Introduction du SDK iOS (aperçu)** ([#1621](https://github.com/adap/flower/pull/1621), [#1764](https://github.com/adap/flower/pull/1764))
zh_hans: **介绍 iOS SDK（预览版）** ([#1621](https://github.com/adap/flower/pull/1621), [#1764](https://github.com/adap/flower/pull/1764))

source: This is a major update for anyone wanting to implement Federated Learning on iOS mobile devices. We now have a swift iOS SDK present under [src/swift/flwr](https://github.com/adap/flower/tree/main/src/swift/flwr) that will facilitate greatly the app creating process. To showcase its use, the [iOS example](https://github.com/adap/flower/tree/main/examples/ios) has also been updated!
fr: Il s'agit d'une mise à jour majeure pour tous ceux qui souhaitent mettre en œuvre l'apprentissage fédéré sur les appareils mobiles iOS. Nous disposons désormais d'un SDK swift iOS présent sous [src/swift/flwr](https://github.com/adap/flower/tree/main/src/swift/flwr) qui facilitera grandement le processus de création d'applications. Pour présenter son utilisation, l'[exemple iOS](https://github.com/adap/flower/tree/main/examples/ios) a également été mis à jour !
zh_hans: 对于想要在 iOS 移动设备上实施联邦学习的人来说，这是一次重大更新。现在，我们在 [src/swift/flwr](https://github.com/adap/flower/tree/main/src/swift/flwr) 下提供了一个迅捷的 iOS SDK，这将大大方便应用程序的创建过程。为了展示其使用情况，我们还更新了 [iOS 示例](https://github.com/adap/flower/tree/main/examples/ios)！

source: **Introduce new "What is Federated Learning?" tutorial** ([#1657](https://github.com/adap/flower/pull/1657), [#1721](https://github.com/adap/flower/pull/1721))
fr: **Introduire un nouveau tutoriel "Qu'est-ce que l'apprentissage fédéré ? "** ([#1657](https://github.com/adap/flower/pull/1657), [#1721](https://github.com/adap/flower/pull/1721))
zh_hans: **引入新的 "什么是联邦学习？"教程**（[#1657](https://github.com/adap/flower/pull/1657), [#1721](https://github.com/adap/flower/pull/1721)

source: A new [entry-level tutorial](https://flower.dev/docs/framework/tutorial-what-is-federated-learning.html) in our documentation explains the basics of Fedetated Learning. It enables anyone who's unfamiliar with Federated Learning to start their journey with Flower. Forward it to anyone who's interested in Federated Learning!
zh_hans: 我们的文档中新增了一个[入门级教程](https://flower.dev/docs/framework/tutorial-what-is-federated-learning.html)，解释了联邦学习的基础知识。它让任何不熟悉联邦学习的人都能开始 Flower 之旅。请转发给对联邦学习感兴趣的人！
