Repository: lucacorbucci/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: fr, zh_hans

source: **Introduce new Flower Baseline: FedProx MNIST** ([#1513](https://github.com/adap/flower/pull/1513), [#1680](https://github.com/adap/flower/pull/1680), [#1681](https://github.com/adap/flower/pull/1681), [#1679](https://github.com/adap/flower/pull/1679))
fr: **Introduire une nouvelle fleur Référence : FedProx MNIST** ([#1513](https://github.com/adap/flower/pull/1513), [#1680](https://github.com/adap/flower/pull/1680), [#1681](https://github.com/adap/flower/pull/1681), [#1679](https://github.com/adap/flower/pull/1679))
zh_hans: **引入新的 Flower Baseline： FedProx MNIST** （[#1513](https://github.com/adap/flower/pull/1513), [#1680](https://github.com/adap/flower/pull/1680), [#1681](https://github.com/adap/flower/pull/1681), [#1679](https://github.com/adap/flower/pull/1679)

source: This new baseline replicates the MNIST+CNN task from the paper [Federated Optimization in Heterogeneous Networks (Li et al., 2018)](https://arxiv.org/abs/1812.06127). It uses the `FedProx` strategy, which aims at making convergence more robust in heterogenous settings.
fr: Cette nouvelle ligne de base reproduit la tâche MNIST+CNN de l'article [Federated Optimization in Heterogeneous Networks (Li et al., 2018)] (https://arxiv.org/abs/1812.06127). Elle utilise la stratégie `FedProx`, qui vise à rendre la convergence plus robuste dans des contextes hétérogènes.
zh_hans: 这条新Baseline复现了论文[Federated Optimization in Heterogeneous Networks (Li et al., 2018)](https://arxiv.org/abs/1812.06127)中的 MNIST+CNN 任务。它使用 "FedProx "策略，旨在使收敛在异构环境中更加稳健。

source: **Introduce new Flower Baseline: FedAvg FEMNIST** ([#1655](https://github.com/adap/flower/pull/1655))
fr: **Introduire une nouvelle ligne de base pour les fleurs : FedAvg FEMNIST** ([#1655](https://github.com/adap/flower/pull/1655))
zh_hans: **引入新的 Flower Baseline： FedAvg FEMNIST** ([#1655](https://github.com/adap/flower/pull/1655))

source: This new baseline replicates an experiment evaluating the performance of the FedAvg algorithm on the FEMNIST dataset from the paper [LEAF: A Benchmark for Federated Settings (Caldas et al., 2018)](https://arxiv.org/abs/1812.01097).
fr: Cette nouvelle ligne de base reproduit une expérience évaluant les performances de l'algorithme FedAvg sur le jeu de données FEMNIST tiré de l'article [LEAF : A Benchmark for Federated Settings (Caldas et al., 2018)] (https://arxiv.org/abs/1812.01097).
zh_hans: 这一新Baseline复现了论文[LEAF: A Benchmark for Federated Settings（Caldas 等人，2018 年）](https://arxiv.org/abs/1812.01097)中评估 FedAvg 算法在 FEMNIST 数据集上性能的实验。

source: **Introduce (experimental) REST API** ([#1594](https://github.com/adap/flower/pull/1594), [#1690](https://github.com/adap/flower/pull/1690), [#1695](https://github.com/adap/flower/pull/1695), [#1712](https://github.com/adap/flower/pull/1712), [#1802](https://github.com/adap/flower/pull/1802), [#1770](https://github.com/adap/flower/pull/1770), [#1733](https://github.com/adap/flower/pull/1733))
fr: **Introduire l'API REST (expérimentale)** ([#1594](https://github.com/adap/flower/pull/1594), [#1690](https://github.com/adap/flower/pull/1690), [#1695](https://github.com/adap/flower/pull/1695), [#1712](https://github.com/adap/flower/pull/1712), [#1802](https://github.com/adap/flower/pull/1802), [#1770](https://github.com/adap/flower/pull/1770), [#1733](https://github.com/adap/flower/pull/1733))
zh_hans: **引入（试验性）REST API** ([#1594](https://github.com/adap/flower/pull/1594), [#1690](https://github.com/adap/flower/pull/1690), [#1695](https://github.com/adap/flower/pull/1695), [#1712](https://github.com/adap/flower/pull/1712), [#1802](https://github.com/adap/flower/pull/1802), [#1770](https://github.com/adap/flower/pull/1770), [#1733](https://github.com/adap/flower/pull/1733))

source: A new REST API has been introduced as an alternative to the gRPC-based communication stack. In this initial version, the REST API only supports anonymous clients.
fr: Une nouvelle API REST a été introduite comme alternative à la pile de communication basée sur gRPC. Dans cette version initiale, l'API REST ne prend en charge que les clients anonymes.
zh_hans: 作为基于 gRPC 的通信栈的替代方案，我们引入了新的 REST API。在初始版本中，REST API 仅支持匿名客户端。

source: Please note: The REST API is still experimental and will likely change significantly over time.
fr: Remarque : l'API REST est encore expérimentale et est susceptible de changer de manière significative au fil du temps.
zh_hans: 请注意：REST API 仍处于试验阶段，随着时间的推移可能会发生重大变化。

source: **Improve the (experimental) Driver API** ([#1663](https://github.com/adap/flower/pull/1663), [#1666](https://github.com/adap/flower/pull/1666), [#1667](https://github.com/adap/flower/pull/1667), [#1664](https://github.com/adap/flower/pull/1664), [#1675](https://github.com/adap/flower/pull/1675), [#1676](https://github.com/adap/flower/pull/1676), [#1693](https://github.com/adap/flower/pull/1693), [#1662](https://github.com/adap/flower/pull/1662), [#1794](https://github.com/adap/flower/pull/1794))
fr: **Améliorer l'API (expérimentale) du pilote** ([#1663](https://github.com/adap/flower/pull/1663), [#1666](https://github.com/adap/flower/pull/1666), [#1667](https://github.com/adap/flower/pull/1667), [#1664](https://github.com/adap/flower/pull/1664), [#1675](https://github.com/adap/flower/pull/1675), [#1676](https://github.com/adap/flower/pull/1676), [#1693](https://github.com/adap/flower/pull/1693), [#1662](https://github.com/adap/flower/pull/1662), [#1794](https://github.com/adap/flower/pull/1794))
zh_hans: **改进（试验性）驱动程序应用程序接口** ([#1663](https://github.com/adap/flower/pull/1663), [#1666](https://github.com/adap/flower/pull/1666), [#1667](https://github.com/adap/flower/pull/1667), [#1664](https://github.com/adap/flower/pull/1664), [#1675](https://github.com/adap/flower/pull/1675), [#1676](https://github.com/adap/flower/pull/1676), [#1693](https://github.com/adap/flower/pull/1693), [#1662](https://github.com/adap/flower/pull/1662), [#1794](https://github.com/adap/flower/pull/1794))

source: The Driver API is still an experimental feature, but this release introduces some major upgrades. One of the main improvements is the introduction of an SQLite database to store server state on disk (instead of in-memory). Another improvement is that tasks (instructions or results) that have been delivered will now be deleted. This greatly improves the memory efficiency of a long-running Flower server.
fr: L'API du pilote est encore une fonction expérimentale, mais cette version introduit quelques améliorations majeures. L'une des principales améliorations est l'introduction d'une base de données SQLite pour stocker l'état du serveur sur le disque (au lieu de la mémoire). Une autre amélioration est que les tâches (instructions ou résultats) qui ont été livrées seront désormais supprimées, ce qui améliore considérablement l'efficacité de la mémoire d'un serveur Flower fonctionnant depuis longtemps.
zh_hans: 驱动程序应用程序接口（Driver API）仍是一项试验性功能，但这一版本引入了一些重大升级。主要改进之一是引入了 SQLite 数据库，将服务器状态存储在磁盘上（而不是内存中）。另一项改进是，已交付的任务（指令或结果）现在将被删除。这大大提高了长期运行的 Flower 服务器的内存效率。

source: **Fix spilling issues related to Ray during simulations** ([#1698](https://github.com/adap/flower/pull/1698))
fr: **Répare les problèmes de déversement liés à Ray pendant les simulations** ([#1698](https://github.com/adap/flower/pull/1698))
zh_hans: **修复模拟过程中与Ray有关的溢出问题** ([#1698](https://github.com/adap/flower/pull/1698))

source: While running long simulations, `ray` was sometimes spilling huge amounts of data that would make the training unable to continue. This is now fixed! 🎉
zh_hans: 在运行长时间模拟时，`ray` 有时会溢出大量数据，导致训练无法继续。现在这个问题已经解决！🎉

source: **Add new example using** `TabNet` **and Flower** ([#1725](https://github.com/adap/flower/pull/1725))
fr: **Ajouter un nouvel exemple utilisant** `TabNet` **et Flower** ([#1725](https://github.com/adap/flower/pull/1725))
zh_hans: ** 添加使用** `TabNet` ** 的新示例** ([#1725](https://github.com/adap/flower/pull/1725))

source: TabNet is a powerful and flexible framework for training machine learning models on tabular data. We now have a federated example using Flower: [https://github.com/adap/flower/tree/main/examples/tabnet](https://github.com/adap/flower/tree/main/examples/quickstart_tabnet).
fr: TabNet est un cadre puissant et flexible pour former des modèles d'apprentissage automatique sur des données tabulaires. Nous avons maintenant un exemple fédéré utilisant Flower : [https://github.com/adap/flower/tree/main/examples/tabnet](https://github.com/adap/flower/tree/main/examples/quickstart_tabnet).
zh_hans: TabNet 是一个强大而灵活的框架，用于在表格数据上训练机器学习模型。我们现在有一个使用 Flower 的联邦示例：[https://github.com/adap/flower/tree/main/examples/tabnet](https://github.com/adap/flower/tree/main/examples/quickstart_tabnet)。

source: **Add new how-to guide for monitoring simulations** ([#1649](https://github.com/adap/flower/pull/1649))
fr: **Ajouter un nouveau guide pratique pour le suivi des simulations** ([#1649](https://github.com/adap/flower/pull/1649))
zh_hans: ** 添加新的模拟监控指南** ([#1649](https://github.com/adap/flower/pull/1649))

source: We now have a documentation guide to help users monitor their performance during simulations.
fr: Nous avons maintenant un guide de documentation pour aider les utilisateurs à surveiller leurs performances pendant les simulations.
zh_hans: 我们现在有一份文档指南，可帮助用户在模拟过程中监控其性能。

source: **Add training metrics to** `History` **object during simulations** ([#1696](https://github.com/adap/flower/pull/1696))
fr: **Ajouter des mesures de formation à** `History` **objet pendant les simulations** ([#1696](https://github.com/adap/flower/pull/1696))
zh_hans: **在模拟过程中为***`历史`***对象添加训练指标*** ([#1696](https://github.com/adap/flower/pull/1696))

source: The `fit_metrics_aggregation_fn` can be used to aggregate training metrics, but previous releases did not save the results in the `History` object. This is now the case!
fr: La fonction `fit_metrics_aggregation_fn` peut être utilisée pour agréger les mesures d'entraînement, mais les versions précédentes n'enregistraient pas les résultats dans l'objet `History`. c'est désormais le cas !
zh_hans: `fit_metrics_aggregation_fn`可用于汇总训练指标，但以前的版本不会将结果保存在 "History "对象中。现在可以了！

source: **General improvements** ([#1659](https://github.com/adap/flower/pull/1659), [#1646](https://github.com/adap/flower/pull/1646), [#1647](https://github.com/adap/flower/pull/1647), [#1471](https://github.com/adap/flower/pull/1471), [#1648](https://github.com/adap/flower/pull/1648), [#1651](https://github.com/adap/flower/pull/1651), [#1652](https://github.com/adap/flower/pull/1652), [#1653](https://github.com/adap/flower/pull/1653), [#1659](https://github.com/adap/flower/pull/1659), [#1665](https://github.com/adap/flower/pull/1665), [#1670](https://github.com/adap/flower/pull/1670), [#1672](https://github.com/adap/flower/pull/1672), [#1677](https://github.com/adap/flower/pull/1677), [#1684](https://github.com/adap/flower/pull/1684), [#1683](https://github.com/adap/flower/pull/1683), [#1686](https://github.com/adap/flower/pull/1686), [#1682](https://github.com/adap/flower/pull/1682), [#1685](https://github.com/adap/flower/pull/1685), [#1692](https://github.com/adap/flower/pull/1692), [#1705](https://github.com/adap/flower/pull/1705), [#1708](https://github.com/adap/flower/pull/1708), [#1711](https://github.com/adap/flower/pull/1711), [#1713](https://github.com/adap/flower/pull/1713), [#1714](https://github.com/adap/flower/pull/1714), [#1718](https://github.com/adap/flower/pull/1718), [#1716](https://github.com/adap/flower/pull/1716), [#1723](https://github.com/adap/flower/pull/1723), [#1735](https://github.com/adap/flower/pull/1735), [#1678](https://github.com/adap/flower/pull/1678), [#1750](https://github.com/adap/flower/pull/1750), [#1753](https://github.com/adap/flower/pull/1753), [#1736](https://github.com/adap/flower/pull/1736), [#1766](https://github.com/adap/flower/pull/1766), [#1760](https://github.com/adap/flower/pull/1760), [#1775](https://github.com/adap/flower/pull/1775), [#1776](https://github.com/adap/flower/pull/1776), [#1777](https://github.com/adap/flower/pull/1777), [#1779](https://github.com/adap/flower/pull/1779), [#1784](https://github.com/adap/flower/pull/1784), [#1773](https://github.com/adap/flower/pull/1773), [#1755](https://github.com/adap/flower/pull/1755), [#1789](https://github.com/adap/flower/pull/1789), [#1788](https://github.com/adap/flower/pull/1788), [#1798](https://github.com/adap/flower/pull/1798), [#1799](https://github.com/adap/flower/pull/1799), [#1739](https://github.com/adap/flower/pull/1739), [#1800](https://github.com/adap/flower/pull/1800), [#1804](https://github.com/adap/flower/pull/1804), [#1805](https://github.com/adap/flower/pull/1805))
fr: **General improvements** ([#1659](https://github.com/adap/flower/pull/1659), [#1646](https://github.com/adap/flower/pull/1646), [#1647](https://github.com/adap/flower/pull/1647), [#1471](https://github.com/adap/flower/pull/1471), [#1648](https://github.com/adap/flower/pull/1648), [#1651](https://github.com/adap/flower/pull/1651), [#1652](https://github.com/adap/flower/pull/1652), [#1653](https://github.com/adap/flower/pull/1653), [#1659](https://github.com/adap/flower/pull/1659), [#1665](https://github.com/adap/flower/pull/1665), [#1670](https://github.com/adap/flower/pull/1670), [#1672](https://github.com/adap/flower/pull/1672), [#1677](https://github.com/adap/flower/pull/1677), [#1684](https://github.com/adap/flower/pull/1684), [#1683](https://github.com/adap/flower/pull/1683), [#1686](https://github.com/adap/flower/pull/1686), [#1682](https://github.com/adap/flower/pull/1682), [#1685](https://github.com/adap/flower/pull/1685), [#1692](https://github.com/adap/flower/pull/1692), [#1705](https://github.com/ada
zh_hans: **普通改进** ([#1659](https://github.com/adap/flower/pull/1659), [#1646](https://github.com/adap/flower/pull/1646), [#1647](https://github.com/adap/flower/pull/1647), [#1471](https://github.com/adap/flower/pull/1471), [#1648](https://github.com/adap/flower/pull/1648), [#1651](https://github.com/adap/flower/pull/1651), [#1652](https://github.com/adap/flower/pull/1652), [#1653](https://github.com/adap/flower/pull/1653), [#1659](https://github.com/adap/flower/pull/1659), [#1665](https://github.com/adap/flower/pull/1665), [#1670](https://github.com/adap/flower/pull/1670), [#1672](https://github.com/adap/flower/pull/1672), [#1677](https://github.com/adap/flower/pull/1677), [#1684](https://github.com/adap/flower/pull/1684), [#1683](https://github.com/adap/flower/pull/1683), [#1686](https://github.com/adap/flower/pull/1686), [#1682](https://github.com/adap/flower/pull/1682), [#1685](https://github.com/adap/flower/pull/1685), [#1692](https://github.com/adap/flower/pull/1692), [#1705](https://github.com/adap/flower/pull/1705), [#1708](https://github.com/adap/flower/pull/1708), [#1711](https://github.com/adap/flower/pull/1711), [#1713](https://github.com/adap/flower/pull/1713), [#1714](https://github.com/adap/flower/pull/1714), [#1718](https://github.com/adap/flower/pull/1718), [#1716](https://github.com/adap/flower/pull/1716), [#1723](https://github.com/adap/flower/pull/1723), [#1735](https://github.com/adap/flower/pull/1735), [#1678](https://github.com/adap/flower/pull/1678), [#1750](https://github.com/adap/flower/pull/1750), [#1753](https://github.com/adap/flower/pull/1753), [#1736](https://github.com/adap/flower/pull/1736), [#1766](https://github.com/adap/flower/pull/1766), [#1760](https://github.com/adap/flower/pull/1760), [#1775](https://github.com/adap/flower/pull/1775), [#1776](https://github.com/adap/flower/pull/1776), [#1777](https://github.com/adap/flower/pull/1777), [#1779](https://github.com/adap/flower/pull/1779), [#1784](https://github.com/adap/flower/pull/1784), [#1773](https://github.com/adap/flower/pull/1773), [#1755](https://github.com/adap/flower/pull/1755), [#1789](https://github.com/adap/flower/pull/1789), [#1788](https://github.com/adap/flower/pull/1788), [#1798](https://github.com/adap/flower/pull/1798), [#1799](https://github.com/adap/flower/pull/1799), [#1739](https://github.com/adap/flower/pull/1739), [#1800](https://github.com/adap/flower/pull/1800), [#1804](https://github.com/adap/flower/pull/1804), [#1805](https://github.com/adap/flower/pull/1805))

source: **Add support for** `workload_id` **and** `group_id` **in Driver API** ([#1595](https://github.com/adap/flower/pull/1595))
fr: **Ajouter la prise en charge de** `workload_id` **et** `group_id` **dans l'API du pilote** ([#1595](https://github.com/adap/flower/pull/1595))
zh_hans: **在驱动程序应用程序接口中添加对** `workload_id` **和** `group_id` **的支持** ([#1595](https://github.com/adap/flower/pull/1595))

source: The (experimental) Driver API now supports a `workload_id` that can be used to identify which workload a task belongs to. It also supports a new `group_id` that can be used, for example, to indicate the current training round. Both the `workload_id` and `group_id` enable client nodes to decide whether they want to handle a task or not.
fr: L'API (expérimentale) Driver prend désormais en charge un `workload_id` qui peut être utilisé pour identifier la charge de travail à laquelle une tâche appartient. Elle prend également en charge un nouveau `group_id` qui peut être utilisé, par exemple, pour indiquer le cycle de formation en cours. Le `workload_id` et le `group_id` permettent tous deux aux nœuds clients de décider s'ils veulent traiter une tâche ou non.
zh_hans: 驱动程序 API（试验性）现在支持 `workload_id`，可用于识别任务所属的工作量。它还支持新的 `group_id`，例如，可用于指示当前的训练轮次。通过 `workload_id` 和 `group_id` 客户端节点可以决定是否要处理某个任务。

source: **Make Driver API and Fleet API address configurable** ([#1637](https://github.com/adap/flower/pull/1637))
fr: **Faire en sorte que l'adresse de l'API du conducteur et de l'API de la flotte soit configurable** ([#1637](https://github.com/adap/flower/pull/1637))
zh_hans: **使Driver API 和Fleet API地址可配置**（[#1637](https://github.com/adap/flower/pull/1637)）

source: The (experimental) long-running Flower server (Driver API and Fleet API) can now configure the server address of both Driver API (via `--driver-api-address`) and Fleet API (via `--fleet-api-address`) when starting:
fr: Le serveur Flower (expérimental) de longue durée (Driver API et Fleet API) peut maintenant configurer l'adresse du serveur de Driver API (via `--driver-api-address`) et de Fleet API (via `--fleet-api-address`) lors de son démarrage :
zh_hans: 长期运行的 Flower 服务器（Driver API 和 Fleet API）现在可以在启动时配置 Driver API（通过 `--driver-api-address`）和 Fleet API（通过 `-fleet-api-address`）的服务器地址：

source: `flower-superlink --driver-api-address "0.0.0.0:8081" --fleet-api-address "0.0.0.0:8086"`
zh_hans: `flower-server --driver-api-address "0.0.0.0:8081" --fleet-api-address "0.0.0.0:8086"`

source: Both IPv4 and IPv6 addresses are supported.
fr: Les adresses IPv4 et IPv6 sont toutes deux prises en charge.
zh_hans: 支持 IPv4 和 IPv6 地址。

source: **Add new example of Federated Learning using fastai and Flower** ([#1598](https://github.com/adap/flower/pull/1598))
fr: **Ajouter un nouvel exemple d'apprentissage fédéré utilisant fastai et Flower** ([#1598](https://github.com/adap/flower/pull/1598))
zh_hans: ** 添加使用 fastai 和 Flower 进行联邦学习的新示例** ([#1598](https://github.com/adap/flower/pull/1598))

source: A new code example (`quickstart_fastai`) demonstrates federated learning with [fastai](https://www.fast.ai/) and Flower. You can find it here: [quickstart_fastai](https://github.com/adap/flower/tree/main/examples/quickstart_fastai).
fr: Un nouvel exemple de code (`quickstart_fastai`) démontre l'apprentissage fédéré avec [fastai](https://www.fast.ai/) et Flower. Tu peux le trouver ici : [quickstart_fastai](https://github.com/adap/flower/tree/main/examples/quickstart_fastai).
zh_hans: 一个新的代码示例（`quickstart_fastai`）演示了使用 [fastai](https://www.fast.ai/) 和 Flower 的联邦学习。您可以在这里找到它： [quickstart_fastai](https://github.com/adap/flower/tree/main/examples/quickstart_fastai)。

source: **Make Android example compatible with** `flwr >= 1.0.0` **and the latest versions of Android** ([#1603](https://github.com/adap/flower/pull/1603))
fr: **Rendre l'exemple Android compatible avec** `flwr >= 1.0.0` **et les dernières versions d'Android** ([#1603](https://github.com/adap/flower/pull/1603))
zh_hans: **使安卓示例兼容** `flwr >= 1.0.0` **和最新版本的安卓** ([#1603](https://github.com/adap/flower/pull/1603))

source: The Android code example has received a substantial update: the project is compatible with Flower 1.0 (and later), the UI received a full refresh, and the project is updated to be compatible with newer Android tooling.
zh_hans: Android 代码示例已进行了大幅更新：项目兼容 Flower 1.0（及更高版本），用户界面已全面刷新，项目已更新为兼容较新的 Android 工具。

source: **Add new `FedProx` strategy** ([#1619](https://github.com/adap/flower/pull/1619))
fr: **Ajouter une nouvelle stratégie `FedProx`** ([#1619](https://github.com/adap/flower/pull/1619))
zh_hans: **添加新的`FedProx`策略** （[#1619](https://github.com/adap/flower/pull/1619)）

source: This [strategy](https://github.com/adap/flower/blob/main/src/py/flwr/server/strategy/fedprox.py) is almost identical to [`FedAvg`](https://github.com/adap/flower/blob/main/src/py/flwr/server/strategy/fedavg.py), but helps users replicate what is described in this [paper](https://arxiv.org/abs/1812.06127). It essentially adds a parameter called `proximal_mu` to regularize the local models with respect to the global models.
fr: Cette [stratégie](https://github.com/adap/flower/blob/main/src/py/flwr/server/strategy/fedprox.py) est presque identique à [`FedAvg`](https://github.com/adap/flower/blob/main/src/py/flwr/server/strategy/fedavg.py), mais aide les utilisateurs à reproduire ce qui est décrit dans cet [article](https://arxiv.org/abs/1812.06127). Elle ajoute essentiellement un paramètre appelé `proximal_mu` pour régulariser les modèles locaux par rapport aux modèles globaux.
zh_hans: 该[策略](https://github.com/adap/flower/blob/main/src/py/flwr/server/strategy/fedprox.py)与[`FedAvg`](https://github.com/adap/flower/blob/main/src/py/flwr/server/strategy/fedavg.py)几乎相同，但可以帮助用户复现本[论文](https://arxiv.org/abs/1812.06127)中的描述。它的本质是添加一个名为 `proximal_mu`的参数，使局部模型与全局模型正则化。

source: **Add new metrics to telemetry events** ([#1640](https://github.com/adap/flower/pull/1640))
fr: **Ajouter de nouvelles métriques aux événements de télémétrie** ([#1640](https://github.com/adap/flower/pull/1640))
zh_hans: **为遥测事件添加新指标**（[#1640](https://github.com/adap/flower/pull/1640)）

source: An updated event structure allows, for example, the clustering of events within the same workload.
fr: Une structure d'événements mise à jour permet, par exemple, de regrouper des événements au sein d'une même charge de travail.
zh_hans: 例如，更新后的事件结构可以将同一工作负载中的事件集中在一起。

source: **Add new custom strategy tutorial section** [#1623](https://github.com/adap/flower/pull/1623)
fr: **Ajouter une nouvelle section de tutoriel sur les stratégies personnalisées** [#1623](https://github.com/adap/flower/pull/1623)
zh_hans: **添加新的自定义策略教程部分** [#1623](https://github.com/adap/flower/pull/1623)

source: The Flower tutorial now has a new section that covers implementing a custom strategy from scratch: [Open in Colab](https://colab.research.google.com/github/adap/flower/blob/main/doc/source/tutorial-build-a-strategy-from-scratch-pytorch.ipynb)
zh_hans: Flower 教程新增了一个章节，介绍如何从零开始实施自定义策略： [在 Colab 中打开](https://colab.research.google.com/github/adap/flower/blob/main/doc/source/tutorial-build-a-strategy-from-scratch-pytorch.ipynb)

source: **Add new custom serialization tutorial section** ([#1622](https://github.com/adap/flower/pull/1622))
fr: **Ajouter une nouvelle section de tutoriel sur la sérialisation personnalisée** ([#1622](https://github.com/adap/flower/pull/1622))
zh_hans: ** 添加新的自定义序列化教程部分** ([#1622](https://github.com/adap/flower/pull/1622))
