Repository: lucacorbucci/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: fr, zh_hans

source: Then, we start the server:
zh_hans: 然后，我们启动服务器：

source: Tree-based bagging aggregation
zh_hans: 基于树的bagging聚合

source: You must be curious about how bagging aggregation works. Let's look into the details.
zh_hans: 您一定很好奇bagging聚合是如何工作的。让我们来详细了解一下。

source: In file :code:`flwr.server.strategy.fedxgb_bagging.py`, we define :code:`FedXgbBagging` inherited from :code:`flwr.server.strategy.FedAvg`. Then, we override the :code:`aggregate_fit`, :code:`aggregate_evaluate` and :code:`evaluate` methods as follows:
zh_hans: 在文件 :code:`flwr.server.strategy.fedxgb_bagging.py`中，我们定义了从 :code:`flwr.server.strategy.FedAvg`继承的 :code:`FedXgbBagging`。然后，我们覆盖 :code:`aggregate_fit`、:code:`aggregate_evaluate` 和 :code:`evaluate` 方法如下：

source: In :code:`aggregate_fit`, we sequentially aggregate the clients' XGBoost trees by calling :code:`aggregate()` function:
zh_hans: 在 :code:`aggregate_fit` 中，我们通过调用 :code:`aggregate()` 函数，按顺序聚合客户端的 XGBoost 树：

source: In this function, we first fetch the number of trees and the number of parallel trees for the current and previous model by calling :code:`_get_tree_nums`. Then, the fetched information will be aggregated. After that, the trees (containing model weights) are aggregated to generate a new tree model.
zh_hans: 在该函数中，我们首先通过调用 :code:`_get_tree_nums` 获取当前模型和上一个模型的树数和并行树数。然后，对获取的信息进行聚合。然后，聚合树（包含模型参数）生成新的树模型。

source: After traversal of all clients' models, a new global model is generated, followed by the serialisation, and sending back to each client.
zh_hans: 在遍历所有客户端的模型后，会生成一个新的全局模型，然后进行序列化，并发回给每个客户端。

source: Launch Federated XGBoost!
zh_hans: 启动联邦 XGBoost！

source: Congratulations! You've successfully built and run your first federated XGBoost system. The AUC values can be checked in :code:`metrics_distributed`. One can see that the average AUC increases over FL rounds.
zh_hans: 恭喜您！您已成功构建并运行了第一个联邦 XGBoost 系统。可以在 :code:`metrics_distributed` 中查看 AUC 值。我们可以看到，平均 AUC 随 FL 轮数的增加而增加。

source: The full `source code <https://github.com/adap/flower/blob/main/examples/xgboost-quickstart/>`_ for this example can be found in :code:`examples/xgboost-quickstart`.
zh_hans: 此示例的`完整源代码 <https://github.com/adap/flower/blob/main/examples/xgboost-quickstart/>`_ 可在 :code:`examples/xgboost-quickstart` 中找到。

source: Comprehensive Federated XGBoost
zh_hans: 综合的联邦 XGBoost

source: Now that you have known how federated XGBoost work with Flower, it's time to run some more comprehensive experiments by customising the experimental settings. In the xgboost-comprehensive example (`full code <https://github.com/adap/flower/tree/main/examples/xgboost-comprehensive>`_), we provide more options to define various experimental setups, including data partitioning and centralised/distributed evaluation. Let's take a look!
zh_hans: 既然您已经知道联合 XGBoost 如何与 Flower 协同工作，那么现在就该通过自定义实验设置来运行一些更综合的实验了。在 xgboost-comprehensive 示例 (`完整代码 <https://github.com/adap/flower/tree/main/examples/xgboost-comprehensive>`_)中，我们提供了更多选项来定义各种实验设置，包括数据分区和集中/分布式评估。让我们一起来看看！

source: Customised data partitioning
zh_hans: 定制数据分区

source: In :code:`dataset.py`, we have a function :code:`instantiate_partitioner` to instantiate the data partitioner based on the given :code:`num_partitions` and :code:`partitioner_type`. Currently, we provide four supported partitioner type to simulate the uniformity/non-uniformity in data quantity (uniform, linear, square, exponential).
zh_hans: 在 :code:`dataset.py` 中，我们有一个函数 :code:`instantiate_partitioner` 来根据给定的 :code:`num_partitions` 和 :code:`partitioner_type` 来实例化数据分区器。目前，我们提供四种支持的分区器类型（均匀、线性、正方形、指数）来模拟数据量的均匀性/非均匀性。

source: Customised centralised/distributed evaluation
zh_hans: 定制的集中/分布式评估

source: To facilitate centralised evaluation, we define a function in :code:`server.py`:
zh_hans: 为便于集中评估，我们在 :code:`server.py` 中定义了一个函数：

source: This function returns a evaluation function which instantiates a :code:`Booster` object and loads the global model weights to it. The evaluation is conducted by calling :code:`eval_set()` method, and the tested AUC value is reported.
zh_hans: 此函数返回一个评估函数，该函数实例化一个 :code:`Booster` 对象，并向其加载全局模型参数。评估通过调用 :code:`eval_set()` 方法进行，并报告测试的 AUC 值。

source: As for distributed evaluation on the clients, it's same as the quick-start example by overriding the :code:`evaluate()` method insides the :code:`XgbClient` class in :code:`client.py`.
zh_hans: 至于客户端上的分布式评估，与快速启动示例相同，通过覆盖 :code:`client.py` 中 :code:`XgbClient` 类内部的 :code:`evaluate()` 方法。

source: Arguments parser
zh_hans: 参数解析器

source: In :code:`utils.py`, we define the arguments parsers for clients and server, allowing users to specify different experimental settings. Let's first see the sever side:
zh_hans: 在 :code:`utils.py` 中，我们定义了客户端和服务器端的参数解析器，允许用户指定不同的实验设置。让我们先看看服务器端：

source: This allows user to specify the number of total clients / FL rounds / participating clients / clients for evaluation, and evaluation fashion. Note that with :code:`--centralised-eval`, the sever will do centralised evaluation and all functionalities for client evaluation will be disabled.
zh_hans: 这允许用户指定总客户数/FL 轮数/参与客户数/评估客户数以及评估方式。请注意，如果使用 :code:`--centralised-eval`，服务器将进行集中评估，客户端评估的所有功能将被禁用。

source: Then, the argument parser on client side:
zh_hans: 然后是客户端的参数解析器：

source: This defines various options for client data partitioning. Besides, clients also have a option to conduct evaluation on centralised test set by setting :code:`--centralised-eval`.
zh_hans: 这定义了客户端数据分区的各种选项。此外，通过设置 :code:`-centralised-eval`，客户端还可以选择在集中测试集上进行评估。

source: Example commands
zh_hans: 命令示例

source: To run a centralised evaluated experiment on 5 clients with exponential distribution for 50 rounds, we first start the server as below:
zh_hans: 为了在 5 个客户端上进行 50 轮指数分布的集中评估实验，我们首先启动服务器，如下所示：

source: Then, on each client terminal, we start the clients:
zh_hans: 然后，我们在每个客户终端上启动客户机：

source: The full `source code <https://github.com/adap/flower/blob/main/examples/xgboost-comprehensive/>`_ for this comprehensive example can be found in :code:`examples/xgboost-comprehensive`.
zh_hans: 此综合示例的全部`源代码 <https://github.com/adap/flower/blob/main/examples/xgboost-comprehensive/>`_ 可在 :code:`examples/xgboost-comprehensive` 中找到。

source: Build a strategy from scratch
zh_hans: 从零开始制定策略

source: Welcome to the third part of the Flower federated learning tutorial. In previous parts of this tutorial, we introduced federated learning with PyTorch and Flower (`part 1 <https://flower.dev/docs/framework/tutorial-get-started-with-flower-pytorch.html>`__) and we learned how strategies can be used to customize the execution on both the server and the clients (`part 2 <https://flower.dev/docs/framework/tutorial-use-a-federated-learning-strategy-pytorch.html>`__).
zh_hans: 欢迎来到 Flower 联邦学习教程的第三部分。在本教程的前几部分，我们介绍了 PyTorch 和 Flower 的联邦学习（`part 1 <https://flower.dev/docs/framework/tutorial-get-started-with-flower-pytorch.html>`__），并学习了如何使用策略来定制服务器和客户端的执行（`part 2 <https://flower.dev/docs/framework/tutorial-use-a-federated-learning-strategy-pytorch.html>`__）。

source: In this notebook, we'll continue to customize the federated learning system we built previously by creating a custom version of FedAvg (again, using `Flower <https://flower.dev/>`__ and `PyTorch <https://pytorch.org/>`__).
fr: Dans ce carnet, nous allons continuer à personnaliser le système d'apprentissage fédéré que nous avons construit précédemment en créant une version personnalisée de FedAvg (encore une fois, en utilisant `Flower <https://flower.dev/>`__ et `PyTorch <https://pytorch.org/>`__).
zh_hans: 在本笔记中，我们将通过创建 FedAvg 的自定义版本（再次使用 `Flower <https://flower.dev/>`__ 和 `PyTorch <https://pytorch.org/>`__），继续定制我们之前构建的联邦学习系统。

source: `Star Flower on GitHub <https://github.com/adap/flower>`__ ⭐️ and join the Flower community on Slack to connect, ask questions, and get help: `Join Slack <https://flower.dev/join-slack>`__ 🌼 We'd love to hear from you in the ``#introductions`` channel! And if anything is unclear, head over to the ``#questions`` channel.
fr: `Star Flower on GitHub <https://github.com/adap/flower>`__ ⭐️ et rejoignez la communauté Flower sur Slack pour vous connecter, poser des questions et obtenir de l'aide : `Join Slack <https://flower.dev/join-slack>`__ 🌼 Nous serions ravis d'avoir de vos nouvelles dans le canal ``#introductions`` ! Et si quelque chose n'est pas clair, rendez-vous sur le canal ``#questions``.
zh_hans: `Star Flower on GitHub <https://github.com/adap/flower>`__ ⭐️ 并加入 Slack 上的 Flower 社区，进行交流、提问并获得帮助： 加入 Slack <https://flower.dev/join-slack>`__ 🌼 我们希望在 ``#introductions`` 频道听到您的声音！如果有任何不清楚的地方，请访问 ``#questions`` 频道。

source: Let's build a new ``Strategy`` from scratch!
fr: Construisons une nouvelle ``Stratégie`` à partir de zéro !
zh_hans: 让我们从头开始构建一个新的``Strategy``！

source: Preparation
fr: Préparation
zh_hans: 准备工作

source: Before we begin with the actual code, let's make sure that we have everything we need.
fr: Avant de commencer le code proprement dit, assurons-nous que nous disposons de tout ce dont nous avons besoin.
zh_hans: 在开始实际代码之前，让我们先确保我们已经准备好了所需的一切。

source: Installing dependencies
fr: Installation des dépendances
zh_hans: 安装依赖项

source: First, we install the necessary packages:
fr: Tout d'abord, nous installons les paquets nécessaires :
zh_hans: 首先，我们安装必要的软件包：

source: Now that we have all dependencies installed, we can import everything we need for this tutorial:
fr: Maintenant que toutes les dépendances sont installées, nous pouvons importer tout ce dont nous avons besoin pour ce tutoriel :
zh_hans: 现在我们已经安装了所有依赖项，可以导入本教程所需的所有内容：

source: It is possible to switch to a runtime that has GPU acceleration enabled (on Google Colab: ``Runtime > Change runtime type > Hardware acclerator: GPU > Save``). Note, however, that Google Colab is not always able to offer GPU acceleration. If you see an error related to GPU availability in one of the following sections, consider switching back to CPU-based execution by setting ``DEVICE = torch.device("cpu")``. If the runtime has GPU acceleration enabled, you should see the output ``Training on cuda``, otherwise it'll say ``Training on cpu``.
fr: Il est possible de passer à un runtime dont l'accélération GPU est activée (sur Google Colab : ``Runtime > Change runtime type > Hardware acclerator : GPU > Save``). Note cependant que Google Colab n'est pas toujours en mesure de proposer l'accélération GPU. Si tu vois une erreur liée à la disponibilité du GPU dans l'une des sections suivantes, envisage de repasser à une exécution basée sur le CPU en définissant ``DEVICE = torch.device("cpu")``. Si le runtime a activé l'accélération GPU, tu devrais voir apparaître le résultat ``Training on cuda``, sinon il dira ``Training on cpu``.
zh_hans: 可以切换到已启用 GPU 加速的运行时（在 Google Colab 上： 运行时 > 更改运行时类型 > 硬件加速： GPU > 保存``）。但请注意，Google Colab 并非总能提供 GPU 加速。如果在以下部分中看到与 GPU 可用性相关的错误，请考虑通过设置 ``DEVICE = torch.device("cpu")`` 切回基于 CPU 的执行。如果运行时已启用 GPU 加速，你应该会看到输出``Training on cuda``，否则会显示``Training on cpu``。

source: Data loading
fr: Chargement des données
zh_hans: 数据加载

source: Let's now load the CIFAR-10 training and test set, partition them into ten smaller datasets (each split into training and validation set), and wrap everything in their own ``DataLoader``. We introduce a new parameter ``num_clients`` which allows us to call ``load_datasets`` with different numbers of clients.
fr: Chargeons maintenant les ensembles d'entraînement et de test CIFAR-10, divisons-les en dix ensembles de données plus petits (chacun divisé en ensemble d'entraînement et de validation), et enveloppons le tout dans leur propre ``DataLoader``. Nous introduisons un nouveau paramètre ``num_clients`` qui nous permet d'appeler ``load_datasets`` avec différents nombres de clients.
zh_hans: 现在，让我们加载 CIFAR-10 训练集和测试集，将它们分割成 10 个较小的数据集（每个数据集又分为训练集和验证集），并将所有数据都封装在各自的 ``DataLoader`` 中。我们引入了一个新参数 ``num_clients``，它允许我们使用不同数量的客户端调用 ``load_datasets``。

source: Model training/evaluation
fr: Formation/évaluation du modèle
zh_hans: 模型培训/评估

source: Let's continue with the usual model definition (including ``set_parameters`` and ``get_parameters``), training and test functions:
fr: Continuons avec la définition habituelle du modèle (y compris ``set_parameters`` et ``get_parameters``), les fonctions d'entraînement et de test :
zh_hans: 让我们继续使用常见的模型定义（包括 `set_parameters` 和 `get_parameters`）、训练和测试函数：

source: Flower client
fr: Client de Flower
zh_hans: Flower 客户端

source: To implement the Flower client, we (again) create a subclass of ``flwr.client.NumPyClient`` and implement the three methods ``get_parameters``, ``fit``, and ``evaluate``. Here, we also pass the ``cid`` to the client and use it log additional details:
fr: Pour mettre en œuvre le client Flower, nous créons (à nouveau) une sous-classe de ``flwr.client.NumPyClient`` et mettons en œuvre les trois méthodes ``get_parameters``, ``fit`` et ``evaluate``. Ici, nous transmettons également le ``cid`` au client et l'utilisons pour consigner des détails supplémentaires :
zh_hans: 为了实现 Flower 客户端，我们（再次）创建了 ``flwr.client.NumPyClient`` 的子类，并实现了 ``get_parameters``、``fit`` 和 ``evaluate``三个方法。在这里，我们还将 ``cid`` 传递给客户端，并使用它记录其他详细信息：

source: Let's test what we have so far before we continue:
fr: Testons ce que nous avons jusqu'à présent avant de continuer :
zh_hans: 在继续之前，让我们先测试一下我们目前掌握的情况：

source: Build a Strategy from scratch
fr: Élaborer une stratégie à partir de zéro
zh_hans: 从零开始构建策略

source: Let’s overwrite the ``configure_fit`` method such that it passes a higher learning rate (potentially also other hyperparameters) to the optimizer of a fraction of the clients. We will keep the sampling of the clients as it is in ``FedAvg`` and then change the configuration dictionary (one of the ``FitIns`` attributes).
fr: Remplaçons la méthode ``configure_fit`` de façon à ce qu'elle transmette un taux d'apprentissage plus élevé (potentiellement aussi d'autres hyperparamètres) à l'optimiseur d'une fraction des clients. Nous garderons l'échantillonnage des clients tel qu'il est dans ``FedAvg`` et changerons ensuite le dictionnaire de configuration (l'un des attributs ``FitIns``).
zh_hans: 让我们重写 ``configure_fit`` 方法，使其向一部分客户的优化器传递更高的学习率（可能还有其他超参数）。我们将保持 ``FedAvg`` 中的客户端采样，然后更改配置字典（``FitIns`` 属性之一）。

source: The only thing left is to use the newly created custom Strategy ``FedCustom`` when starting the experiment:
fr: Il ne reste plus qu'à utiliser la stratégie personnalisée nouvellement créée ``FedCustom`` lors du démarrage de l'expérience :
zh_hans: 剩下的唯一工作就是在启动实验时使用新创建的自定义策略 ``FedCustom`` ：

source: Recap
fr: Récapitulation
zh_hans: 回顾

source: In this notebook, we’ve seen how to implement a custom strategy. A custom strategy enables granular control over client node configuration, result aggregation, and more. To define a custom strategy, you only have to overwrite the abstract methods of the (abstract) base class ``Strategy``. To make custom strategies even more powerful, you can pass custom functions to the constructor of your new class (``__init__``) and then call these functions whenever needed.
fr: Dans ce carnet, nous avons vu comment mettre en place une stratégie personnalisée. Une stratégie personnalisée permet un contrôle granulaire sur la configuration des nœuds clients, l'agrégation des résultats, et bien plus encore. Pour définir une stratégie personnalisée, il te suffit d'écraser les méthodes abstraites de la classe de base (abstraite) ``Strategy``. Pour rendre les stratégies personnalisées encore plus puissantes, tu peux passer des fonctions personnalisées au constructeur de ta nouvelle classe (``__init__``) et appeler ensuite ces fonctions à chaque fois que c'est nécessaire.
zh_hans: 在本笔记中，我们了解了如何实施自定义策略。自定义策略可以对客户端节点配置、结果聚合等进行细粒度控制。要定义自定义策略，只需覆盖（抽象）基类 ``Strategy`` 的抽象方法即可。为使自定义策略更加强大，您可以将自定义函数传递给新类的构造函数（`__init__``），然后在需要时调用这些函数。

source: Before you continue, make sure to join the Flower community on Slack: `Join Slack <https://flower.dev/join-slack/>`__
fr: Avant de continuer, n'oublie pas de rejoindre la communauté Flower sur Slack : `Join Slack <https://flower.dev/join-slack/>`__
zh_hans: 在继续之前，请务必加入 Slack 上的 Flower 社区：`Join Slack <https://flower.dev/join-slack/>`__

source: There's a dedicated ``#questions`` channel if you need help, but we'd also love to hear who you are in ``#introductions``!
fr: Il existe un canal dédié aux ``questions`` si vous avez besoin d'aide, mais nous aimerions aussi savoir qui vous êtes dans ``#introductions`` !
zh_hans: 如果您需要帮助，我们有专门的 ``#questions`` 频道，但我们也很乐意在 ``#introductions`` 中了解您是谁！

source: The `Flower Federated Learning Tutorial - Part 4 <https://flower.dev/docs/framework/tutorial-customize-the-client-pytorch.html>`__ introduces ``Client``, the flexible API underlying ``NumPyClient``.
zh_hans: Flower联邦学习教程 - 第4部分 <https://flower.dev/docs/framework/tutorial-customize-the-client-pytorch.html>`__ 介绍了``Client``，它是``NumPyClient``底层的灵活应用程序接口。

source: Customize the client
zh_hans: 自定义客户端

source: Welcome to the fourth part of the Flower federated learning tutorial. In the previous parts of this tutorial, we introduced federated learning with PyTorch and Flower (`part 1 <https://flower.dev/docs/framework/tutorial-get-started-with-flower-pytorch.html>`__), we learned how strategies can be used to customize the execution on both the server and the clients (`part 2 <https://flower.dev/docs/framework/tutorial-use-a-federated-learning-strategy-pytorch.html>`__), and we built our own custom strategy from scratch (`part 3 <https://flower.dev/docs/framework/tutorial-build-a-strategy-from-scratch-pytorch.html>`__).
zh_hans: 欢迎来到 Flower 联邦学习教程的第四部分。在本教程的前几部分中，我们介绍了 PyTorch 和 Flower 的联邦学习（`part 1 <https://flower.dev/docs/framework/tutorial-get-started-with-flower-pytorch.html>`__），了解了如何使用策略来定制服务器和客户端的执行（`part 2 <https://flower.dev/docs/framework/tutorial-use-a-federated-learning-strategy-pytorch.html>`__），并从头开始构建了我们自己的定制策略（`part 3 <https://flower.dev/docs/framework/tutorial-build-a-strategy-from-scratch-pytorch.html>`__）。

source: In this notebook, we revisit ``NumPyClient`` and introduce a new baseclass for building clients, simply named ``Client``. In previous parts of this tutorial, we've based our client on ``NumPyClient``, a convenience class which makes it easy to work with machine learning libraries that have good NumPy interoperability. With ``Client``, we gain a lot of flexibility that we didn't have before, but we'll also have to do a few things the we didn't have to do before.
fr: Dans ce carnet, nous revisitons `NumPyClient`` et introduisons une nouvelle classe de base pour construire des clients, simplement appelée `Client``. Dans les parties précédentes de ce tutoriel, nous avons basé notre client sur ``NumPyClient``, une classe de commodité qui facilite le travail avec les bibliothèques d'apprentissage automatique qui ont une bonne interopérabilité NumPy. Avec ``Client``, nous gagnons beaucoup de flexibilité que nous n'avions pas auparavant, mais nous devrons également faire quelques choses que nous n'avions pas à faire auparavant.
zh_hans: 在本笔记中，我们将重温 ``NumPyClient`` 并引入一个用于构建客户端的新基类，简单命名为 ``Client``。在本教程的前几部分中，我们的客户端基于``NumPyClient``，这是一个便捷类，可以让我们轻松地与具有良好 NumPy 互操作性的机器学习库协同工作。有了 ``Client``，我们获得了很多以前没有的灵活性，但我们也必须做一些以前不需要做的事情。

source: Let's go deeper and see what it takes to move from ``NumPyClient`` to ``Client``!
fr: Allons plus loin et voyons ce qu'il faut faire pour passer de ``NumPyClient`` à ``Client`` !
zh_hans: 让我们深入了解一下从 ``NumPyClient`` 到 ``Client`` 的过程！

source: Step 0: Preparation
fr: Étape 0 : Préparation
zh_hans: 步骤 0：准备工作

source: Let's now load the CIFAR-10 training and test set, partition them into ten smaller datasets (each split into training and validation set), and wrap everything in their own ``DataLoader``.
fr: Chargeons maintenant les ensembles d'entraînement et de test CIFAR-10, divisons-les en dix ensembles de données plus petits (chacun divisé en ensemble d'entraînement et de validation) et enveloppons le tout dans leur propre ``DataLoader``.
zh_hans: 现在，让我们加载 CIFAR-10 训练集和测试集，将它们分割成十个较小的数据集（每个数据集又分为训练集和验证集），并将所有数据都封装在各自的 ``DataLoader`` 中。

source: Step 1: Revisiting NumPyClient
fr: Étape 1 : Revoir NumPyClient
zh_hans: 步骤 1：重温 NumPyClient

source: So far, we've implemented our client by subclassing ``flwr.client.NumPyClient``. The three methods we implemented are ``get_parameters``, ``fit``, and ``evaluate``. Finally, we wrap the creation of instances of this class in a function called ``client_fn``:
fr: Jusqu'à présent, nous avons implémenté notre client en sous-classant ``flwr.client.NumPyClient``. Les trois méthodes que nous avons implémentées sont ``get_parameters``, ``fit`` et ``evaluate``. Enfin, nous enveloppons la création d'instances de cette classe dans une fonction appelée ``client_fn`` :
zh_hans: 到目前为止，我们通过子类化 ``flwr.client.NumPyClient`` 实现了我们的客户端。我们实现了三个方法：``get_parameters``, ``fit`, 和``evaluate``。最后，我们用一个名为 ``client_fn`` 的函数来创建该类的实例：

source: We've seen this before, there's nothing new so far. The only *tiny* difference compared to the previous notebook is naming, we've changed ``FlowerClient`` to ``FlowerNumPyClient`` and ``client_fn`` to ``numpyclient_fn``. Let's run it to see the output we get:
fr: Nous avons déjà vu cela auparavant, il n'y a rien de nouveau jusqu'à présent. La seule *petite* différence par rapport au carnet précédent est le nommage, nous avons changé ``FlowerClient`` en ``FlowerNumPyClient`` et ``client_fn`` en ``numpyclient_fn``. Exécutons-le pour voir la sortie que nous obtenons :
zh_hans: 我们以前见过这种情况，目前没有什么新东西。与之前的笔记相比，唯一*小*的不同是命名，我们把 ``FlowerClient`` 改成了 ``FlowerNumPyClient``，把 `client_fn` 改成了 ``numpyclient_fn``。让我们运行它看看输出结果：

source: This works as expected, two clients are training for three rounds of federated learning.
fr: Cela fonctionne comme prévu, deux clients s'entraînent pour trois tours d'apprentissage fédéré.
zh_hans: 结果不出所料，两个客户端正在进行三轮联邦学习训练。

source: Let's dive a little bit deeper and discuss how Flower executes this simulation. Whenever a client is selected to do some work, ``start_simulation`` calls the function ``numpyclient_fn`` to create an instance of our ``FlowerNumPyClient`` (along with loading the model and the data).
fr: Plongeons un peu plus profondément et discutons de la façon dont Flower exécute cette simulation. Chaque fois qu'un client est sélectionné pour effectuer un travail, ``start_simulation`` appelle la fonction ``numpyclient_fn`` pour créer une instance de notre ``FlowerNumPyClient`` (en même temps qu'il charge le modèle et les données).
zh_hans: 让我们再深入一点，讨论一下 Flower 是如何执行模拟的。每当一个客户端被选中进行工作时，`start_simulation`` 就会调用函数 `numpyclient_fn` 来创建我们的 ``FlowerNumPyClient`` 实例（同时加载模型和数据）。

source: But here's the perhaps surprising part: Flower doesn't actually use the ``FlowerNumPyClient`` object directly. Instead, it wraps the object to makes it look like a subclass of ``flwr.client.Client``, not ``flwr.client.NumPyClient``. In fact, the Flower core framework doesn't know how to handle ``NumPyClient``'s, it only knows how to handle ``Client``'s. ``NumPyClient`` is just a convenience abstraction built on top of ``Client``.
fr: Mais voici la partie la plus surprenante : Flower n'utilise pas directement l'objet `FlowerNumPyClient`. Au lieu de cela, il enveloppe l'objet pour le faire ressembler à une sous-classe de `flwr.client.Client`, et non de `flwr.client.NumPyClient`. En fait, le noyau de Flower ne sait pas comment gérer les `NumPyClient`, il sait seulement comment gérer les `Client`. `NumPyClient` est juste une abstraction de commodité construite au dessus de `Client`.
zh_hans: 但令人惊讶的部分也许就在这里： Flower 实际上并不直接使用 ``FlowerNumPyClient`` 对象。相反，它封装了该对象，使其看起来像 ``flwr.client.Client`` 的子类，而不是 ``flwr.client.NumPyClient``。事实上，Flower 核心框架不知道如何处理 ``NumPyClient``，它只知道如何处理 ``Client``。``NumPyClient`` 只是建立在``Client``之上的便捷抽象类。
