Repository: lucacorbucci/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: fr, zh_hans

source: The IPv4 or IPv6 address of the server. Defaults to `"[::]:8080"`.
zh_hans: 服务器的 IPv4 或 IPv6 地址。默认为 `"[::]:8080"。

source: A server implementation, either `flwr.server.Server` or a subclass thereof. If no instance is provided, then `start_server` will create one.
zh_hans: 服务器实现，可以是 `flwr.server.Server` 或其子类。如果没有提供实例，`start_server` 将创建一个。

source: An implementation of the abstract base class `flwr.server.strategy.Strategy`. If no strategy is provided, then `start_server` will use `flwr.server.strategy.FedAvg`.
zh_hans: 抽象基类 `flwr.server.strategy.Strategy` 的实现。如果没有提供策略，`start_server` 将使用 `flwr.server.strategy.FedAvg`。

source: An implementation of the abstract base class `flwr.server.ClientManager`. If no implementation is provided, then `start_server` will use `flwr.server.client_manager.SimpleClientManager`.
zh_hans: 抽象基类 `flwr.server.ClientManager` 的实现。如果没有提供实现，`start_server` 将使用 `flwr.server.client_manager.SimpleClientManager`。

source: The maximum length of gRPC messages that can be exchanged with the Flower clients. The default should be sufficient for most models. Users who train very large models might need to increase this value. Note that the Flower clients need to be started with the same value (see `flwr.client.start_client`), otherwise clients will not know about the increased limit and block larger messages.
zh_hans: 可与 Flower 客户端交换的 gRPC 消息的最大长度：默认值对大多数模型都足够了。训练超大模型的用户可能需要增加该值。请注意，Flower 客户端需要以相同的值启动（请参阅 `flwr.client.start_client`），否则客户端将不知道已增加的限制并阻止更大的消息。

source: Tuple containing root certificate, server certificate, and private key to start a secure SSL-enabled server. The tuple is expected to have three bytes elements in the following order: * CA certificate. * server certificate. * server private key.
zh_hans: 包含根证书、服务器证书和私钥的元组，用于启动启用 SSL 的安全服务器。元组应按以下顺序包含三个字节元素： * CA 证书，* 服务器证书， * 服务器私钥。

source: Tuple containing root certificate, server certificate, and private key to start a secure SSL-enabled server. The tuple is expected to have three bytes elements in the following order:
zh_hans: 包含根证书、服务器证书和私钥的元组，用于启动启用 SSL 的安全服务器。元组应按以下顺序包含三个字节元素：

source: CA certificate.
zh_hans: CA 证书。

source: server certificate.
zh_hans: 服务器证书。

source: server private key.
zh_hans: 服务器私人密钥。

source: **hist** -- Object containing training and evaluation metrics.
zh_hans: **hist** -- 包含训练和评估指标的对象。

source: Starting an insecure server:
zh_hans: 启动不安全的服务器：

source: Starting an SSL-enabled server:
zh_hans: 启动支持 SSL 的服务器：

source: Contains the strategy abstraction and different implementations.
zh_hans: 包含策略抽象和不同的实现方法。

source: Abstract base class for server strategy implementations.
zh_hans: 服务器策略实现的抽象基类。

source: Aggregate evaluation results.
zh_hans: 聚合评估结果。

source: The current round of federated learning.
zh_hans: 本轮联邦学习。

source: Successful updates from the previously selected and configured clients. Each pair of `(ClientProxy, FitRes` constitutes a successful update from one of the previously selected clients. Not that not all previously selected clients are necessarily included in this list: a client might drop out and not submit a result. For each client that did not submit an update, there should be an `Exception` in `failures`.
zh_hans: 从先前选定和配置的客户端进行的成功更新。每一对`(ClientProxy, FitRes)`都是来自先前选定客户端的一次成功更新。但并非所有先前选定的客户机都一定包含在此列表中：客户机可能会退出，不提交结果。对于每个没有提交更新的客户端，`failures`中都应该有一个`Exception`。

source: Exceptions that occurred while the server was waiting for client updates.
zh_hans: 服务器等待客户端更新时发生的异常。

source: **aggregation_result** -- The aggregated evaluation result. Aggregation typically uses some variant of a weighted average.
zh_hans: **aggregation_result** -- 汇总的评估结果。聚合通常使用某种加权平均值。

source: Aggregate training results.
zh_hans: 汇总训练结果。

source: Successful updates from the previously selected and configured clients. Each pair of `(ClientProxy, FitRes)` constitutes a successful update from one of the previously selected clients. Not that not all previously selected clients are necessarily included in this list: a client might drop out and not submit a result. For each client that did not submit an update, there should be an `Exception` in `failures`.
zh_hans: 来自先前选定和配置的客户端的成功更新。每一对`(ClientProxy, FitRes)`都构成先前选定的客户端之一的一次成功更新。但并非所有先前选定的客户机都一定包含在此列表中：客户机可能会退出，不提交结果。对于每个没有提交更新的客户端，"失败 "中都应该有一个 "异常"。

source: **parameters** -- If parameters are returned, then the server will treat these as the new global model parameters (i.e., it will replace the previous parameters with the ones returned from this method). If `None` is returned (e.g., because there were only failures and no viable results) then the server will no update the previous model parameters, the updates received in this round are discarded, and the global model parameters remain the same.
zh_hans: **parameters** -- 如果返回参数，那么服务器将把这些参数作为新的全局模型参数（即用本方法返回的参数替换之前的参数）。如果返回 "无"（例如，因为只有失败而没有可行的结果），那么服务器将不再更新之前的模型参数，本轮收到的更新将被丢弃，全局模型参数保持不变。

source: Configure the next round of evaluation.
zh_hans: 配置下一轮评估。

source: The client manager which holds all currently connected clients.
zh_hans: 客户端管理器，用于管理当前连接的所有客户端。

source: **evaluate_configuration** -- A list of tuples. Each tuple in the list identifies a `ClientProxy` and the `EvaluateIns` for this particular `ClientProxy`. If a particular `ClientProxy` is not included in this list, it means that this `ClientProxy` will not participate in the next round of federated evaluation.
zh_hans: **evaluate_configuration** -- 一个元组列表。列表中的每个元组都标识了一个`ClientProxy`和该特定`ClientProxy`的`EvaluateIns`。如果某个特定的 `ClientProxy` 未包含在此列表中，则表示该 `ClientProxy` 将不参与下一轮联合评估。

source: Configure the next round of training.
zh_hans: 配置下一轮训练。

source: **fit_configuration** -- A list of tuples. Each tuple in the list identifies a `ClientProxy` and the `FitIns` for this particular `ClientProxy`. If a particular `ClientProxy` is not included in this list, it means that this `ClientProxy` will not participate in the next round of federated learning.
zh_hans: **fit_configuration** -- 一个元组列表。列表中的每个元组都标识了一个`ClientProxy`和该特定`ClientProxy`的`FitIns'。如果某个特定的`ClientProxy`不在此列表中，则表示该`ClientProxy`将不参加下一轮联合学习。

source: Evaluate the current model parameters.
zh_hans: 评估当前的模型参数。

source: This function can be used to perform centralized (i.e., server-side) evaluation of model parameters.
zh_hans: 该函数可用于对模型参数进行集中（即服务器端）评估。

source: **evaluation_result** -- The evaluation result, usually a Tuple containing loss and a dictionary containing task-specific metrics (e.g., accuracy).
zh_hans: **evaluation_result** -- 评估结果，通常是一个元组，包含损失值和一个字典，字典中包含特定任务的指标（如准确率）。

source: Initialize the (global) model parameters.
zh_hans: 初始化（全局）模型参数。

source: **parameters** -- If parameters are returned, then the server will treat these as the initial global model parameters.
zh_hans: **parameters** -- 如果返回参数，服务器将把这些参数视为初始全局模型参数。

source: Configurable FedAvg strategy implementation.
zh_hans: 可配置的 FedAvg 策略实施。

source: Federated Averaging strategy.
zh_hans: 联邦平均策略。

source: Implementation based on https://arxiv.org/abs/1602.05629
zh_hans: 实施基于 https://arxiv.org/abs/1602.05629

source: Fraction of clients used during training. In case `min_fit_clients` is larger than `fraction_fit * available_clients`, `min_fit_clients` will still be sampled. Defaults to 1.0.
zh_hans: 训练过程中使用的客户端比例。如果 `min_fit_clients` 大于 `fraction_fit * available_clients`，则仍会对 `min_fit_clients` 进行采样。默认为 1.0。

source: Fraction of clients used during validation. In case `min_evaluate_clients` is larger than `fraction_evaluate * available_clients`, `min_evaluate_clients` will still be sampled. Defaults to 1.0.
zh_hans: 验证过程中使用的客户端的比例。如果 `min_evaluate_clients` 大于 `fraction_evaluate * available_clients`，则仍会对 `min_evaluate_clients` 进行采样。默认为 1.0。

source: Minimum number of clients used during training. Defaults to 2.
zh_hans: 训练期间使用的最少客户数。默认为 2。

source: Minimum number of clients used during validation. Defaults to 2.
zh_hans: 验证过程中使用的最少客户端数量。默认为 2。

source: Minimum number of total clients in the system. Defaults to 2.
zh_hans: 系统中客户总数的最小值。默认为 2。

source: Optional function used for validation. Defaults to None.
zh_hans: 用于验证的可选函数。默认为 "无"。

source: Function used to configure training. Defaults to None.
zh_hans: 用于配置训练的功能。默认为 "无"。

source: Function used to configure validation. Defaults to None.
zh_hans: 用于配置验证的函数。默认为 "无"。

source: Whether or not accept rounds containing failures. Defaults to True.
zh_hans: 是否接受包含失败的轮。默认为 True。

source: Initial global model parameters.
zh_hans: 初始全局模型参数。

source: Metrics aggregation function, optional.
zh_hans: 指标汇总功能，可选。

source: Aggregate evaluation losses using weighted average.
zh_hans: 采用加权平均法计算评估损失总额。

source: Aggregate fit results using weighted average.
zh_hans: 使用加权平均法汇总拟合结果。

source: Evaluate model parameters using an evaluation function.
zh_hans: 使用评估函数评估模型参数。

source: Initialize global model parameters.
zh_hans: 初始化全局模型参数。

source: Use a fraction of available clients for evaluation.
zh_hans: 使用部分可用客户进行评估。

source: Return the sample size and the required number of available clients.
zh_hans: 返回样本大小和所需的可用客户数量。

source: Configurable FedAvg with Momentum strategy implementation.
zh_hans: 可配置的 FedAvg 动量策略实施。

source: Federated Averaging with Momentum strategy.
zh_hans: 联邦平均动量策略。

source: Implementation based on https://arxiv.org/pdf/1909.06335.pdf
zh_hans: 实施基于 https://arxiv.org/pdf/1909.06335.pdf

source: Fraction of clients used during training. Defaults to 0.1.
zh_hans: 训练期间使用客户的比例。默认为 0.1。

source: Fraction of clients used during validation. Defaults to 0.1.
zh_hans: 验证过程中使用的客户端比例。默认为 0.1。

source: Server-side learning rate used in server-side optimization. Defaults to 1.0.
zh_hans: 服务器端优化中使用的服务器端学习率。默认为 1.0。

source: Server-side momentum factor used for FedAvgM. Defaults to 0.0.
zh_hans: 用于 FedAvgM 的服务器端动量因子。默认为 0.0。

source: Aggregate fit results using median.
zh_hans: 使用中位数汇总拟合结果。

source: Configurable QFedAvg strategy implementation.
zh_hans: 可配置的 QFedAvg 策略实施。

source: Configurable fault-tolerant FedAvg strategy implementation.
zh_hans: 可配置的容错 FedAvg 策略实施。

source: Configurable FedAdagrad strategy implementation.
zh_hans: 可配置的 FedAdagrad 策略实施。

source: Federated Optim strategy interface.
zh_hans: Federated Optim 策略界面。

source: Implementation based on https://arxiv.org/abs/2003.00295v5
zh_hans: 实施基于 https://arxiv.org/abs/2003.00295v5

source: Fraction of clients used during training. Defaults to 1.0.
zh_hans: 训练期间使用客户的比例。默认为 1.0。

source: Fraction of clients used during validation. Defaults to 1.0.
zh_hans: 验证过程中使用的客户端比例。默认为 1.0。

source: Server-side learning rate. Defaults to 1e-1.
zh_hans: 服务器端学习率。默认为 1e-1。

source: Client-side learning rate. Defaults to 1e-1.
zh_hans: 客户端学习率。默认为 1e-1。

source: Momentum parameter. Defaults to 0.0.
zh_hans: 动量参数。默认为 0.0。

source: Second moment parameter. Defaults to 0.0.
zh_hans: 第二动量参数。默认为 0.0。

source: Controls the algorithm's degree of adaptability. Defaults to 1e-9.
zh_hans: 控制算法的适应度。默认为 1e-9。

source: Configurable FedProx strategy implementation.
zh_hans: 可配置的 FedProx 策略实施。

source: Federated Optimization strategy.
zh_hans: 联邦优化策略。

source: Implementation based on https://arxiv.org/abs/1812.06127
zh_hans: 实施基于 https://arxiv.org/abs/1812.06127

source: The strategy in itself will not be different than FedAvg, the client needs to be adjusted. A proximal term needs to be added to the loss function during the training:
zh_hans: 策略本身与 FedAvg 并无不同，客户端需要进行调整。在训练过程中，需要在损失函数中添加一个近端项：

source: Where $w^t$ are the global parameters and $w$ are the local weights the function will be optimized with.
zh_hans: 其中，$w^t$ 是全局参数，$w$ 是优化函数的局部权重。

source: In PyTorch, for example, the loss would go from:
zh_hans: 例如，在 PyTorch 中，损失将从：

source: To:
zh_hans: 致：

source: With `global_params` being a copy of the parameters before the training takes place.
zh_hans: 其中，"global_params "是训练前的参数副本。

source: The weight of the proximal term used in the optimization. 0.0 makes this strategy equivalent to FedAvg, and the higher the coefficient, the more regularization will be used (that is, the client parameters will need to be closer to the server parameters during training).
zh_hans: 优化中使用的近端项权重。0.0 使该策略等同于 FedAvg，系数越大，使用的正则化就越多（也就是说，在训练过程中，客户端参数需要更接近服务器参数）。

source: Sends the proximal factor mu to the clients
zh_hans: 向客户发送近端因子mu

source: FedAdagrad strategy - Adaptive Federated Optimization using Adagrad.
zh_hans: FedAdagrad 策略 - 使用 Adagrad 进行自适应联合优化。

source: Paper: https://arxiv.org/abs/2003.00295
zh_hans: 论文： https://arxiv.org/abs/2003.00295

source: Federated learning strategy using Adagrad on server-side.
zh_hans: 在服务器端使用 Adagrad 的联邦学习策略。

source: FedAdam - Adaptive Federated Optimization using Adam.
zh_hans: FedAdam - 使用 Adam 进行自适应联合优化。

source: Momentum parameter. Defaults to 0.9.
zh_hans: 动量参数。默认为 0.9。

source: Second moment parameter. Defaults to 0.99.
zh_hans: 第二动量参数。默认为 0.99。

source: FedYogi [Reddi et al., 2020] strategy.
zh_hans: FedYogi [Reddi 等人，2020] 策略。

source: Adaptive Federated Optimization using Yogi.
zh_hans: 使用 Yogi 的自适应联合优化。

source: Federated learning strategy using Yogi on server-side.
zh_hans: 在服务器端使用 Yogi 的联邦学习策略。

source: Federated Averaging with Trimmed Mean [Dong Yin, et al., 2021].
zh_hans: 带修剪均值的联邦平均法[Dong Yin 等，2021]。

source: Paper: https://arxiv.org/abs/1803.01498
zh_hans: 论文：https://arxiv.org/abs/1803.01498

source: Fraction to cut off of both tails of the distribution. Defaults to 0.2.
zh_hans: 截取分布两个尾部的分数。默认为 0.2。

source: Aggregate fit results using trimmed average.
zh_hans: 使用修剪平均值汇总拟合结果。

source: Configurable Krum strategy implementation.
zh_hans: 可配置的 Krum 策略实施。

source: Krum strategy.
zh_hans: Krum 策略。

source: Number of malicious clients in the system. Defaults to 0.
zh_hans: 系统中恶意客户端的数量。默认为 0。

source: Number of clients to keep before averaging (MultiKrum). Defaults to 0, in that case classical Krum is applied.
zh_hans: 求平均值前保留的客户端数量（MultiKrum）。默认值为 0，在这种情况下会应用经典 Krum。

source: Aggregate fit results using Krum.
zh_hans: 使用 Krum 汇总拟合结果。

source: Bulyan strategy implementation.
zh_hans: Bulyan策略的实施。

source: Bulyan strategy.
zh_hans: Bulyan 策略。

source: Implementation based on https://arxiv.org/abs/1802.07927.
zh_hans: 实施基于 https://arxiv.org/abs/1802.07927。

source: Byzantine resilient aggregation rule that is used as the first step of the Bulyan (e.g., Krum)
zh_hans: Byzantine弹性聚合规则，用作 Bulyan 的第一步（如 Krum）

source: arguments to the first_aggregation rule
zh_hans: 第一聚类规则的参数

source: Aggregate fit results using Bulyan.
zh_hans: 使用 Bulyan 技术汇总拟合结果。

source: Configurable FedXgbNnAvg strategy implementation.
zh_hans: 可配置的 FedXgbNAvg 策略实施。

source: Federated XGBoost [Ma et al., 2023] strategy.
zh_hans: Federated XGBoost [Ma 等人，2023] 策略。

source: Implementation based on https://arxiv.org/abs/2304.07537.
zh_hans: 实施基于 https://arxiv.org/abs/2304.07537。

source: Wrapper for configuring a Strategy for DP with Adaptive Clipping.
zh_hans: 用于配置具有自适应剪切功能的 DP 策略的包装器。

source: Aggregate training results as in DPFedAvgFixed and update clip norms.
zh_hans: 汇总 DPFedAvgFixed 中的训练结果并更新片段标准。

source: Wrapper for configuring a Strategy for DP with Fixed Clipping.
zh_hans: 封装器，用于为具有固定剪切功能的 DP 配置策略。

source: Aggregate evaluation losses using the given strategy.
zh_hans: 使用给定的策略汇总评估损失。

source: Aggregate training results using unweighted aggregation.
zh_hans: 使用非加权汇总法汇总训练结果。

source: Configure the next round of evaluation using the specified strategy.
zh_hans: 使用指定策略配置下一轮评估。

source: Configure the next round of training incorporating Differential Privacy (DP).
zh_hans: 配置包含差分隐私 (DP) 的下一轮训练。

source: Configuration of the next training round includes information related to DP, such as clip norm and noise stddev.
zh_hans: 下一轮训练的配置包括与 DP 相关的信息，如片段规范和噪声 stddev。

source: Evaluate model parameters using an evaluation function from the strategy.
zh_hans: 使用策略中的评估函数评估模型参数。

source: Initialize global model parameters using given strategy.
zh_hans: 使用给定的策略初始化全局模型参数。

source: common
fr: commun
zh_hans: 常见

source: Common components shared between server and client.
fr: Composants communs partagés entre le serveur et le client.
zh_hans: 服务器和客户端共享的通用组件。

source: ClientMessage is a container used to hold one result message.
fr: ClientMessage est un conteneur utilisé pour contenir un message de résultat.
zh_hans: ClientMessage 是用于容纳一条结果信息的容器。

source: Client status codes.
fr: Codes d'état du client.
zh_hans: 客户端状态代码。

source: DisconnectRes message from client to server.
fr: Message DisconnectRes envoyé par le client au serveur.
zh_hans: 客户端向服务器发送 DisconnectRes 信息。

source: Evaluate instructions for a client.
fr: Évaluer les instructions pour un client.
zh_hans: 评估客户端的指示。

source: Evaluate response from a client.
fr: Évaluer la réponse d'un client.
zh_hans: 评估客户端的反应。

source: Types of telemetry events.
fr: Types d'événements télémétriques.
zh_hans: 遥测事件类型。

source: Fit instructions for a client.
fr: Instructions d'ajustement pour un client.
zh_hans: 为客户提供安装说明。

source: Fit response from a client.
fr: Réponse adaptée d'un client.
zh_hans: 来自客户端的合适回复。

source: Parameters request for a client.
fr: Demande de paramètres pour un client.
zh_hans: 客户端的参数请求。

source: Response when asked to return parameters.
fr: Réponse lorsqu'on te demande de renvoyer des paramètres.
zh_hans: 要求返回参数时的响应。

source: Properties request for a client.
fr: Demande de propriétés pour un client.
zh_hans: 客户端的属性请求。

source: Properties response from a client.
fr: Réponse des propriétés d'un client.
zh_hans: 来自客户端的属性响应。

source: Model parameters.
fr: Paramètres du modèle.
zh_hans: 模型参数。

source: ReconnectIns message from server to client.
fr: Message de reconnexion du serveur au client.
zh_hans: 服务器发送给客户端的重新连接信息。

source: ServerMessage is a container used to hold one instruction message.
fr: ServerMessage est un conteneur utilisé pour contenir un message d'instruction.
zh_hans: ServerMessage 是用于容纳一条指令信息的容器。

source: Client status.
fr: Statut du client.
zh_hans: 客户端状态。

source: Deserialize NumPy ndarray from bytes.
fr: Désérialise le tableau numérique NumPy à partir d'octets.
zh_hans: 从字节反序列化 NumPy ndarray。

source: Configure logging to file and/or remote log server.
fr: Configure la journalisation vers un fichier et/ou un serveur de journalisation distant.
zh_hans: 配置将日志记录到文件和/或远程日志服务器。

source: Log 'msg % args' with the integer severity 'level'.
fr: Enregistre 'msg % args' avec le niveau de sévérité entier 'level'.
zh_hans: 以整数严重性 "级别 "记录 "msg % args"。

source: To pass exception information, use the keyword argument exc_info with a true value, e.g.
fr: Pour transmettre des informations sur les exceptions, utilise l'argument mot-clé exc_info avec une valeur vraie, par ex.
zh_hans: 要传递异常信息，请使用带 true 值的关键字参数 exc_info，例如。

source: Serialize NumPy ndarray to bytes.
fr: Sérialise le tableau numérique NumPy en octets.
zh_hans: 将 NumPy ndarray 序列化为字节。

source: Convert NumPy ndarrays to parameters object.
fr: Convertit les ndarrays NumPy en objets de paramètres.
zh_hans: 将 NumPy ndarrays 转换为参数对象。

source: Construct a datetime from time.time() with time zone set to UTC.
fr: Construit une date à partir de time.time() avec le fuseau horaire réglé sur UTC.
zh_hans: 从 time.time() 生成日期时间，时区设置为 UTC。

source: Convert parameters object to NumPy ndarrays.
fr: Convertit l'objet des paramètres en ndarrays NumPy.
zh_hans: 将参数对象转换为 NumPy ndarrays。

source: Changelog
zh_hans: 更新日志

source: Unreleased
zh_hans: 尚未发布

source: What's new?
fr: Quoi de neuf ?
zh_hans: 有什么新内容？

source: **Add experimental support for Python 3.12** ([#2565](https://github.com/adap/flower/pull/2565))
zh_hans: ** 增加对 Python 3.12 的实验支持** ([#2565](https://github.com/adap/flower/pull/2565))

source: **Support custom** `ClientManager` **in** `start_driver()` ([#2292](https://github.com/adap/flower/pull/2292))
zh_hans: **在***`start_driver()`中支持自定义***`ClientManager([#2292](https://github.com/adap/flower/pull/2292))

source: **Update REST API to support create and delete nodes** ([#2283](https://github.com/adap/flower/pull/2283))
zh_hans: **更新 REST API 以支持创建和删除节点** ([#2283](https://github.com/adap/flower/pull/2283))

source: **Update the C++ SDK** ([#2537](https://github/com/adap/flower/pull/2537), [#2528](https://github/com/adap/flower/pull/2528), [#2523](https://github.com/adap/flower/pull/2523), [#2522](https://github.com/adap/flower/pull/2522))
zh_hans: ** 更新 C++ SDK** ([#2537](https://github/com/adap/flower/pull/2537), [#2528](https://github/com/adap/flower/pull/2528), [#2523](https://github.com/adap/flower/pull/2523), [#2522](https://github.com/adap/flower/pull/2522))

source: Add gRPC request-response capability to the C++ SDK.
zh_hans: 为 C++ SDK 添加 gRPC 请求-响应功能。

source: **Fix the incorrect return types of Strategy** ([#2432](https://github.com/adap/flower/pull/2432/files))
zh_hans: **修复策略的错误返回类型** ([#2432](https://github.com/adap/flower/pull/2432/files))

source: The types of the return values in the docstrings in two methods (`aggregate_fit` and `aggregate_evaluate`) now match the hint types in the code.
zh_hans: 两个方法（"aggregate_fit "和 "aggregate_evaluate"）的文档说明中的返回值类型现在与代码中的提示类型一致。

source: **Unify client API** ([#2303](https://github.com/adap/flower/pull/2303), [#2390](https://github.com/adap/flower/pull/2390), [#2493](https://github.com/adap/flower/pull/2493))
zh_hans: ** 统一客户端应用程序接口** ([#2303](https://github.com/adap/flower/pull/2303), [#2390](https://github.com/adap/flower/pull/2390), [#2493](https://github.com/adap/flower/pull/2493))

source: Using the `client_fn`, Flower clients can interchangeably run as standalone processes (i.e. via `start_client`) or in simulation (i.e. via `start_simulation`) without requiring changes to how the client class is defined and instantiated. Calling `start_numpy_client` is now deprecated.
zh_hans: 使用 `client_fn`，Flower 客户端可以作为独立进程（即通过 `start_client`）或在模拟中（即通过 `start_simulation`）交替运行，而无需更改客户端类的定义和实例化方式。调用 `start_numpy_client` 现已过时。

source: **Update Flower Baselines**
zh_hans: **更新 Flower Baselines**

source: Baselines Docs ([#2290](https://github.com/adap/flower/pull/2290), [#2400](https://github.com/adap/flower/pull/2400))
zh_hans: Baselines文档（[#2290](https://github.com/adap/flower/pull/2290), [#2400](https://github.com/adap/flower/pull/2400)

source: **Update Flower Examples** ([#2384](https://github.com/adap/flower/pull/2384),[#2425](https://github.com/adap/flower/pull/2425), [#2526](https://github.com/adap/flower/pull/2526))
zh_hans: ** 更新 Flower Examples** ([#2384](https://github.com/adap/flower/pull/2384),[#2425](https://github.com/adap/flower/pull/2425), [#2526](https://github.com/adap/flower/pull/2526))

source: **General updates to baselines** ([#2301](https://github.com/adap/flower/pull/2301), [#2305](https://github.com/adap/flower/pull/2305), [#2307](https://github.com/adap/flower/pull/2307), [#2327](https://github.com/adap/flower/pull/2327), [#2435](https://github.com/adap/flower/pull/2435))
zh_hans: ** baselines的普通更新** ([#2301](https://github.com/adap/flower/pull/2301), [#2305](https://github.com/adap/flower/pull/2305), [#2307](https://github.com/adap/flower/pull/2307), [#2327](https://github.com/adap/flower/pull/2327), [#2435](https://github.com/adap/flower/pull/2435))

source: **General updates to the simulation engine** ([#2331](https://github.com/adap/flower/pull/2331), [#2447](https://github.com/adap/flower/pull/2447), [#2448](https://github.com/adap/flower/pull/2448))
zh_hans: **模拟引擎的普通更新** ([#2331](https://github.com/adap/flower/pull/2331), [#2447](https://github.com/adap/flower/pull/2447), [#2448](https://github.com/adap/flower/pull/2448))
