Repository: lucacorbucci/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: fr, zh_hans

source: The full source code for this example: `MXNet: From Centralized To Federated (Code) <https://github.com/adap/flower/blob/main/examples/mxnet-from-centralized-to-federated>`_. Our example is of course somewhat over-simplified because both clients load the exact same dataset, which isn't realistic. You're now prepared to explore this topic further. How about using a CNN or using a different dataset? How about adding more clients?
zh_hans: 此示例的完整源代码在："MXNet： From Centralized To Federated (Code) <https://github.com/adap/flower/blob/main/examples/mxnet-from-centralized-to-federated>`_。当然，我们的示例有些过于简单，因为两个客户端都加载了完全相同的数据集，这并不真实。现在您已经准备好进一步探讨了。使用 CNN 或使用不同的数据集会如何？添加更多客户端会如何？

source: Example: PyTorch - From Centralized To Federated
fr: Exemple : PyTorch - De la centralisation à la fédération
zh_hans: 实例： PyTorch - 从集中式到联邦式

source: This tutorial will show you how to use Flower to build a federated version of an existing machine learning workload. We are using PyTorch to train a Convolutional Neural Network on the CIFAR-10 dataset. First, we introduce this machine learning task with a centralized training approach based on the `Deep Learning with PyTorch <https://pytorch.org/tutorials/beginner/blitz/cifar10_tutorial.html>`_ tutorial. Then, we build upon the centralized training code to run the training in a federated fashion.
fr: Ce tutoriel te montrera comment utiliser Flower pour construire une version fédérée d'une charge de travail d'apprentissage automatique existante. Nous utilisons PyTorch pour entraîner un réseau neuronal convolutif sur l'ensemble de données CIFAR-10. Tout d'abord, nous présentons cette tâche d'apprentissage automatique avec une approche d'entraînement centralisée basée sur le tutoriel `Deep Learning with PyTorch <https://pytorch.org/tutorials/beginner/blitz/cifar10_tutorial.html>`_. Ensuite, nous nous appuyons sur le code d'entraînement centralisé pour exécuter l'entraînement de manière fédérée.
zh_hans: 本教程将向您展示如何使用 Flower 构建现有机器学习工作的联邦版本。我们使用 PyTorch 在 CIFAR-10 数据集上训练一个卷积神经网络。首先，我们基于 "Deep Learning with PyTorch <https://pytorch.org/tutorials/beginner/blitz/cifar10_tutorial.html>`_"教程，采用集中式训练方法介绍了这项机器学习任务。然后，我们在集中式训练代码的基础上以联邦方式运行训练。

source: We begin with a brief description of the centralized CNN training code. If you want a more in-depth explanation of what's going on then have a look at the official `PyTorch tutorial <https://pytorch.org/tutorials/beginner/blitz/cifar10_tutorial.html>`_.
fr: Nous commençons par une brève description du code d'entraînement CNN centralisé. Si tu veux une explication plus approfondie de ce qui se passe, jette un coup d'œil au tutoriel officiel `PyTorch <https://pytorch.org/tutorials/beginner/blitz/cifar10_tutorial.html>`_.
zh_hans: 我们首先简要介绍一下集中式 CNN 训练代码。如果您想获得更深入的解释，请参阅 PyTorch 官方教程`PyTorch tutorial <https://pytorch.org/tutorials/beginner/blitz/cifar10_tutorial.html>`_。

source: Let's create a new file called :code:`cifar.py` with all the components required for a traditional (centralized) training on CIFAR-10. First, all required packages (such as :code:`torch` and :code:`torchvision`) need to be imported. You can see that we do not import any package for federated learning. You can keep all these imports as they are even when we add the federated learning components at a later point.
fr: Créons un nouveau fichier appelé :code:`cifar.py` avec tous les composants requis pour une formation traditionnelle (centralisée) sur le CIFAR-10. Tout d'abord, tous les paquets requis (tels que :code:`torch` et :code:`torchvision`) doivent être importés. Tu peux voir que nous n'importons aucun paquet pour l'apprentissage fédéré. Tu peux conserver toutes ces importations telles quelles même lorsque nous ajouterons les composants d'apprentissage fédéré à un moment ultérieur.
zh_hans: 让我们创建一个名为 :code:`cifar.py` 的新文件，其中包含 CIFAR-10 传统（集中）培训所需的所有组件。首先，需要导入所有必需的软件包（如 :code:`torch` 和 :code:`torchvision`）。您可以看到，我们没有导入任何用于联邦学习的软件包。即使在以后添加联邦学习组件时，也可以保留所有这些导入。

source: As already mentioned we will use the CIFAR-10 dataset for this machine learning workload. The model architecture (a very simple Convolutional Neural Network) is defined in :code:`class Net()`.
fr: Comme nous l'avons déjà mentionné, nous utiliserons l'ensemble de données CIFAR-10 pour cette charge de travail d'apprentissage automatique. L'architecture du modèle (un réseau neuronal convolutif très simple) est définie dans :code:`class Net()`.
zh_hans: 如前所述，我们将使用 CIFAR-10 数据集进行机器学习。模型架构（一个非常简单的卷积神经网络）在 :code:`class Net()` 中定义。

source: The :code:`load_data()` function loads the CIFAR-10 training and test sets. The :code:`transform` normalized the data after loading.
fr: La fonction :code:`load_data()` charge les ensembles d'entraînement et de test CIFAR-10. La fonction :code:`transform` normalise les données après leur chargement.
zh_hans: :code:`load_data()` 函数加载 CIFAR-10 训练集和测试集。加载数据后，:code:`transform`函数对数据进行了归一化处理。

source: We now need to define the training (function :code:`train()`) which loops over the training set, measures the loss, backpropagates it, and then takes one optimizer step for each batch of training examples.
fr: Nous devons maintenant définir la formation (fonction :code:`train()`) qui passe en boucle sur l'ensemble de la formation, mesure la perte, la rétropropage, puis effectue une étape d'optimisation pour chaque lot d'exemples de formation.
zh_hans: 现在，我们需要定义训练函数（:code:`train()`），该函数在训练集上循环训练，计算损失值并反向传播，然后为每批训练数据在优化器上执行一个优化步骤。

source: The evaluation of the model is defined in the function :code:`test()`. The function loops over all test samples and measures the loss of the model based on the test dataset.
fr: L'évaluation du modèle est définie dans la fonction :code:`test()`. La fonction boucle sur tous les échantillons de test et mesure la perte du modèle en fonction de l'ensemble des données de test.
zh_hans: 模型的评估在函数 :code:`test()` 中定义。该函数循环遍历所有测试样本，并计算测试数据集的模型损失值。

source: Having defined the data loading, model architecture, training, and evaluation we can put everything together and train our CNN on CIFAR-10.
fr: Après avoir défini le chargement des données, l'architecture du modèle, la formation et l'évaluation, nous pouvons tout mettre ensemble et former notre CNN sur CIFAR-10.
zh_hans: 在确定了数据加载、模型架构、训练和评估之后，我们就可以将所有整合在一起，在 CIFAR-10 上训练我们的 CNN。

source: So far, this should all look fairly familiar if you've used PyTorch before. Let's take the next step and use what we've built to create a simple federated learning system consisting of one server and two clients.
fr: Jusqu'à présent, tout cela devrait te sembler assez familier si tu as déjà utilisé PyTorch. Passons à l'étape suivante et utilisons ce que nous avons construit pour créer un simple système d'apprentissage fédéré composé d'un serveur et de deux clients.
zh_hans: 到目前为止，如果你以前用过 PyTorch，这一切看起来应该相当熟悉。让我们进行下一步，利用我们所构建的内容创建一个简单联邦学习系统（由一个服务器和两个客户端组成）。

source: The simple machine learning project discussed in the previous section trains the model on a single dataset (CIFAR-10), we call this centralized learning. This concept of centralized learning, as shown in the previous section, is probably known to most of you, and many of you have used it previously. Normally, if you'd want to run machine learning workloads in a federated fashion, then you'd have to change most of your code and set everything up from scratch. This can be a considerable effort.
fr: Le projet simple d'apprentissage automatique discuté dans la section précédente entraîne le modèle sur un seul ensemble de données (CIFAR-10), nous appelons cela l'apprentissage centralisé. Ce concept d'apprentissage centralisé, comme le montre la section précédente, est probablement connu de la plupart d'entre vous, et beaucoup d'entre vous l'ont déjà utilisé. Normalement, si tu veux exécuter des charges de travail d'apprentissage automatique de manière fédérée, tu dois alors changer la plupart de ton code et tout mettre en place à partir de zéro, ce qui peut représenter un effort considérable.
zh_hans: 上一节讨论的简单机器学习项目在单一数据集（CIFAR-10）上训练模型，我们称之为集中学习。如上一节所示，集中学习的概念可能为大多数人所熟知，而且很多人以前都使用过。通常情况下，如果要以联邦方式运行机器学习工作，就必须更改大部分代码，并从头开始设置一切。这可能是一个相当大的工作量。

source: However, with Flower you can evolve your pre-existing code into a federated learning setup without the need for a major rewrite.
fr: Cependant, avec Flower, tu peux faire évoluer ton code préexistant vers une configuration d'apprentissage fédéré sans avoir besoin d'une réécriture majeure.
zh_hans: 不过，有了 Flower，您可以轻松地将已有的代码转变成联邦学习的模式，无需进行大量重写。

source: The concept is easy to understand. We have to start a *server* and then use the code in :code:`cifar.py` for the *clients* that are connected to the *server*. The *server* sends model parameters to the clients. The *clients* run the training and update the paramters. The updated parameters are sent back to the *server* which averages all received parameter updates. This describes one round of the federated learning process and we repeat this for multiple rounds.
fr: Le concept est facile à comprendre. Nous devons démarrer un *serveur* et utiliser le code dans :code:`cifar.py` pour les *clients* qui sont connectés au *serveur*. Le *serveur* envoie les paramètres du modèle aux clients. Les *clients* exécutent la formation et mettent à jour les paramètres. Les paramètres mis à jour sont renvoyés au *serveur* qui fait la moyenne de toutes les mises à jour de paramètres reçues. Ceci décrit un tour du processus d'apprentissage fédéré et nous répétons cette opération pour plusieurs tours.
zh_hans: 这个概念很容易理解。我们必须启动一个*服务器*，然后对连接到*服务器*的*客户端*使用 :code:`cifar.py`中的代码。*服务器*向客户端发送模型参数，*客户端*运行训练并更新参数。更新后的参数被发回*服务器*，然后会对所有收到的参数更新进行平均聚合。以上描述的是一轮联邦学习过程，我们将重复进行多轮学习。

source: Finally, we will define our *client* logic in :code:`client.py` and build upon the previously defined centralized training in :code:`cifar.py`. Our *client* needs to import :code:`flwr`, but also :code:`torch` to update the paramters on our PyTorch model:
fr: Enfin, nous allons définir notre logique *client* dans :code:`client.py` et nous appuyer sur la formation centralisée définie précédemment dans :code:`cifar.py`. Notre *client* doit importer :code:`flwr`, mais aussi :code:`torch` pour mettre à jour les paramètres de notre modèle PyTorch :
zh_hans: 最后，我们将在 :code:`client.py` 中定义我们的 *client* 逻辑，并以之前在 :code:`cifar.py` 中定义的集中式训练为基础。我们的 *client* 不仅需要导入 :code:`flwr`，还需要导入 :code:`torch`，以更新 PyTorch 模型的参数：

source: Implementing a Flower *client* basically means implementing a subclass of either :code:`flwr.client.Client` or :code:`flwr.client.NumPyClient`. Our implementation will be based on :code:`flwr.client.NumPyClient` and we'll call it :code:`CifarClient`. :code:`NumPyClient` is slighly easier to implement than :code:`Client` if you use a framework with good NumPy interoperability (like PyTorch or TensorFlow/Keras) because it avoids some of the boilerplate that would otherwise be necessary. :code:`CifarClient` needs to implement four methods, two methods for getting/setting model parameters, one method for training the model, and one method for testing the model:
zh_hans: 实现 Flower *client*基本上意味着实现 :code:`flwr.client.Client` 或 :code:`flwr.client.NumPyClient` 的子类。我们的代码实现将基于 :code:`flwr.client.NumPyClient`，并将其命名为 :code:`CifarClient`。如果使用具有良好 NumPy 互操作性的框架（如 PyTorch 或 TensorFlow/Keras），:code:`NumPyClient`的实现比 :code:`Client`略微容易一些，因为它避免了一些不必要的操作。:code:`CifarClient` 需要实现四个方法，两个用于获取/设置模型参数，一个用于训练模型，一个用于测试模型：

source: The two :code:`NumPyClient` methods :code:`fit` and :code:`evaluate` make use of the functions :code:`train()` and :code:`test()` previously defined in :code:`cifar.py`. So what we really do here is we tell Flower through our :code:`NumPyClient` subclass which of our already defined functions to call for training and evaluation. We included type annotations to give you a better understanding of the data types that get passed around.
fr: Les deux méthodes :code:`NumPyClient` :code:`fit` et :code:`evaluate` utilisent les fonctions :code:`train()` et :code:`test()` définies précédemment dans :code:`cifar.py`. Ce que nous faisons vraiment ici, c'est que nous indiquons à Flower, par le biais de notre sous-classe :code:`NumPyClient`, laquelle de nos fonctions déjà définies doit être appelée pour l'entraînement et l'évaluation. Nous avons inclus des annotations de type pour te donner une meilleure compréhension des types de données qui sont transmis.
zh_hans: 这两个 :code:`NumPyClient` 中的方法 :code:`fit` 和 :code:`evaluate` 使用了之前在 :code:`cifar.py` 中定义的函数 :code:`train()` 和 :code:`test()`。因此，我们在这里要做的就是通过 :code:`NumPyClient` 子类告知 Flower 在训练和评估时要调用哪些已定义的函数。我们加入了类型注解，以便让你更好地理解传递的数据类型。

source: All that's left to do it to define a function that loads both model and data, creates a :code:`CifarClient`, and starts this client. You load your data and model by using :code:`cifar.py`. Start :code:`CifarClient` with the function :code:`fl.client.start_client()` by pointing it at the same IP adress we used in :code:`server.py`:
fr: Il ne reste plus qu'à définir une fonction qui charge le modèle et les données, crée un :code:`CifarClient` et démarre ce client. Tu charges tes données et ton modèle en utilisant :code:`cifar.py`. Démarre :code:`CifarClient` avec la fonction :code:`fl.client.start_client()` en la faisant pointer sur la même adresse IP que celle que nous avons utilisée dans :code:`server.py` :
zh_hans: 剩下的就是定义模型和数据加载函数了。创建一个:code:`CifarClient`类，并运行这个客服端。您将通过:code:`cifar.py`加载数据和模型。另外，通过:code:`fl.client.start_client()`函数来运行客户端:code:`CifarClient`，需要保证IP地址和:code:`server.py`中所使用的一致：

source: in each window (make sure that the server is running before you do so) and see your (previously centralized) PyTorch project run federated learning across two clients. Congratulations!
fr: dans chaque fenêtre (assure-toi que le serveur fonctionne avant de le faire) et tu verras ton projet PyTorch (auparavant centralisé) exécuter l'apprentissage fédéré sur deux clients. Félicitations !
zh_hans: 确保服务器正在运行后，您就能看到您的 PyTorch 项目（之前是集中式的）在两个客户端上运行联邦学习了。祝贺！

source: The full source code for this example: `PyTorch: From Centralized To Federated (Code) <https://github.com/adap/flower/blob/main/examples/pytorch-from-centralized-to-federated>`_. Our example is, of course, somewhat over-simplified because both clients load the exact same dataset, which isn't realistic. You're now prepared to explore this topic further. How about using different subsets of CIFAR-10 on each client? How about adding more clients?
zh_hans: 本示例的完整源代码为：`PyTorch： 从集中式到联合式 <https://github.com/adap/flower/blob/main/examples/pytorch-from-centralized-to-federated>`_。当然，我们的示例有些过于简单，因为两个客户端都加载了完全相同的数据集，这并不真实。现在，您已经准备好进一步探讨这一主题了。比如在每个客户端使用不同的 CIFAR-10 子集会如何？增加更多客户端会如何？

source: Example: Walk-Through PyTorch & MNIST
fr: Exemple : PyTorch et MNIST
zh_hans: 实例： PyTorch 和 MNIST 的演练

source: In this tutorial we will learn, how to train a Convolutional Neural Network on MNIST using Flower and PyTorch.
fr: Dans ce tutoriel, nous allons apprendre, comment former un réseau neuronal convolutif sur MNIST en utilisant Flower et PyTorch.
zh_hans: 在本教程中，我们将学习如何使用 Flower 和 PyTorch 在 MNIST 上训练卷积神经网络。

source: Our example consists of one *server* and two *clients* all having the same model.
fr: Notre exemple consiste en un *serveur* et deux *clients* ayant tous le même modèle.
zh_hans: 我们的例子包括一个*服务器*和两个*客户端*，它们都有相同的模型。

source: *Clients* are responsible for generating individual weight-updates for the model based on their local datasets. These updates are then sent to the *server* which will aggregate them to produce a better model. Finally, the *server* sends this improved version of the model back to each *client*. A complete cycle of weight updates is called a *round*.
fr: *Les clients* sont chargés de générer des mises à jour de poids individuelles pour le modèle en fonction de leurs ensembles de données locales. Ces mises à jour sont ensuite envoyées au *serveur* qui les agrège pour produire un meilleur modèle. Enfin, le *serveur* renvoie cette version améliorée du modèle à chaque *client*. Un cycle complet de mises à jour de poids s'appelle un *round*.
zh_hans: *客户端*负责在其本地数据集上更新模型参数。然后，这些参数会被发送到*服务器*，由*服务器*聚合后生成一个更好的模型。最后，*服务器*将改进后的模型发送回每个*客户端*。一个完整的模型参数更新周期称为一*轮*。

source: Now that we have a rough idea of what is going on, let's get started. We first need to install Flower. You can do this by running :
fr: Maintenant que nous avons une idée générale de ce qui se passe, commençons. Nous devons d'abord installer Flower. Tu peux le faire en exécutant :
zh_hans: 现在，我们已经有了一个大致的概念了，那就让我们开始吧。首先，我们需要安装 Flower。可以通过运行 ：

source: Since we want to use PyTorch to solve a computer vision task, let's go ahead an install PyTorch and the **torchvision** library:
fr: Puisque nous voulons utiliser PyTorch pour résoudre une tâche de vision par ordinateur, installons PyTorch et la bibliothèque **torchvision** :
zh_hans: 我们想用 PyTorch 来做计算机视觉任务，需要先安装 PyTorch 和 **torchvision** 库：

source: Ready... Set... Train!
fr: Prêts... prêts... entraînez-vous !
zh_hans: 准备...设置...训练!

source: Now that we have all our dependencies installed, let's run a simple distributed training with two clients and one server. Our training procedure and network architecture are based on PyTorch's `Basic MNIST Example <https://github.com/pytorch/examples/tree/master/mnist>`_. This will allow you see how easy it is to wrap your code with Flower and begin training in a federated way. We provide you with two helper scripts, namely *run-server.sh*, and *run-clients.sh*. Don't be afraid to look inside, they are simple enough =).
fr: Maintenant que nous avons installé toutes nos dépendances, lançons un simple entraînement distribué avec deux clients et un serveur. Notre procédure d'entraînement et l'architecture de notre réseau sont basées sur l'exemple MNIST de base de PyTorch <https://github.com/pytorch/examples/tree/master/mnist>`_. Cela te permettra de voir à quel point il est facile d'envelopper ton code avec Flower et de commencer l'entraînement de manière fédérée. Nous te fournissons deux scripts d'aide, à savoir *run-server.sh*, et *run-clients.sh*. N'aie pas peur de regarder à l'intérieur, ils sont assez simples =).
zh_hans: 现在我们已经安装了所有的依赖包，让我们用两个客户端和一个服务器来运行一个简单的分布式训练。我们的训练过程和网络架构基于 PyTorch 的 `Basic MNIST Example <https://github.com/pytorch/examples/tree/master/mnist>`_。您会发现用 Flower 来封装您的代码并进行联邦学习训练是多么容易。我们为您提供了两个辅助脚本，即 *run-server.sh* 和 *run-clients.sh*。别害怕，它们很简单 =)。

source: Go ahead and launch on a terminal the *run-server.sh* script first as follows:
fr: Lance sur un terminal le script *run-server.sh* d'abord comme suit :
zh_hans: 首先在终端上启动 *run-server.sh* 脚本，如下所示：

source: Now that the server is up and running, go ahead and launch the clients.
fr: Maintenant que le serveur est opérationnel, vas-y et lance les clients.
zh_hans: 现在服务器已经启动并运行，请继续启动客户端。

source: Et voilà! You should be seeing the training procedure and, after a few iterations, the test accuracy for each client.
fr: Et voilà ! Tu devrais voir la procédure d'entraînement et, après quelques itérations, la précision du test pour chaque client.
zh_hans: 然后就可以了！您应该能看到训练过程，以及经过几次反复后，每个客户端的测试准确率。

source: Now, let's see what is really happening inside.
fr: Maintenant, voyons ce qui se passe réellement à l'intérieur.
zh_hans: 现在，让我们看看里面到底发生了什么。

source: Flower Server
fr: Serveur de Flower
zh_hans: Flower 服务器

source: Inside the server helper script *run-server.sh* you will find the following code that basically runs the :code:`server.py`
fr: Dans le script d'aide au serveur *run-server.sh*, tu trouveras le code suivant qui exécute le fichier :code:`server.py`
zh_hans: 在服务器辅助脚本 *run-server.sh* 中，你可以找到以下代码，这些代码基本上都是运行 :code:`server.py` 的代码

source: We can go a bit deeper and see that :code:`server.py` simply launches a server that will coordinate three rounds of training. Flower Servers are very customizable, but for simple workloads, we can start a server using the :ref:`start_server <flwr-server-start_server-apiref>` function and leave all the configuration possibilities at their default values, as seen below.
fr: Nous pouvons aller un peu plus loin et voir que :code:`server.py` lance simplement un serveur qui coordonnera trois tours de formation. Flower Les serveurs sont très personnalisables, mais pour les charges de travail simples, nous pouvons démarrer un serveur à l'aide de la fonction :ref:`start_server <flwr-server-start_server-apiref>` et laisser toutes les possibilités de configuration à leurs valeurs par défaut, comme on peut le voir ci-dessous.
zh_hans: 我们可以再深入一点，:code:`server.py` 只是启动了一个服务器，该服务器将协调三轮训练。Flower 服务器是非常容易修改的，但对于简单的工作，我们可以使用 :ref:`start_server <flwr-server-start_server-apiref>`函数启动服务器，并将所有可能的配置保留为默认值，如下所示。

source: Flower Client
fr: Client de la fleur
zh_hans: Flower 客户端

source: Next, let's take a look at the *run-clients.sh* file. You will see that it contains the main loop that starts a set of *clients*.
fr: Ensuite, jetons un coup d'œil au fichier *run-clients.sh*. Tu verras qu'il contient la boucle principale qui démarre un ensemble de *clients*.
zh_hans: 接下来，让我们看看 *run-clients.sh* 文件。您会看到它包含了用来启动多个 *客户端* 的代码。

source: **cid**: is the client ID. It is an integer that uniquely identifies client identifier.
fr: **cid** : c'est l'identifiant du client. C'est un nombre entier qui identifie de façon unique l'identifiant du client.
zh_hans: **cid**：是客户 ID。它是一个整数，可唯一标识客户标识符。

source: **sever_address**: String that identifies IP and port of the server.
fr: **sever_address** : Chaîne qui identifie l'IP et le port du serveur.
zh_hans: **sever_address**： 标识服务器 IP 和端口的字符串。

source: **nb_clients**: This defines the number of clients being created. This piece of information is not required by the client, but it helps us partition the original MNIST dataset to make sure that every client is working on unique subsets of both *training* and *test* sets.
fr: **Cette information n'est pas requise par le client, mais elle nous aide à partitionner l'ensemble de données MNIST original pour nous assurer que chaque client travaille sur des sous-ensembles uniques des ensembles *formation* et *test*.
zh_hans: **nb_clients**： 这定义了正在创建的客户端数量。客户端并不需要这一信息，但它有助于我们对原始 MNIST 数据集进行划分，以确保每个客户端都在 *training* 和 *test* 数据集上有独立的数据。

source: Again, we can go deeper and look inside :code:`flwr_example/quickstart-pytorch/client.py`. After going through the argument parsing code at the beginning of our :code:`main` function, you will find a call to :code:`mnist.load_data`. This function is responsible for partitioning the original MNIST datasets (*training* and *test*) and returning a :code:`torch.utils.data.DataLoader` s for each of them. We then instantiate a :code:`PytorchMNISTClient` object with our client ID, our DataLoaders, the number of epochs in each round, and which device we want to use for training (CPU or GPU).
zh_hans: 我们可以深入看一下 :code:`flwr_example/quickstart-pytorch/client.py`。查看 :code:`main` 函数开头的参数解析代码后，你会发现一个对 :code:`mnist.load_data` 的调用。该函数负责分割原始 MNIST 数据集（*training* 和 *test*），并为每个数据集返回一个 :code:`torch.utils.data.DataLoader` 。然后，我们实例化一个 :code:`PytorchMNISTClient` 对象，其中包含我们的客户端 ID、 DataLoader、每一轮中的遍历数，以及我们希望用于训练的设备（CPU 或 GPU）。

source: The :code:`PytorchMNISTClient` object when finally passed to :code:`fl.client.start_client` along with the server's address as the training process begins.
fr: L'objet :code:`PytorchMNISTClient` est finalement transmis à :code:`fl.client.start_client` avec l'adresse du serveur lorsque le processus de formation commence.
zh_hans: 当训练过程开始时，:code:`PytorchMNISTClient` 对象会连同服务器地址一起传递给 :code:`fl.client.start_client`。

source: A Closer Look
fr: Regarder de plus près
zh_hans: 仔细看一下

source: Now, let's look closely into the :code:`PytorchMNISTClient` inside :code:`flwr_example.quickstart-pytorch.mnist` and see what it is doing:
zh_hans: 现在，让我们仔细研究一下 :code:`flwr_example.quickstart-pytorch.mnist` 中的 :code:`PytorchMNISTClient`，看看它在做什么：
