Repository: lucacorbucci/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: fr, zh_hans

source: **Regulations**: GDPR (Europe), CCPA (California), PIPEDA (Canada), LGPD (Brazil), PDPL (Argentina), KVKK (Turkey), POPI (South Africa), FSS (Russia), CDPR (China), PDPB (India), PIPA (Korea), APPI (Japan), PDP (Indonesia), PDPA (Singapore), APP (Australia), and other regulations protect sensitive data from being moved. In fact, those regulations sometimes even prevent single organizations from combining their own users' data for artificial intelligence training because those users live in different parts of the world, and their data is governed by different data protection regulations.
zh_hans: **法规**： GDPR（欧洲）、CCPA（加利福尼亚）、PIPEDA（加拿大）、LGPD（巴西）、PDPL（阿根廷）、KVKK（土耳其）、POPI（南非）、FSS（俄罗斯）、CDPR（中国）、PDPB（印度）、PIPA（韩国）、APPI（日本）、PDP（印度尼西亚）、PDPA（新加坡）、APP（澳大利亚）等法规保护敏感数据不被移动。事实上，这些法规有时甚至会阻止单个组织将自己的用户数据用于人工智能培训，因为这些用户生活在世界不同地区，他们的数据受不同的数据保护法规管辖。

source: **User preference**: In addition to regulation, there are use cases where users just expect that no data leaves their device, ever. If you type your passwords and credit card info into the digital keyboard of your phone, you don't expect those passwords to end up on the server of the company that developed that keyboard, do you? In fact, that use case was the reason federated learning was invented in the first place.
fr: **Préférence de l'utilisateur** : En plus de la réglementation, il existe des cas d'utilisation où les utilisateurs s'attendent tout simplement à ce qu'aucune donnée ne quitte leur appareil, jamais. Si tu tapes tes mots de passe et tes informations de carte de crédit sur le clavier numérique de ton téléphone, tu ne t'attends pas à ce que ces mots de passe finissent sur le serveur de l'entreprise qui a développé ce clavier, n'est-ce pas ? En fait, ce cas d'utilisation est la raison pour laquelle l'apprentissage fédéré a été inventé en premier lieu.
zh_hans: **用户偏好**： 除了法规之外，在一些使用案例中，用户只是希望数据永远不会离开他们的设备。如果你在手机的数字键盘上输入密码和信用卡信息，你不会希望这些密码最终出现在开发该键盘的公司的服务器上吧？事实上，这种用例正是联邦学习发明的初衷。

source: **Data volume**: Some sensors, like cameras, produce such a high data volume that it is neither feasible nor economic to collect all the data (due to, for example, bandwidth or communication efficiency). Think about a national rail service with hundreds of train stations across the country. If each of these train stations is outfitted with a number of security cameras, the volume of raw on-device data they produce requires incredibly powerful and exceedingly expensive infrastructure to process and store. And most of the data isn't even useful.
zh_hans: **数据量**： 有些传感器（如摄像头）产生的数据量很大，收集所有数据既不可行，也不经济（例如，由于带宽或通信效率的原因）。试想一下全国铁路服务，全国有数百个火车站。如果每个火车站都安装了许多安全摄像头，那么它们所产生的大量原始设备数据就需要功能强大且极其昂贵的基础设施来处理和存储。而大部分数据甚至都是无用的。

source: Examples where centralized machine learning does not work include:
fr: Voici quelques exemples où l'apprentissage automatique centralisé ne fonctionne pas :
zh_hans: 集中式机器学习不起作用的例子包括：

source: Sensitive healthcare records from multiple hospitals to train cancer detection models
zh_hans: 用多家医院的敏感医疗记录训练癌症检测模型

source: Financial information from different organizations to detect financial fraud
fr: Informations financières provenant de différentes organisations pour détecter les fraudes financières
zh_hans: 不同组织的财务信息，以侦查财务欺诈行为

source: Location data from your electric car to make better range prediction
fr: Les données de localisation de ta voiture électrique pour mieux prédire l'autonomie
zh_hans: 通过电动汽车的定位数据更好地预测续航里程

source: End-to-end encrypted messages to train better auto-complete models
fr: Messages cryptés de bout en bout pour former de meilleurs modèles d'autocomplétion
zh_hans: 端到端加密信息可训练出更好的自动完成模型

source: The popularity of privacy-enhancing systems like the `Brave <https://brave.com/>`__ browser or the `Signal <https://signal.org/>`__ messenger shows that users care about privacy. In fact, they choose the privacy-enhancing version over other alternatives, if such an alernative exists. But what can we do to apply machine learning and data science to these cases to utilize private data? After all, these are all areas that would benefit significantly from recent advances in AI.
zh_hans: 像 `Brave <https://brave.com/>`__浏览器或 `Signal <https://signal.org/>`__信息管理器这样的隐私增强系统的流行表明，用户关心隐私。事实上，他们会选择隐私性更好的产品。但是，我们能做些什么来将机器学习和数据科学应用到这些情况中，以利用隐私数据呢？毕竟，这些领域都将从人工智能的最新进展中受益匪浅。

source: Federated learning
fr: Apprentissage fédéré
zh_hans: 联邦学习

source: Federated learning simply reverses this approach. It enables machine learning on distributed data by moving the training to the data, instead of moving the data to the training. Here's the single-sentence explanation:
fr: L'apprentissage fédéré inverse simplement cette approche. Il permet l'apprentissage automatique sur des données distribuées en déplaçant la formation vers les données, au lieu de déplacer les données vers la formation. Voici l'explication en une seule phrase :
zh_hans: 联邦学习简单地颠覆了这种方法。它通过将训练转移到数据上，而不是将数据转移到训练上，在分布式数据上实现机器学习。下面是一句话的解释：

source: Central machine learning: move the data to the computation
fr: Apprentissage automatique central : déplace les données vers le calcul
zh_hans: 集中式机器学习：将数据转移到计算中心

source: Federated (machine) learning: move the computation to the data
fr: Apprentissage (machine) fédéré : déplacer le calcul vers les données
zh_hans: 联邦式（机器）学习：将计算转移到数据上

source: By doing so, it enables us to use machine learning (and other data science approaches) in areas where it wasn't possible before. We can now train excellent medical AI models by enabling different hospitals to work together. We can solve financial fraud by training AI models on the data of different financial institutions. We can build novel privacy-enhancing applications (such as secure messaging) that have better built-in AI than their non-privacy-enhancing alternatives. And those are just a few of the examples that come to mind. As we deploy federated learning, we discover more and more areas that can suddenly be reinvented because they now have access to vast amounts of previously inaccessible data.
fr: Ce faisant, il nous permet d'utiliser l'apprentissage automatique (et d'autres approches de science des données) dans des domaines où cela n'était pas possible auparavant. Nous pouvons désormais former d'excellents modèles d'IA médicale en permettant à différents hôpitaux de travailler ensemble. Nous pouvons résoudre les fraudes financières en formant des modèles d'IA sur les données de différentes institutions financières. Nous pouvons créer de nouvelles applications d'amélioration de la confidentialité (telles que la messagerie sécurisée) qui ont une meilleure IA intégrée que leurs alternatives d'amélioration de la confidentialité. Et ce ne sont là que quelques exemples qui me viennent à l'esprit. Au fur et à mesure que nous déployons l'apprentissage fédéré, nous découvrons de plus en plus de domaines qui peuvent soudainement être réinventés parce qu'ils ont maintenant accès à de vastes quantités de données auparavant inaccessibles.
zh_hans: 这样，我们就能在以前不可能的领域使用机器学习（和其他数据科学方法）。现在，我们可以通过让不同的医院协同工作来训练优秀的医疗人工智能模型。我们可以通过在不同金融机构的数据上训练人工智能模型来解决金融欺诈问题。我们可以构建新颖的隐私增强型应用（如安全信息），其内置的人工智能比非隐私增强型应用更好。以上只是我想到的几个例子。随着联邦学习的部署，我们会发现越来越多的领域可以突然重获新生，因为它们现在可以访问大量以前无法访问的数据。

source: So how does federated learning work, exactly? Let's start with an intuitive explanation.
fr: Comment fonctionne l'apprentissage fédéré ? Commençons par une explication intuitive.
zh_hans: 那么，联邦学习究竟是如何运作的呢？让我们从直观的解释开始。

source: Federated learning in five steps
fr: L'apprentissage fédéré en cinq étapes
zh_hans: 联邦学习的五个步骤

source: Step 0: Initialize global model
fr: Étape 0 : Initialisation du modèle global
zh_hans: 步骤 0：初始化全局模型

source: We start by initializing the model on the server. This is exactly the same in classic centralized learning: we initialize the model parameters, either randomly or from a previously saved checkpoint.
fr: Nous commençons par initialiser le modèle sur le serveur. C'est exactement la même chose dans l'apprentissage centralisé classique : nous initialisons les paramètres du modèle, soit de façon aléatoire, soit à partir d'un point de contrôle précédemment sauvegardé.
zh_hans: 我们首先在服务器上初始化模型。这与经典的集中式学习完全相同：我们随机或从先前保存的检查点初始化模型参数。

source: Initialize global model
fr: Initialise le modèle global
zh_hans: 初始化全局模型

source: Step 1: Send model to a number of connected organizations/devices (client nodes)
fr: Étape 1 : envoyer le modèle à un certain nombre d'organisations/appareils connectés (nœuds clients)
zh_hans: 第 1 步：将模型发送到多个连接的组织/设备（客户节点）

source: Next, we send the parameters of the global model to the connected client nodes (think: edge devices like smartphones or servers belonging to organizations). This is to ensure that each participating node starts their local training using the same model parameters. We often use only a few of the connected nodes instead of all nodes. The reason for this is that selecting more and more client nodes has diminishing returns.
zh_hans: 接下来，我们会将全局模型的参数发送到连接的客户端节点（如智能手机等边缘设备或企业的服务器）。这是为了确保每个参与节点都使用相同的模型参数开始本地训练。我们通常只使用几个连接节点，而不是所有节点。这样做的原因是，选择越来越多的客户端节点会导致收益递减。

source: Send global model
fr: Envoyer le modèle global
zh_hans: 发送全局模型

source: Step 2: Train model locally on the data of each organization/device (client node)
fr: Étape 2 : Entraîne le modèle localement sur les données de chaque organisation/appareil (nœud client)
zh_hans: 步骤 2：在本地对每个机构/设备（客户端节点）的数据进行模型训练

source: Now that all (selected) client nodes have the latest version of the global model parameters, they start the local training. They use their own local dataset to train their own local model. They don't train the model until full convergence, but they only train for a little while. This could be as little as one epoch on the local data, or even just a few steps (mini-batches).
fr: Maintenant que tous les nœuds clients (sélectionnés) disposent de la dernière version des paramètres du modèle global, ils commencent l'entraînement local. Ils utilisent leur propre ensemble de données locales pour entraîner leur propre modèle local. Ils n'entraînent pas le modèle jusqu'à la convergence totale, mais ils ne s'entraînent que pendant un petit moment. Il peut s'agir d'une seule époque sur les données locales, ou même de quelques étapes (mini-batchs).
zh_hans: 现在，所有（选定的）客户端节点都有了最新版本的全局模型参数，它们开始进行本地训练。它们使用自己的本地数据集来训练自己的本地模型。它们不会一直训练到模型完全收敛为止，而只是训练一小段时间。这可能只是本地数据上的一个遍历，甚至只是几个步骤（mini-batches）。

source: Train on local data
fr: Forme-toi aux données locales
zh_hans: 根据本地数据进行训练

source: Step 3: Return model updates back to the server
fr: Étape 3 : Renvoyer les mises à jour du modèle au serveur
zh_hans: 步骤 3：将模型参数更新返回服务器

source: After local training, each client node has a slightly different version of the model parameters they originally received. The parameters are all different because each client node has different examples in its local dataset. The client nodes then send those model updates back to the server. The model updates they send can either be the full model parameters or just the gradients that were accumulated during local training.
fr: Après l'entraînement local, chaque nœud client possède une version légèrement différente des paramètres du modèle qu'il a reçus à l'origine. Les paramètres sont tous différents parce que chaque nœud client a des exemples différents dans son ensemble de données local. Les nœuds clients renvoient ensuite ces mises à jour du modèle au serveur. Les mises à jour du modèle qu'ils envoient peuvent être soit les paramètres complets du modèle, soit seulement les gradients qui ont été accumulés au cours de l'entraînement local.
zh_hans: 经过本地训练后，每个客户节点最初收到的模型参数都会略有不同。参数之所以不同，是因为每个客户端节点的本地数据集中都有不同的数据。然后，客户端节点将这些模型更新发回服务器。它们发送的模型更新既可以是完整的模型参数，也可以只是本地训练过程中积累的梯度。

source: Send model updates
fr: Envoyer les mises à jour du modèle
zh_hans: 发送模型参数更新

source: Step 4: Aggregate model updates into a new global model
fr: Étape 4 : Agréger les mises à jour des modèles dans un nouveau modèle global
zh_hans: 步骤 4：将模型更新聚合到新的全局模型中

source: The server receives model updates from the selected client nodes. If it selected 100 client nodes, it now has 100 slightly different versions of the original global model, each trained on the local data of one client. But didn't we want to have one model that contains the learnings from the data of all 100 client nodes?
fr: Le serveur reçoit les mises à jour du modèle des nœuds clients sélectionnés. S'il a sélectionné 100 nœuds clients, il dispose maintenant de 100 versions légèrement différentes du modèle global original, chacune ayant été formée sur les données locales d'un client. Mais ne voulions-nous pas avoir un seul modèle qui contienne les apprentissages des données de l'ensemble des 100 nœuds clients ?
zh_hans: 服务器从选定的客户端节点接收模型更新。如果服务器选择了 100 个客户端节点，那么它现在就拥有 100 个略有不同的原始全局模型版本，每个版本都是根据一个客户端的本地数据训练出来的。难道我们不希望有一个包含所有 100 个客户节点数据的模型吗？

source: In order to get one single model, we have to combine all the model updates we received from the client nodes. This process is called *aggregation*, and there are many different ways to do it. The most basic way to do it is called *Federated Averaging* (`McMahan et al., 2016 <https://arxiv.org/abs/1602.05629>`__), often abbreviated as *FedAvg*. *FedAvg* takes the 100 model updates and, as the name suggests, averages them. To be more precise, it takes the *weighted average* of the model updates, weighted by the number of examples each client used for training. The weighting is important to make sure that each data example has the same "influence" on the resulting global model. If one client has 10 examples, and another client has 100 examples, then - without weighting - each of the 10 examples would influence the global model ten times as much as each of the 100 examples.
zh_hans: 为了得到一个单一的模型，我们必须将从客户端节点收到的所有模型更新合并起来。这个过程称为*聚合*，有许多不同的方法。最基本的方法称为 *Federated Averaging* (`McMahan等人，2016 <https://arxiv.org/abs/1602.05629>`__)，通常缩写为*FedAvg*。*FedAvg* 可以把100 个模型更新进行平均。更准确地说，它取的是模型更新的*加权平均值*，根据每个客户端用于训练的数据数量进行加权。加权对于确保每个数据示例对生成的全局模型具有相同的 "影响 "非常重要。如果一个客户端有 10 个数据点，而另一个客户有 100 个数据点，那么在不加权的情况下，10 个示例对全局模型的影响是 100 个示例的 10 倍。

source: Aggregate model updates
fr: Mises à jour globales du modèle
zh_hans: 聚合模型参数更新

source: Step 5: Repeat steps 1 to 4 until the model converges
fr: Étape 5 : répète les étapes 1 à 4 jusqu'à ce que le modèle converge
zh_hans: 步骤 5：重复步骤 1 至 4，直至模型收敛

source: Steps 1 to 4 are what we call a single round of federated learning. The global model parameters get sent to the participating client nodes (step 1), the client nodes train on their local data (step 2), they send their updated models to the server (step 3), and the server then aggregates the model updates to get a new version of the global model (step 4).
fr: Les étapes 1 à 4 constituent ce que nous appelons un cycle unique d'apprentissage fédéré. Les paramètres du modèle global sont envoyés aux nœuds clients participants (étape 1), les nœuds clients s'entraînent sur leurs données locales (étape 2), ils envoient leurs modèles mis à jour au serveur (étape 3), et le serveur agrège ensuite les mises à jour du modèle pour obtenir une nouvelle version du modèle global (étape 4).
zh_hans: 步骤 1 至 4 就是我们所说的单轮联邦学习。全局模型参数被发送到参与的客户端节点（第 1 步），客户端节点对其本地数据进行训练（第 2 步），然后将更新后的模型发送到服务器（第 3 步），服务器汇总模型更新，得到新版本的全局模型（第 4 步）。

source: During a single round, each client node that participates in that iteration only trains for a little while. This means that after the aggregation step (step 4), we have a model that has been trained on all the data of all participating client nodes, but only for a little while. We then have to repeat this training process over and over again to eventually arrive at a fully trained model that performs well across the data of all client nodes.
zh_hans: 在一轮迭代中，每个参与迭代的客户节点只训练一小段时间。这意味着，在聚合步骤（步骤 4）之后，我们的模型已经在所有参与的客户节点的所有数据上训练过了，但只训练了一小会儿。然后，我们必须一次又一次地重复这一训练过程，最终得到一个经过全面训练的模型，该模型在所有客户节点的数据中都表现良好。

source: Congratulations, you now understand the basics of federated learning. There's a lot more to discuss, of course, but that was federated learning in a nutshell. In later parts of this tutorial, we will go into more detail. Interesting questions include: How can we select the best client nodes that should participate in the next round? What's the best way to aggregate model updates? How can we handle failing client nodes (stragglers)?
fr: Félicitations, tu comprends maintenant les bases de l'apprentissage fédéré. Il y a bien sûr beaucoup plus à discuter, mais c'était l'apprentissage fédéré en quelques mots. Dans les parties suivantes de ce tutoriel, nous irons plus en détail. Les questions intéressantes comprennent : comment pouvons-nous sélectionner les meilleurs nœuds clients qui devraient participer au prochain tour ? Quelle est la meilleure façon d'agréger les mises à jour du modèle ? Comment pouvons-nous gérer les nœuds clients qui échouent (stragglers) ?
zh_hans: 恭喜您，现在您已经了解了联邦学习的基础知识。当然，要讨论的内容还有很多，但这只是联邦学习的一个缩影。在本教程的后半部分，我们将进行更详细的介绍。有趣的问题包括 我们如何选择最好的客户端节点参与下一轮学习？聚合模型更新的最佳方法是什么？如何处理失败的客户端节点（落伍者）？

source: Just like we can train a model on the decentralized data of different client nodes, we can also evaluate the model on that data to receive valuable metrics. This is called federated evaluation, sometimes abbreviated as FE. In fact, federated evaluation is an integral part of most federated learning systems.
zh_hans: 就像我们可以在不同客户节点的分散数据上训练一个模型一样，我们也可以在这些数据上对模型进行评估，以获得有价值的指标。这就是所谓的联邦评估，有时简称为 FE。事实上，联邦评估是大多数联邦学习系统不可或缺的一部分。

source: Federated analytics
fr: Analyses fédérées
zh_hans: 联邦分析

source: In many cases, machine learning isn't necessary to derive value from data. Data analysis can yield valuable insights, but again, there's often not enough data to get a clear answer. What's the average age at which people develop a certain type of health condition? Federated analytics enables such queries over multiple client nodes. It is usually used in conjunction with other privacy-enhancing technologies like secure aggregation to prevent the server from seeing the results submitted by individual client nodes.
fr: Dans de nombreux cas, l'apprentissage automatique n'est pas nécessaire pour tirer de la valeur des données. L'analyse des données peut donner des indications précieuses, mais là encore, il n'y a souvent pas assez de données pour obtenir une réponse claire. Quel est l'âge moyen auquel les gens développent un certain type de problème de santé ? L'analyse fédérée permet de telles requêtes sur plusieurs nœuds clients. Elle est généralement utilisée en conjonction avec d'autres technologies de renforcement de la confidentialité, comme l'agrégation sécurisée, pour empêcher le serveur de voir les résultats soumis par les nœuds clients individuels.
zh_hans: 在很多情况下，机器学习并不是从数据中获取价值的必要条件。数据分析可以产生有价值的见解，但同样，往往没有足够的数据来获得明确的答案。人们患某种健康疾病的平均年龄是多少？联邦分析可以通过多个客户端节点进行此类查询。它通常与安全聚合等其他隐私增强技术结合使用，以防止服务器看到单个客户端节点提交的结果。

source: Differential Privacy
zh_hans: 差分隐私

source: Differential privacy (DP) is often mentioned in the context of Federated Learning. It is a privacy-preserving method used when analyzing and sharing statistical data, ensuring the privacy of individual participants. DP achieves this by adding statistical noise to the model updates, ensuring any individual participants’ information cannot be distinguished or re-identified. This technique can be considered an optimization that provides a quantifiable privacy protection measure.
zh_hans: 差分隐私（DP）经常在联邦学习中被提及。这是一种在分析和共享统计数据时使用的隐私保护方法，可确保单个参与者的隐私。DP 通过在模型更新中添加统计噪声来实现这一目的，确保任何个体参与者的信息都无法被区分或重新识别。这种技术可被视为一种优化，提供了一种可量化的隐私保护措施。

source: Federated learning, federated evaluation, and federated analytics require infrastructure to move machine learning models back and forth, train and evaluate them on local data, and then aggregate the updated models. Flower provides the infrastructure to do exactly that in an easy, scalable, and secure way. In short, Flower presents a unified approach to federated learning, analytics, and evaluation. It allows the user to federate any workload, any ML framework, and any programming language.
fr: L'apprentissage fédéré, l'évaluation fédérée et l'analyse fédérée nécessitent une infrastructure pour déplacer les modèles d'apprentissage automatique dans les deux sens, les entraîner et les évaluer sur des données locales, puis agréger les modèles mis à jour. Flower fournit l'infrastructure pour faire exactement cela de manière simple, évolutive et sécurisée. En bref, Flower présente une approche unifiée de l'apprentissage, de l'analyse et de l'évaluation fédérés. Il permet à l'utilisateur de fédérer n'importe quelle charge de travail, n'importe quel cadre de ML et n'importe quel langage de programmation.
zh_hans: 联邦学习、联邦评估和联邦分析需要基础框架来来回移动机器学习模型，在本地数据上对其进行训练和评估，然后汇总更新的模型。Flower 提供的基础架构正是以简单、可扩展和安全的方式实现这些目标的。简而言之，Flower 为联邦学习、分析和评估提供了一种统一的方法。它允许用户联邦化任何工作负载、任何 ML 框架和任何编程语言。

source: Flower federated learning server and client nodes (car, scooter, personal computer, roomba, and phone)
fr: Serveur d'apprentissage fédéré de Flower et nœuds clients (voiture, scooter, ordinateur personnel, roomba et téléphone)
zh_hans: Flower联邦学习服务器和客户端节点（汽车、滑板车、个人电脑、roomba 和电话）

source: Congratulations, you just learned the basics of federated learning and how it relates to the classic (centralized) machine learning!
fr: Félicitations, tu viens d'apprendre les bases de l'apprentissage fédéré et son rapport avec l'apprentissage automatique classique (centralisé) !
zh_hans: 恭喜您，您刚刚了解了联邦学习的基础知识，以及它与传统（集中式）机器学习的关系！

source: In the next part of this tutorial, we are going to build a first federated learning system with Flower.
fr: Dans la prochaine partie de ce tutoriel, nous allons construire un premier système d'apprentissage fédéré avec Flower.
zh_hans: 在本教程的下一部分，我们将用 Flower 建立第一个联邦学习系统。

source: The `Flower Federated Learning Tutorial - Part 1 <https://flower.dev/docs/framework/tutorial-get-started-with-flower-pytorch.html>`__ shows how to build a simple federated learning system with PyTorch and Flower.
zh_hans: `Flower 联邦学习教程 - 第 1 部分 <https://flower.dev/docs/framework/tutorial-get-started-with-flower-pytorch.html>`__ 展示了如何使用 PyTorch 和 Flower 构建一个简单的联邦学习系统。

source: Upload the whl (e.g., ``flwr-1.6.0-py3-none-any.whl``)
zh_hans: 上传 whl（例如 ``flwr-1.6.0-py3-none-any.whl``)

source: Change ``!pip install -q 'flwr[simulation]' torch torchvision matplotlib`` to ``!pip install -q 'flwr-1.6.0-py3-none-any.whl[simulation]' torch torchvision matplotlib``
zh_hans: 将``!pip install -q 'flwr[simulation]' torch torchvision matplotlib``更改为``!pip install -q 'flwr-1.6.0-py3-none-any.whl[simulation]' torch torch torchvision matplotlib``

source: All that's left to do it to define a function that loads both model and data, creates a :code:`CifarClient`, and starts this client. You load your data and model by using :code:`cifar.py`. Start :code:`CifarClient` with the function :code:`fl.client.start_numpy_client()` by pointing it at the same IP adress we used in :code:`server.py`:
zh_hans: 剩下要做的就是定义一个加载模型和数据的函数，创建一个 :code:`CifarClient` 并启动该客户端。使用 :code:`cifar.py` 加载数据和模型。使用函数 :code:`fl.client.start_numpy_client()` 启动 :code:`CifarClient`，将其指向我们在 :code:`server.py` 中使用的相同 IP 地址：
