Repository: lucacorbucci/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: fr, zh_hans

source: Simplified examples and baselines ([#484](https://github.com/adap/flower/pull/484)).
fr: Exemples simplifiés et lignes de base ([#484](https://github.com/adap/flower/pull/484)).
zh_hans: 简化示例和baselines（[#484](https://github.com/adap/flower/pull/484)）。

source: Removed presently unused `on_conclude_round` from strategy interface ([#483](https://github.com/adap/flower/pull/483)).
fr: Suppression de `on_conclude_round` actuellement inutilisé de l'interface de stratégie ([#483](https://github.com/adap/flower/pull/483)).
zh_hans: 删除了策略界面中目前未使用的 "on_conclude_round"（[#483](https://github.com/adap/flower/pull/483)）。

source: Set minimal Python version to 3.6.1 instead of 3.6.9 ([#471](https://github.com/adap/flower/pull/471)).
fr: Fixe la version minimale de Python à 3.6.1 au lieu de 3.6.9 ([#471](https://github.com/adap/flower/pull/471)).
zh_hans: 将最小 Python 版本设为 3.6.1，而不是 3.6.9 ([#471](https://github.com/adap/flower/pull/471)).

source: Improved `Strategy` docstrings ([#470](https://github.com/adap/flower/pull/470)).
fr: Amélioration des docstrings `Stratégie` ([#470](https://github.com/adap/flower/pull/470)).
zh_hans: 改进了 `Strategy` docstrings（[#470](https://github.com/adap/flower/pull/470)）。

source: Example projects
zh_hans: 项目实例

source: Flower comes with a number of usage examples. The examples demonstrate how Flower can be used to federate different kinds of existing machine learning pipelines, usually leveraging popular machine learning frameworks such as `PyTorch <https://pytorch.org/>`_ or `TensorFlow <https://www.tensorflow.org/>`_.
fr: Flower est livré avec un certain nombre d'exemples d'utilisation, qui montrent comment Flower peut être utilisé pour fédérer différents types de pipelines d'apprentissage automatique existants, qui s'appuient généralement sur des frameworks d'apprentissage automatique populaires tels que `PyTorch <https://pytorch.org/>`_ ou `TensorFlow <https://www.tensorflow.org/>`_.
zh_hans: Flower 附带了许多使用示例。这些示例演示了如何使用 Flower 联邦不同类型的现有机器学习形式，通常是利用流行的机器学习框架，如 `PyTorch <https://pytorch.org/>`_ 或 `TensorFlow <https://www.tensorflow.org/>`_。

source: Flower usage examples used to be bundled with Flower in a package called ``flwr_example``. We are migrating those examples to standalone projects to make them easier to use. All new examples are based in the directory `examples <https://github.com/adap/flower/tree/main/examples>`_.
fr: Les exemples d'utilisation de Flower étaient auparavant regroupés avec Flower dans un paquet appelé ``flwr_example``. Nous migrons ces exemples vers des projets autonomes pour les rendre plus faciles à utiliser. Tous les nouveaux exemples sont basés dans le répertoire ``examples <https://github.com/adap/flower/tree/main/examples>`_.
zh_hans: Flower 的使用示例曾与 Flower 捆绑在一个名为 ``flwr_example`` 的软件包中。我们正在将这些示例迁移到独立项目中，以使它们更易于使用。所有新示例都位于目录 `examples <https://github.com/adap/flower/tree/main/examples>`_。

source: The following examples are available as standalone projects.
fr: Les exemples suivants sont disponibles sous forme de projets autonomes.
zh_hans: 以下示例可作为独立项目使用。

source: Quickstart TensorFlow/Keras
fr: Démarrage rapide de TensorFlow/Keras
zh_hans: 快速入门 TensorFlow/Keras

source: The TensorFlow/Keras quickstart example shows CIFAR-10 image classification with MobileNetV2:
fr: L'exemple de démarrage rapide TensorFlow/Keras montre la classification d'images CIFAR-10 avec MobileNetV2 :
zh_hans: TensorFlow/Keras 快速入门示例展示了使用 MobileNetV2 进行的 CIFAR-10 图像分类：

source: `Quickstart TensorFlow (Code) <https://github.com/adap/flower/tree/main/examples/quickstart-tensorflow>`_
zh_hans: `TensorFlow快速入门 (代码) <https://github.com/adap/flower/tree/main/examples/quickstart-tensorflow>`_

source: `Quickstart TensorFlow (Tutorial) <https://flower.dev/docs/framework/tutorial-quickstart-tensorflow.html>`_
zh_hans: `TensorFlow快速入门 (教程) <https://flower.dev/docs/framework/tutorial-quickstart-tensorflow.html>`_

source: `Quickstart TensorFlow (Blog Post) <https://flower.dev/blog/2020-12-11-federated-learning-in-less-than-20-lines-of-code>`_
zh_hans: `TensorFlow快速入门 (博客) <https://flower.dev/blog/2020-12-11-federated-learning-in-less-than-20-lines-of-code>`_

source: Quickstart PyTorch
fr: Démarrage rapide de PyTorch
zh_hans: PyTorch快速入门

source: The PyTorch quickstart example shows CIFAR-10 image classification with a simple Convolutional Neural Network:
fr: L'exemple de démarrage rapide PyTorch montre la classification d'images CIFAR-10 avec un simple réseau neuronal convolutif :
zh_hans: PyTorch 快速入门范例展示了使用简单卷积神经网络进行 CIFAR-10 图像分类的情况：

source: `Quickstart PyTorch (Code) <https://github.com/adap/flower/tree/main/examples/quickstart-pytorch>`_
zh_hans: `PyTorch快速入门 (代码) <https://github.com/adap/flower/tree/main/examples/quickstart-pytorch>`_

source: `Quickstart PyTorch (Tutorial) <https://flower.dev/docs/framework/tutorial-quickstart-pytorch.html>`_
zh_hans: `PyTorch快速入门 (教程) <https://flower.dev/docs/framework/tutorial-quickstart-pytorch.html>`_

source: PyTorch: From Centralized To Federated
fr: PyTorch : De la centralisation à la fédération
zh_hans: PyTorch： 从集中式到联邦式

source: This example shows how a regular PyTorch project can be federated using Flower:
fr: Cet exemple montre comment un projet PyTorch ordinaire peut être fédéré à l'aide de Flower :
zh_hans: 本例展示了如何使用 Flower 联邦化一个普通的 PyTorch 项目：

source: `PyTorch: From Centralized To Federated (Code) <https://github.com/adap/flower/tree/main/examples/pytorch-from-centralized-to-federated>`_
zh_hans: PyTorch： 从集中式到联邦式（代码） <https://github.com/adap/flower/tree/main/examples/pytorch-from-centralized-to-federated>`_

source: `PyTorch: From Centralized To Federated (Tutorial) <https://flower.dev/docs/framework/example-pytorch-from-centralized-to-federated.html>`_
zh_hans: PyTorch： 从集中式到联邦式（教程） <https://flower.dev/docs/framework/example-pytorch-from-centralized-to-federated.html>`_

source: Federated Learning on Raspberry Pi and Nvidia Jetson
fr: Apprentissage fédéré sur Raspberry Pi et Nvidia Jetson
zh_hans: 树莓派和 Nvidia Jetson 上的联邦学习

source: This example shows how Flower can be used to build a federated learning system that run across Raspberry Pi and Nvidia Jetson:
fr: Cet exemple montre comment Flower peut être utilisé pour construire un système d'apprentissage fédéré qui fonctionne sur Raspberry Pi et Nvidia Jetson :
zh_hans: 本示例展示了如何利用 Flower 建立一个跨 Raspberry Pi 和 Nvidia Jetson 运行的联邦学习系统：

source: `Federated Learning on Raspberry Pi and Nvidia Jetson (Code) <https://github.com/adap/flower/tree/main/examples/embedded-devices>`_
zh_hans: Raspberry Pi 和 Nvidia Jetson 上的联邦学习（代码） <https://github.com/adap/flower/tree/main/examples/embedded-devices>`_

source: `Federated Learning on Raspberry Pi and Nvidia Jetson (Blog Post) <https://flower.dev/blog/2020-12-16-running_federated_learning_applications_on_embedded_devices_with_flower>`_
fr: `L'apprentissage fédéré sur Raspberry Pi et Nvidia Jetson (Blog Post) <https://flower.dev/blog/2020-12-16-running_federated_learning_applications_on_embedded_devices_with_flower>`_
zh_hans: Raspberry Pi和 Nvidia Jetson 上的联邦学习（博客） <https://flower.dev/blog/2020-12-16-running_federated_learning_applications_on_embedded_devices_with_flower>`_

source: Legacy Examples (`flwr_example`)
fr: Exemples hérités (`flwr_example`)
zh_hans: 传统示例 (`flwr_example`)

source: The useage examples in `flwr_example` are deprecated and will be removed in the future. New examples are provided as standalone projects in `examples <https://github.com/adap/flower/tree/main/examples>`_.
fr: Les exemples d'utilisation dans `flwr_example` sont obsolètes et seront supprimés à l'avenir. De nouveaux exemples sont fournis en tant que projets autonomes dans `examples <https://github.com/adap/flower/tree/main/examples>`_.
zh_hans: 在 `flwr_example` 中的使用示例已被弃用，今后将被移除。新示例将作为独立项目在 `examples <https://github.com/adap/flower/tree/main/examples>`_ 中提供。

source: Extra Dependencies
fr: Dépendances supplémentaires
zh_hans: 额外依赖

source: The core Flower framework keeps a minimal set of dependencies. The examples demonstrate Flower in the context of different machine learning frameworks, so additional dependencies need to be installed before an example can be run.
fr: Le noyau du framework Flower conserve un ensemble minimal de dépendances. Les exemples démontrent Flower dans le contexte de différents frameworks d'apprentissage automatique, de sorte que des dépendances supplémentaires doivent être installées avant qu'un exemple puisse être exécuté.
zh_hans: Flower 核心框架只保留了最低限度的依赖项。这些示例在不同机器学习框架的背景下演示了 Flower，因此在运行示例之前需要安装额外的依赖项。

source: For PyTorch examples::
fr: Pour les exemples de PyTorch: :
zh_hans: PyTorch 示例：：

source: For TensorFlow examples::
fr: Pour les exemples de TensorFlow : :
zh_hans: TensorFlow 示例：：

source: For both PyTorch and TensorFlow examples::
fr: Pour les exemples PyTorch et TensorFlow: :
zh_hans: PyTorch 和 TensorFlow 示例：：

source: Please consult :code:`pyproject.toml` for a full list of possible extras (section :code:`[tool.poetry.extras]`).
fr: Tu peux consulter :code:`pyproject.toml` pour une liste complète des extras possibles (section :code:`[tool.poetry.extras]`).
zh_hans: 请参阅 :code:`pyproject.toml`，了解可能的 extras 的完整列表（章节 :code:`[tool.poems.extras]`）。

source: PyTorch Examples
fr: Exemples de PyTorch
zh_hans: PyTorch 示例

source: Our PyTorch examples are based on PyTorch 1.7. They should work with other releases as well. So far, we provide the following examples.
fr: Nos exemples PyTorch sont basés sur PyTorch 1.7. Ils devraient fonctionner avec d'autres versions également. Jusqu'à présent, nous fournissons les exemples suivants.
zh_hans: 我们的 PyTorch 示例基于 PyTorch 1.7。它们应该也能在其他版本中使用。到目前为止，我们提供了以下示例。

source: CIFAR-10 Image Classification
fr: Classification d'images CIFAR-10
zh_hans: CIFAR-10 图像分类

source: `CIFAR-10 and CIFAR-100 <https://www.cs.toronto.edu/~kriz/cifar.html>`_ are popular RGB image datasets. The Flower CIFAR-10 example uses PyTorch to train a simple CNN classifier in a federated learning setup with two clients.
fr: `CIFAR-10 et CIFAR-100 <https://www.cs.toronto.edu/~kriz/cifar.html>`_ sont des ensembles de données d'images RVB populaires. L'exemple Flower CIFAR-10 utilise PyTorch pour former un classificateur CNN simple dans une configuration d'apprentissage fédéré avec deux clients.
zh_hans: CIFAR-10 和 CIFAR-100 <https://www.cs.toronto.edu/~kriz/cifar.html>``_ 是流行的 RGB 图像数据集。Flower CIFAR-10 示例使用 PyTorch 在有两个客户端的联邦学习设置中训练一个简单的 CNN 分类器。

source: First, start a Flower server:
fr: Tout d'abord, démarre un serveur Flower :
zh_hans: 首先，启动 Flower 服务器：

source: Then, start the two clients in a new terminal window:
fr: Ensuite, démarre les deux clients dans une nouvelle fenêtre de terminal :
zh_hans: 然后，在新的终端窗口中启动两个客户端：

source: For more details, see :code:`src/py/flwr_example/pytorch_cifar`.
fr: Pour plus de détails, voir :code:`src/py/flwr_example/pytorch_cifar`.
zh_hans: 更多详情，请参阅 :code:`src/py/flwr_example/pytorch_cifar`。

source: ImageNet-2012 Image Classification
fr: ImageNet-2012 Classification des images
zh_hans: ImageNet-2012 图像分类

source: `ImageNet-2012 <http://www.image-net.org/>`_ is one of the major computer vision datasets. The Flower ImageNet example uses PyTorch to train a ResNet-18 classifier in a federated learning setup with ten clients.
fr: `ImageNet-2012 <http://www.image-net.org/>`_ est l'un des principaux ensembles de données de vision par ordinateur. L'exemple Flower ImageNet utilise PyTorch pour entraîner un classificateur ResNet-18 dans une configuration d'apprentissage fédéré avec dix clients.
zh_hans: ImageNet-2012 <http://www.image-net.org/>`_ 是主要的计算机视觉数据集之一。Flower ImageNet 示例使用 PyTorch 在有十个客户端的联邦学习设置中训练 ResNet-18 分类器。

source: For more details, see :code:`src/py/flwr_example/pytorch_imagenet`.
fr: Pour plus de détails, voir :code:`src/py/flwr_example/pytorch_imagenet`.
zh_hans: 更多详情，请参阅 :code:`src/py/flwr_example/pytorch_imagenet`。

source: TensorFlow Examples
fr: Exemples de TensorFlow
zh_hans: TensorFlow 示例

source: Our TensorFlow examples are based on TensorFlow 2.0 or newer. So far, we provide the following examples.
fr: Nos exemples TensorFlow sont basés sur TensorFlow 2.0 ou une version plus récente. Jusqu'à présent, nous te proposons les exemples suivants.
zh_hans: 我们的 TensorFlow 示例基于 TensorFlow 2.0 或更新版本。到目前为止，我们提供了以下示例。

source: Fashion-MNIST Image Classification
fr: Classification d'images Fashion-MNIST
zh_hans: Fashion-MNIST 图像分类

source: `Fashion-MNIST <https://github.com/zalandoresearch/fashion-mnist>`_ is often used as the "Hello, world!" of machine learning. We follow this tradition and provide an example which samples random local datasets from Fashion-MNIST and trains a simple image classification model over those partitions.
fr: nous suivons cette tradition et fournissons un exemple qui échantillonne des ensembles de données locales aléatoires de Fashion-MNIST et entraîne un modèle simple de classification d'images sur ces partitions.
zh_hans: `Fashion-MNIST <https://github.com/zalandoresearch/fashion-mnist>`_ 经常被用作机器学习的 "你好，世界！"。我们遵循这一传统，提供了一个从Fashion-MNIST 中随机抽样本地数据集的示例，并在这些分区上训练一个简单的图像分类模型。

source: For more details, see :code:`src/py/flwr_example/tensorflow_fashion_mnist`.
fr: Pour plus de détails, voir :code:`src/py/flwr_example/tensorflow_fashion_mnist`.
zh_hans: 更多详情，请参阅 :code:`src/py/flwr_example/tensorflow_fashion_mnist`。

source: This page collects answers to commonly asked questions about Federated Learning with Flower.
fr: Cette page rassemble les réponses aux questions les plus fréquemment posées sur l'apprentissage fédéré avec Flower.
zh_hans: 本页收集了有关 "Flower 联邦学习 "常见问题的答案。

source: :fa:`eye,mr-1` Can Flower run on Juptyter Notebooks / Google Colab?
fr: :fa:`eye,mr-1` Flower peut-il fonctionner sur les ordinateurs portables Juptyter / Google Colab ?
zh_hans: :fa:`eye,mr-1` Flower 可以在 Juptyter Notebooks / Google Colab 上运行吗？

source: Yes, it can! Flower even comes with a few under-the-hood optimizations to make it work even better on Colab. Here's a quickstart example:
fr: Oui, c'est possible ! Flower est même livré avec quelques optimisations pour qu'il fonctionne encore mieux sur Colab. Voici un exemple de démarrage rapide :
zh_hans: 是的，它可以！Flower 甚至还进行了一些底层优化，使其在 Colab 上运行得更好。下面是一个快速启动示例：

source: `Flower simulation PyTorch <https://colab.research.google.com/github/adap/flower/blob/main/examples/simulation-pytorch/sim.ipynb>`_
zh_hans: `Flower 模拟 PyTorch <https://colab.research.google.com/github/adap/flower/blob/main/examples/simulation-pytorch/sim.ipynb>`_

source: `Flower simulation TensorFlow/Keras <https://colab.research.google.com/github/adap/flower/blob/main/examples/simulation-tensorflow/sim.ipynb>`_
zh_hans: `Flower模拟TensorFlow/Keras <https://colab.research.google.com/github/adap/flower/blob/main/examples/simulation-tensorflow/sim.ipynb>`_

source: :fa:`eye,mr-1` How can I run Federated Learning on a Raspberry Pi?
fr: :fa:`eye,mr-1` Comment puis-je faire fonctionner l'apprentissage fédéré sur un Raspberry Pi ?
zh_hans: :fa:`eye,mr-1` 如何在 Raspberry Pi 上运行联邦学习？

source: Find the `blog post about federated learning on embedded device here <https://flower.dev/blog/2020-12-16-running_federated_learning_applications_on_embedded_devices_with_flower>`_ and the corresponding `GitHub code example <https://github.com/adap/flower/tree/main/examples/embedded-devices>`_.
zh_hans: 请点击此处查看有关嵌入式设备联邦学习的 "博文"<https://flower.dev/blog/2020-12-16-running_federated_learning_applications_on_embedded_devices_with_flower>`_和相应的 "GitHub 代码示例"<https://github.com/adap/flower/tree/main/examples/embedded-devices>`_。

source: :fa:`eye,mr-1` Does Flower support federated learning on Android devices?
fr: :fa:`eye,mr-1` Est-ce que Flower prend en charge l'apprentissage fédéré sur les appareils Android ?
zh_hans: :fa:`eye,mr-1` Flower 是否支持安卓设备上的联邦学习？

source: Yes, it does. Please take a look at our `blog post <https://flower.dev/blog/2021-12-15-federated-learning-on-android-devices-with-flower>`_ or check out the code examples:
zh_hans: 是的，确实如此。请查看我们的 "博客文章 <https://flower.dev/blog/2021-12-15-federated-learning-on-android-devices-with-flower>`_" 或查看代码示例：

source: `Android Kotlin example <https://flower.dev/docs/examples/android-kotlin.html>`_
zh_hans: `Android Kotlin 示例 <https://flower.dev/docs/examples/android-kotlin.html>`_

source: `Android Java example <https://flower.dev/docs/examples/android.html>`_
zh_hans: Android Java 示例 <https://flower.dev/docs/examples/android.html>`_

source: :fa:`eye,mr-1` Can I combine federated learning with blockchain?
fr: :fa:`eye,mr-1` Puis-je combiner l'apprentissage fédéré avec la blockchain ?
zh_hans: :fa:`eye,mr-1` 我可以将联邦学习与区块链结合起来吗？

source: Yes, of course. A list of available examples using Flower within a blockchain environment is available here:
fr: Oui, bien sûr, une liste d'exemples disponibles utilisant Flower dans un environnement blockchain est disponible ici :
zh_hans: 当然可以。有关在区块链环境中使用 Flower 的可用示例列表，请点击此处：

source: `Flower meets Nevermined YouTube video <https://www.youtube.com/watch?v=A0A9hSlPhKI>`_.
fr: `Flower rencontre Nevermined vidéo YouTube <https://www.youtube.com/watch?v=A0A9hSlPhKI>`_.
zh_hans: `Flower meets Nevermined YouTube 视频 <https://www.youtube.com/watch?v=A0A9hSlPhKI>`_.

source: `Flower meets Talan blog post <https://www.linkedin.com/pulse/federated-learning-same-mask-different-faces-imen-ayari/?trackingId=971oIlxLQ9%2BA9RB0IQ73XQ%3D%3D>`_ .
zh_hans: `Flower meets Talan博文 <https://www.linkedin.com/pulse/federated-learning-same-mask-different-faces-imen-ayari/?trackingId=971oIlxLQ9%2BA9RB0IQ73XQ%3D%3D>`_ 。

source: Telemetry
fr: Télémétrie
zh_hans: 遥测功能

source: The Flower open-source project collects **anonymous** usage metrics to make well-informed decisions to improve Flower. Doing this enables the Flower team to understand how Flower is used and what challenges users might face.
fr: Le projet open-source Flower recueille des mesures d'utilisation **anonymes** afin de prendre des décisions éclairées pour améliorer Flower. Cela permet à l'équipe de Flower de comprendre comment Flower est utilisé et quels sont les défis auxquels les utilisateurs peuvent être confrontés.
zh_hans: Flower 开源项目收集**匿名**使用指标，以便在充分知情的情况下做出改进 Flower 的决定。这样做能让 Flower 团队了解 Flower 的使用情况以及用户可能面临的挑战。

source: **Flower is a friendly framework for collaborative AI and data science.** Staying true to this statement, Flower makes it easy to disable telemetry for users that do not want to share anonymous usage metrics.
fr: **Flower est un cadre convivial pour l'IA collaborative et la science des données.** En restant fidèle à cette déclaration, Flower permet de désactiver facilement la télémétrie pour les utilisateurs qui ne souhaitent pas partager des mesures d'utilisation anonymes.
zh_hans: **Flower 是一个用于协作式人工智能和数据科学的友好框架。** Flower 遵循这一声明，让不想分享匿名使用指标的用户可以轻松禁用遥测技术。

source: Principles
fr: Principes
zh_hans: 原则

source: We follow strong principles guarding anonymous usage metrics collection:
fr: Nous suivons des principes stricts concernant la collecte de données anonymes sur l'utilisation :
zh_hans: 我们遵循严格的匿名使用指标收集原则：

source: **Optional:** You will always be able to disable telemetry; read on to learn “[How to opt-out](#how-to-opt-out)”.
fr: **Optionnel:** Tu pourras toujours désactiver la télémétrie ; lis la suite pour apprendre "[Comment se désengager](#how-to-opt-out)".
zh_hans: **可选：** 您始终可以禁用遥测功能；请继续阅读"[如何退出](#how-to-opt-out)"。

source: **Anonymous:** The reported usage metrics are anonymous and do not contain any personally identifiable information (PII). See “[Collected metrics](#collected-metrics)” to understand what metrics are being reported.
fr: **Anonyme:** Les mesures d'utilisation rapportées sont anonymes et ne contiennent aucune information personnelle identifiable (PII). Voir "[Collected metrics](#collected-metrics)" pour comprendre quelles mesures sont rapportées.
zh_hans: **匿名：** 报告的使用指标是匿名的，不包含任何个人身份信息 (PII)。请参阅"[收集的指标](#collected-metrics) "了解报告的指标。

source: **Transparent:** You can easily inspect what anonymous metrics are being reported; see the section “[How to inspect what is being reported](#how-to-inspect-what-is-being-reported)”
fr: **Transparent:** Tu peux facilement inspecter les métriques anonymes qui sont rapportées ; voir la section "[Comment inspecter ce qui est rapporté](#how-to-inspect-what-is-being-reported)"
zh_hans: **透明：** 您可以轻松查看正在报告的匿名指标；请参阅"[如何查看正在报告的指标]（#how-to-inspect-what-is-being-reported）"部分

source: **Open for feedback:** You can always reach out to us if you have feedback; see the section “[How to contact us](#how-to-contact-us)” for details.
zh_hans: **欢迎反馈：** 如果您有反馈意见，可以随时联系我们；详情请参见"[如何联系我们](#how-to-contact-us) "部分。

source: How to opt-out
fr: Comment se désinscrire
zh_hans: 如何退出

source: When Flower starts, it will check for an environment variable called `FLWR_TELEMETRY_ENABLED`. Telemetry can easily be disabled by setting `FLWR_TELEMETRY_ENABLED=0`. Assuming you are starting a Flower server or client, simply do so by prepending your command as in:
fr: Lorsque Flower démarre, il vérifie la présence d'une variable d'environnement appelée `FLWR_TELEMETRY_ENABLED`. La télémétrie peut facilement être désactivée en réglant `FLWR_TELEMETRY_ENABLED=0`. En supposant que tu démarres un serveur ou un client Flower, fais-le simplement en faisant précéder ta commande de la façon suivante :
zh_hans: Flower 启动时，会检查环境变量 `FLWR_TELEMETRY_ENABLED` 是否存在。通过设置 `FLWR_TELEMETRY_ENABLED=0` 可以轻松禁用遥测功能。假设你启动的是 Flower 服务器或客户端，只需在命令前添加以下内容即可：

source: Alternatively, you can export `FLWR_TELEMETRY_ENABLED=0` in, for example, `.bashrc` (or whatever configuration file applies to your environment) to disable Flower telemetry permanently.
fr: Tu peux aussi exporter `FLWR_TELEMETRY_ENABLED=0` dans, par exemple, `.bashrc` (ou tout autre fichier de configuration qui s'applique à ton environnement) pour désactiver la télémétrie de la fleur de façon permanente.
zh_hans: 或者，你也可以在 `.bashrc`（或任何适用于你的环境的配置文件）中导出 `FLWR_TELEMETRY_ENABLED=0` 来永久禁用 Flower telemetry。

source: Collected metrics
fr: Mesures collectées
zh_hans: 收集的指标

source: Flower telemetry collects the following metrics:
fr: La télémétrie des fleurs recueille les métriques suivantes :
zh_hans: Flower 遥测技术收集以下指标：

source: **Flower version.** Understand which versions of Flower are currently being used. This helps us to decide whether we should invest effort into releasing a patch version for an older version of Flower or instead use the bandwidth to build new features.
fr: **Cela nous aide à décider si nous devons investir des efforts dans la publication d'une version corrective pour une version plus ancienne de Flower ou si nous devons plutôt utiliser la bande passante pour développer de nouvelles fonctionnalités.
zh_hans: **了解目前使用的 Flower 版本。这有助于我们决定是否应该投入精力为旧版本的 Flower 发布补丁版本，还是利用带宽来构建新功能。

source: **Operating system.** Enables us to answer questions such as: *Should we create more guides for Linux, macOS, or Windows?*
fr: **Système d'exploitation.** Nous permet de répondre à des questions telles que : *Faudrait-il créer plus de guides pour Linux, macOS ou Windows ?
zh_hans: **操作系统**使我们能够回答以下问题： *我们应该为 Linux、macOS 还是 Windows 创建更多指南？*

source: **Python version.** Knowing the Python version helps us, for example, to decide whether we should invest effort into supporting old versions of Python or stop supporting them and start taking advantage of new Python features.
fr: **Version de Python.** Connaître la version de Python nous aide, par exemple, à décider si nous devons investir des efforts dans la prise en charge des anciennes versions de Python ou cesser de les prendre en charge et commencer à tirer parti des nouvelles fonctionnalités de Python.
zh_hans: **例如，了解 Python 版本有助于我们决定是否应该投入精力支持旧版本的 Python，还是停止支持这些版本并开始利用新的 Python 功能。
