Repository: lucacorbucci/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: fr, zh_hans

source: Upload the whl (e.g., ``flwr-1.7.0-py3-none-any.whl``)
zh_hans: 更新 whl (e.g., ``flwr-1.7.0-py3-none-any.whl``)

source: Change ``!pip install -q 'flwr[simulation]' torch torchvision matplotlib`` to ``!pip install -q 'flwr-1.7.0-py3-none-any.whl[simulation]' torch torchvision matplotlib``
zh_hans: 把``!pip install -q 'flwr[simulation]' torch torchvision matplotlib``变为``!pip install -q 'flwr-1.7.0-py3-none-any.whl[simulation]' torch torchvision matplotlib``

source: Release Flower
fr: Publier Flower
zh_hans: 发布 Flower

source: This document describes the current release process. It may or may not change in the future.
fr: Ce document décrit le processus de diffusion actuel, qui peut ou non changer à l'avenir.
zh_hans: 本文件描述了当前的发布流程。今后可能会有变化，也可能不会有变化。

source: Before the release
fr: Avant la sortie
zh_hans: 发布前

source: Update the changelog (``changelog.md``) with all relevant changes that happened after the last release. If the last release was tagged ``v1.2.0``, you can use the following URL to see all commits that got merged into ``main`` since then:
fr: Mettez à jour le journal des modifications (``changelog.md``) avec tous les changements pertinents qui se sont produits après la dernière version. Si la dernière version a été étiquetée ``v1.2.0``, vous pouvez utiliser l'URL suivante pour voir tous les commits qui ont été fusionnés dans ``main`` depuis lors :
zh_hans: 更新更新日志 (``changelog.md``)，加入上次发布后发生的所有相关变更。如果上次发布的版本被标记为 ``v1.2.0``，则可以使用以下 URL 查看此后合并到 ``main`` 的所有提交：

source: Thank the authors who contributed since the last release. This can be done by running the ``./dev/add-shortlog.sh`` convenience script (it can be ran multiple times and will update the names in the list if new contributors were added in the meantime).
zh_hans: 感谢自上次发布以来做出贡献的作者。可以通过运行 ``./dev/add-shortlog.sh`` 方便脚本来完成（可以多次运行，如果在此期间有新的贡献者加入，则会更新列表中的名字）。

source: During the release
fr: Lors de la sortie
zh_hans: 在发布期间

source: The version number of a release is stated in ``pyproject.toml``. To release a new version of Flower, the following things need to happen (in that order):
fr: Le numéro de version d'une version est indiqué dans ``pyproject.toml``. Pour publier une nouvelle version de Flower, les choses suivantes doivent se produire (dans cet ordre) :
zh_hans: 版本号在 ``pyproject.toml`` 中说明。要发布 Flower 的新版本，需要完成以下工作（按顺序排列）：

source: Update the ``changelog.md`` section header ``Unreleased`` to contain the version number and date for the release you are building. Create a pull request with the change.
fr: Mettez à jour l'en-tête de section ``changelog.md`` ``Unreleased`` pour qu'il contienne le numéro de version et la date de la version que vous construisez. Créez une demande de traction avec le changement.
zh_hans: 更新 ``changelog.md`` 部分的标题 ``Unreleased`` 以包含你正在构建的版本的版本号和日期。创建一个包含更改的拉取请求。

source: Tag the release commit with the version number as soon as the PR is merged: ``git tag v0.12.3``, then ``git push --tags``. This will create a draft release on GitHub containing the correct artifacts and the relevant part of the changelog.
zh_hans: 在 PR 合并后立即用版本号标记发布提交：``git tag v0.12.3``，然后``git push --tags``。这将在 GitHub 上创建一个包含正确工件和更新日志相关部分的发布草案。

source: Check the draft release on GitHub, and if everything is good, publish it.
zh_hans: 检查 GitHub 上的发布稿，如果一切正常，就发布它。

source: After the release
fr: Après la publication
zh_hans: 发布后

source: Create a pull request which contains the following changes:
fr: Crée une demande de pull qui contient les modifications suivantes :
zh_hans: 创建包含以下更改的拉取请求：

source: Increase the minor version in ``pyproject.toml`` by one.
fr: Augmente la version mineure de ``pyproject.toml`` d'une unité.
zh_hans: 将 ``pyproject.toml`` 中的次要版本增加一个。

source: Update all files which contain the current version number if necessary.
fr: Mets à jour tous les fichiers qui contiennent le numéro de version actuel si nécessaire.
zh_hans: 如有必要，更新包含当前版本号的所有文件。

source: Add a new ``Unreleased`` section in ``changelog.md``.
fr: Ajoute une nouvelle section ``Unreleased`` dans ``changelog.md``.
zh_hans: 在 ``changelog.md`` 中添加新的 ``Unreleased`` 部分。

source: Merge the pull request on the same day (i.e., before a new nighly release gets published to PyPI).
fr: Fusionne la pull request le jour même (c'est-à-dire avant qu'une nouvelle version nighly ne soit publiée sur PyPI).
zh_hans: 在同一天合并拉取请求（即在新版本发布到 PyPI 之前）。

source: Publishing a pre-release
fr: Publier une pré-version
zh_hans: 发布预发布版本

source: Pre-release naming
fr: Nom de la pré-version
zh_hans: 释放前命名

source: PyPI supports pre-releases (alpha, beta, release candiate). Pre-releases MUST use one of the following naming patterns:
fr: PyPI prend en charge les préversions (alpha, bêta, version candiate). Les préversions DOIVENT utiliser l'un des modèles de dénomination suivants :
zh_hans: PyPI 支持预发布版本（alpha、beta、release candiate）。预发布版本必须使用以下命名模式之一：

source: Alpha: ``MAJOR.MINOR.PATCHaN``
zh_hans: 阿尔法 ``MAJOR.MINOR.PATCHaN``

source: Beta: ``MAJOR.MINOR.PATCHbN``
fr: Bêta : ``MAJOR.MINOR.PATCHbN``
zh_hans: 贝塔： ``MAJOR.MINOR.PATCHbN``

source: Release candiate (RC): ``MAJOR.MINOR.PATCHrcN``
fr: Candidat à la publication (RC) : ``MAJOR.MINOR.PATCHrcN``
zh_hans: 版本代号 (RC)： ``MAJOR.MINOR.PATCHrcN``

source: Examples include:
fr: Voici quelques exemples :
zh_hans: 例子包括：

source: This is in line with PEP-440 and the recommendations from the Python Packaging Authority (PyPA):
fr: Ceci est conforme au PEP-440 et aux recommandations de l'Autorité de l'emballage Python (PyPA) :
zh_hans: 这符合 PEP-440 和 Python 包装管理局 (PyPA) 的建议：

source: `PyPA Choosing a versioning scheme <https://packaging.python.org/en/latest/guides/distributing-packages-using-setuptools/#choosing-a-versioning-scheme>`_
fr: `PyPA Choisir un schéma de version <https://packaging.python.org/en/latest/guides/distributing-packages-using-setuptools/#choosing-a-versioning-scheme>`_
zh_hans: `PyPA 选择版本控制方案 <https://packaging.python.org/en/latest/guides/distributing-packages-using-setuptools/#choosing-a-versioning-scheme>`_

source: Note that the approach defined by PyPA is not compatible with SemVer 2.0.0 spec, for details consult the `Semantic Versioning Specification <https://semver.org/spec/v2.0.0.html#spec-item-11>`_ (specifically item 11 on precedence).
fr: Note que l'approche définie par PyPA n'est pas compatible avec la spécification SemVer 2.0.0, pour plus de détails, consulte la `Semantic Versioning Specification <https://semver.org/spec/v2.0.0.html#spec-item-11>`_ (en particulier le point 11 sur la préséance).
zh_hans: 请注意，PyPA 所定义的方法与 SemVer 2.0.0 规范不兼容，详情请查阅《语义版本规范》<https://semver.org/spec/v2.0.0.html#spec-item-11>`_（特别是关于优先级的第 11 项）。

source: Pre-release classification
fr: Classification avant publication
zh_hans: 发布前分类

source: Should the next pre-release be called alpha, beta, or release candidate?
fr: La prochaine préversion doit-elle être appelée alpha, bêta ou release candidate ?
zh_hans: 下一个预发布版应该叫阿尔法版、贝塔版还是候选发布版？

source: RC: feature complete, no known issues (apart from issues that are classified as "won't fix" for the next stable release) - if no issues surface this will become the next stable release
fr: RC : fonctionnalités complètes, pas de problèmes connus (à l'exception des problèmes classés comme "à ne pas corriger" pour la prochaine version stable) - si aucun problème n'apparaît, cette version deviendra la prochaine version stable
zh_hans: RC：功能完整，无已知问题（除了下一个稳定版中被列为 "不会修复 "的问题）--如果没有问题出现，这将成为下一个稳定版

source: Beta: feature complete, allowed to have known issues
fr: Bêta : fonctionnalité complète, autorisée à avoir des problèmes connus
zh_hans: 贝塔版：功能完整，允许存在已知问题

source: Alpha: not feature complete, allowed to have known issues
fr: Alpha : les fonctionnalités ne sont pas complètes, les problèmes connus sont autorisés
zh_hans: 阿尔法版：功能不完整，允许存在已知问题

source: Set up a virtual env
fr: Mettre un environment virtuel en place
zh_hans: 建立虚拟环境

source: It is recommended to run your Python setup within a virtual environment. This guide shows three different examples how to create a virtual environment with pyenv virtualenv, poetry, or Anaconda. You can follow the instructions or choose your preferred setup.
fr: Il est recommandé d'exécuter ton installation Python dans un environnement virtuel. Ce guide montre trois exemples différents de création d'un environnement virtuel avec pyenv virtualenv, poetry ou Anaconda. Tu peux suivre les instructions ou choisir la configuration que tu préfères.
zh_hans: 建议在虚拟环境中运行 Python 设置。本指南展示了如何使用 pyenv virtualenv、poes 或 Anaconda 创建虚拟环境的三个不同示例。您可以按照说明或选择您喜欢的设置。

source: Python Version
fr: Version Python
zh_hans: Python 版本

source: Flower requires at least `Python 3.8 <https://docs.python.org/3.8/>`_, but `Python 3.10 <https://docs.python.org/3.10/>`_ or above is recommended.
zh_hans: Flower 至少需要 `Python 3.8 <https://docs.python.org/3.8/>`_，但建议使用 `Python 3.10 <https://docs.python.org/3.10/>`_或更高版本。

source: Virutualenv with Pyenv/Virtualenv
fr: Virutualenv avec Pyenv/Virtualenv
zh_hans: Virutualenv 和 Pyenv/Virtualenv

source: One of the recommended virtual environment is `pyenv <https://github.com/pyenv/pyenv>`_/`virtualenv <https://github.com/pyenv/pyenv-virtualenv>`_. Please see `Flower examples <https://github.com/adap/flower/tree/main/examples/>`_ for details.
fr: L'un des environnements virtuels recommandés est `pyenv <https://github.com/pyenv/pyenv>`_/`virtualenv <https://github.com/pyenv/pyenv-virtualenv>`_. Voir `Flower examples <https://github.com/adap/flower/tree/main/examples/>`_ pour plus de détails.
zh_hans: 其中一个推荐的虚拟环境是 `pyenv <https://github.com/pyenv/pyenv>`_/`virtualenv <https://github.com/pyenv/pyenv-virtualenv>`_。详情请参见 `Flower 示例 <https://github.com/adap/flower/tree/main/examples/>`_。

source: Once Pyenv is set up, you can use it to install `Python Version 3.10 <https://docs.python.org/3.10/>`_ or above:
zh_hans: 一旦设置好 Pyenv，就可以用它来安装 `Python 3.10 <https://docs.python.org/3.10/>`_ 或更高版本：

source: Create the virtualenv with:
fr: Crée le virtualenv avec :
zh_hans: 创建虚拟环境：

source: Activate the virtualenv by running the following command:
fr: Active la virtualenv en exécutant la commande suivante :
zh_hans: 运行以下命令激活 virtualenv：

source: Virtualenv with Poetry
fr: Virtualenv et la poésie
zh_hans: 有诗意的 Virtualenv

source: The Flower examples are based on `Poetry <https://python-poetry.org/docs/>`_ to manage dependencies. After installing Poetry you simply create a virtual environment with:
fr: Les exemples de Flower sont basés sur `Poetry <https://python-poetry.org/docs/>`_ pour gérer les dépendances. Après l'installation de Poetry, il te suffit de créer un environnement virtuel avec :
zh_hans: Flower 示例基于 `Poetry <https://python-poetry.org/docs/>`_ 来管理依赖关系。安装 Poetry 后，只需创建一个虚拟环境即可：

source: If you open a new terminal you can activate the previously created virtual environment with the following command:
fr: Si tu ouvres un nouveau terminal, tu peux activer l'environnement virtuel précédemment créé avec la commande suivante :
zh_hans: 如果打开一个新终端，可以使用以下命令激活之前创建的虚拟环境：

source: Virtualenv with Anaconda
fr: Virtualenv avec Anaconda
zh_hans: 使用 Anaconda 的 Virtualenv

source: If you prefer to use Anaconda for your virtual environment then install and setup the `conda <https://docs.conda.io/projects/conda/en/latest/user-guide/install/index.html>`_ package. After setting it up you can create a virtual environment with:
fr: Si tu préfères utiliser Anaconda pour ton environnement virtuel, installe et configure le paquet `conda <https://docs.conda.io/projects/conda/en/latest/user-guide/install/index.html>`_. Après l'avoir configuré, tu peux créer un environnement virtuel avec :
zh_hans: 如果你更喜欢在虚拟环境中使用 Anaconda，那么请安装并设置 `conda <https://docs.conda.io/projects/conda/en/latest/user-guide/install/index.html>`_ 软件包。设置完成后，您就可以使用以下工具创建虚拟环境：

source: and activate the virtual environment with:
fr: et active l'environnement virtuel avec :
zh_hans: 并激活虚拟环境：

source: And then?
fr: Et ensuite ?
zh_hans: 然后呢？

source: As soon as you created your virtual environment you clone one of the `Flower examples <https://github.com/adap/flower/tree/main/examples/>`_.
fr: Dès que tu as créé ton environnement virtuel, tu clones l'un des exemples de `Flower <https://github.com/adap/flower/tree/main/examples/>`_.
zh_hans: 创建虚拟环境后，您可以克隆一个 `Flower 示例 <https://github.com/adap/flower/tree/main/examples/>`_。

source: Write documentation
fr: Rédiger de la documentation
zh_hans: 编写文件

source: Project layout
fr: Schéma du projet
zh_hans: 项目布局

source: The Flower documentation lives in the ``doc`` directory. The Sphinx-based documentation system supports both reStructuredText (``.rst`` files) and Markdown (``.md`` files).
fr: La documentation de Flower se trouve dans le répertoire `doc``. Le système de documentation basé sur Sphinx supporte à la fois reStructuredText (fichiers `.rst`) et Markdown (fichiers `.md`).
zh_hans: Flower 文档位于 ``doc`` 目录中。基于 Sphinx 的文档系统支持 reStructuredText（``.rst`` 文件）和 Markdown（``.md`` 文件）。

source: Note that, in order to build the documentation locally (with ``poetry run make html``, like described below), `Pandoc <https://pandoc.org/installing.html>_` needs to be installed on the system.
fr: Noter que, pour compiler la documentation localement (avec ``poetry run make html``, comme décrit plus bas), `Pandoc <https://pandoc.org/installing.html>_` doit être installé sur le système.
zh_hans: 请注意，要在本地构建文档（使用 ``poetry run make html``，如下所述），系统上必须安装 ``Pandoc <https://pandoc.org/installing.html>_`。

source: Edit an existing page
fr: Modifier une page existante
zh_hans: 编辑现有页面

source: Edit an existing ``.rst`` (or ``.md``) file under ``doc/source/``
fr: Modifier un fichier ``.rst`` (ou ``.md``) existant sous ``doc/source/``
zh_hans: 编辑 ``doc/source/`` 下现有的 ``.rst`` (或 ``.md``) 文件

source: Compile the docs: ``cd doc``, then ``poetry run make html``
fr: Compilez les documents : ``cd doc``, puis ``poetry run make html``
zh_hans: 编译文档： cd doc``，然后 ``poetry run make html``

source: Open ``doc/build/html/index.html`` in the browser to check the result
fr: Ouvre ``doc/build/html/index.html`` dans le navigateur pour vérifier le résultat
zh_hans: 在浏览器中打开 ``doc/build/html/index.html`` 查看结果

source: Create a new page
fr: Créer une nouvelle page
zh_hans: 创建新页面

source: Add new ``.rst`` file under ``doc/source/``
fr: Ajouter un nouveau fichier ``.rst`` sous ``doc/source/``
zh_hans: 在 ``doc/source/`` 下添加新的 ``.rst`` 文件

source: Add content to the new ``.rst`` file
fr: Ajoute du contenu au nouveau fichier ``.rst``
zh_hans: 为新的 ``.rst`` 文件添加内容

source: Link to the new rst from ``index.rst``
fr: Lien vers le nouveau rst depuis ``index.rst``
zh_hans: 从 ``index.rst`` 链接到新的 rst

source: Good first contributions
fr: Bonnes premières contributions
zh_hans: 良好的首批捐款

source: We welcome contributions to Flower! However, it is not always easy to know where to start. We therefore put together a few recommendations on where to start to increase your chances of getting your PR accepted into the Flower codebase.
fr: Les contributions à Flower sont les bienvenues ! Cependant, il n'est pas toujours facile de savoir par où commencer. Nous avons donc rassemblé quelques recommandations sur les points de départ pour augmenter tes chances de voir ton PR accepté dans la base de code de Flower.
zh_hans: 我们欢迎为《鲜花》投稿！然而，要知道从哪里开始并非易事。因此，我们提出了一些建议，告诉您从哪里开始，以增加您的 PR 被 Flower 代码库接受的机会。

source: Where to start
fr: Par où commencer
zh_hans: 从哪里开始

source: Until the Flower core library matures it will be easier to get PR's accepted if they only touch non-core areas of the codebase. Good candidates to get started are:
fr: Jusqu'à ce que la bibliothèque centrale de Flower arrive à maturité, il sera plus facile de faire accepter les RP s'ils ne touchent que des zones non essentielles de la base de code. Les bons candidats pour commencer sont :
zh_hans: 在 Flower 核心库成熟之前，如果 PR 只涉及代码库中的非核心区域，则会更容易被接受。可以从以下方面入手：

source: Documentation: What's missing? What could be expressed more clearly?
fr: Documentation : Qu'est-ce qui manque ? Qu'est-ce qui pourrait être exprimé plus clairement ?
zh_hans: 文件： 缺少什么？哪些内容可以表达得更清楚？

source: Baselines: See below.
fr: Références : voir ci-dessous.
zh_hans: 基线： 见下文。

source: Examples: See below.
fr: Exemples : voir ci-dessous.
zh_hans: 举例说明： 见下文。

source: Request for Flower Baselines
fr: Demande pour une nouvelle Flower Baseline
zh_hans: Flower 基线申请

source: If you are not familiar with Flower Baselines, you should probably check-out our `contributing guide for baselines <https://flower.dev/docs/contributing-baselines.html>`_.
fr: Si tu n'es pas familier avec les Flower Baselines, tu devrais probablement consulter notre `guide de contribution pour les baselines <https://flower.dev/docs/contributing-baselines.html>`_.
zh_hans: 如果您对 Flower Baselines 还不熟悉，也许应该看看我们的 "基线贡献指南 <https://flower.dev/docs/contributing-baselines.html>`_"。

source: You should then check out the open `issues <https://github.com/adap/flower/issues?q=is%3Aopen+is%3Aissue+label%3A%22new+baseline%22>`_ for baseline requests. If you find a baseline that you'd like to work on and that has no assignes, feel free to assign it to yourself and start working on it!
fr: Tu devrais ensuite consulter les `issues ouvertes <https://github.com/adap/flower/issues?q=is%3Aopen+is%3Aissue+label%3A%22new+baseline%22>`_ pour les demandes de lignes de base. Si tu trouves une ligne de base sur laquelle tu aimerais travailler et qui n'a pas d'assignés, n'hésite pas à te l'attribuer et à commencer à travailler dessus !
zh_hans: 然后，您应该查看开放的 `issues <https://github.com/adap/flower/issues?q=is%3Aopen+is%3Aissue+label%3A%22new+baseline%22>`_ 基线请求。如果您发现了自己想做的基线，而它还没有被分配，请随时把它分配给自己，然后开始工作！

source: Otherwise, if you don't find a baseline you'd like to work on, be sure to open a new issue with the baseline request template!
fr: Sinon, si tu ne trouves pas de ligne de base sur laquelle tu aimerais travailler, n'oublie pas d'ouvrir un nouveau problème à l'aide du modèle de demande de ligne de base !
zh_hans: 否则，如果您没有找到想要处理的基线，请务必使用基线请求模板打开一个新问题！

source: Request for examples
fr: Demande pour un nouveau Flower Example
zh_hans: 要求提供范例

source: We wish we had more time to write usage examples because we believe they help users to get started with building what they want to build. Here are a few ideas where we'd be happy to accept a PR:
fr: Nous aimerions avoir plus de temps pour écrire des exemples d'utilisation car nous pensons qu'ils aident les utilisateurs à commencer à construire ce qu'ils veulent construire. Voici quelques idées pour lesquelles nous serions heureux d'accepter un RP :
zh_hans: 我们希望有更多的时间来撰写使用示例，因为我们相信这些示例可以帮助用户开始构建他们想要构建的东西。以下是我们乐意接受 PR 的几个想法：

source: Llama 2 fine-tuning, with Hugging Face Transformers and PyTorch
fr: LLaMA 2 fine-tuning avec Hugging Face et PyTorch
zh_hans: 微调 "拉玛 2"，使用 "抱脸变形金刚 "和 PyTorch

source: Android ONNX on-device training
fr: Training sur téléphone à l'aide d'Android ONNX
zh_hans: 安卓 ONNX 设备上培训

source: Secure Aggregation Protocols
fr: Protocoles d'agrégation sécurisés
zh_hans: 安全聚合协议

source: Include SecAgg, SecAgg+, and LightSecAgg protocol. The LightSecAgg protocol has not been implemented yet, so its diagram and abstraction may not be accurate in practice. The SecAgg protocol can be considered as a special case of the SecAgg+ protocol.
fr: Inclut les protocoles SecAgg, SecAgg+ et LightSecAgg. Le protocole LightSecAgg n'a pas encore été mis en œuvre, de sorte que son diagramme et son abstraction peuvent ne pas être exacts dans la pratique. Le protocole SecAgg peut être considéré comme un cas particulier du protocole SecAgg+.
zh_hans: 包括 SecAgg、SecAgg+ 和 LightSecAgg 协议。LightSecAgg 协议尚未实施，因此其图表和抽象在实践中可能并不准确。SecAgg 协议可视为 SecAgg+ 协议的特例。

source: The :code:`SecAgg+` abstraction
fr: L'abstraction :code:`SecAgg+`
zh_hans: 代码：`SecAgg+` 抽象

source: In this implementation, each client will be assigned with a unique index (int) for secure aggregation, and thus many python dictionaries used have keys of int type rather than ClientProxy type.
fr: Dans cette implémentation, chaque client se verra attribuer un index unique (int) pour une agrégation sécurisée, et donc de nombreux dictionnaires python utilisés ont des clés de type int plutôt que de type ClientProxy.
zh_hans: 在此实现中，将为每个客户端分配一个唯一索引（int），以确保聚合的安全性，因此使用的许多 python 字典的键都是 int 类型，而不是 ClientProxy 类型。

source: The Flower server will execute and process received results in the following order:
fr: Le serveur Flower exécutera et traitera les résultats reçus dans l'ordre suivant :
zh_hans: Flower 服务器将按以下顺序执行和处理收到的结果：

source: The :code:`LightSecAgg` abstraction
fr: L'abstraction :code:`LightSecAgg`
zh_hans: 代码：`LightSecAgg` 抽象

source: Types
zh_hans: 类型

source: Contribute on GitHub
fr: Contribuer sur GitHub
zh_hans: 在 GitHub 上投稿

source: This guide is for people who want to get involved with Flower, but who are not used to contributing to GitHub projects.
fr: Ce guide s'adresse aux personnes qui veulent participer au développement de Flower mais qui n'ont pas l'habitude de contribuer à des projets GitHub.
zh_hans: 本指南适用于想参与 Flower，但不习惯为 GitHub 项目贡献的人。

source: If you're familiar with how contributing on GitHub works, you can directly checkout our `getting started guide for contributors <https://flower.dev/docs/getting-started-for-contributors.html>`_ and examples of `good first contributions <https://flower.dev/docs/good-first-contributions.html>`_.
fr: Si tu es familier avec le fonctionnement des contributions sur GitHub, tu peux directement consulter notre `guide de démarrage pour les contributeurs <https://flower.dev/docs/getting-started-for-contributors.html>`_ et des exemples de `bonnes premières contributions <https://flower.dev/docs/good-first-contributions.html>`_.
zh_hans: 如果您熟悉如何在 GitHub 上贡献，可以直接查看我们的 "贡献者入门指南" <https://flower.dev/docs/getting-started-for-contributors.html>`_ 和 "优秀的首次贡献示例" <https://flower.dev/docs/good-first-contributions.html>`_。

source: Setting up the repository
fr: Mise en place du référentiel
zh_hans: 建立资源库

source: **Create a GitHub account and setup Git**
fr: **Créer un compte GitHub et configurer Git**
zh_hans: **创建 GitHub 账户并设置 Git**

source: Git is a distributed version control tool. This allows for an entire codebase's history to be stored and every developer's machine. It is a software that will need to be installed on your local machine, you can follow this `guide <https://docs.github.com/en/get-started/quickstart/set-up-git>`_ to set it up.
fr: Git est un outil de contrôle de version distribué. Il permet de stocker l'historique d'une base de code entière sur la machine de chaque développeur. C'est un logiciel qui devra être installé sur ta machine locale, tu peux suivre ce `guide <https://docs.github.com/en/get-started/quickstart/set-up-git>`_ pour le mettre en place.
zh_hans: Git 是一种分布式版本控制工具。它可以将整个代码库的历史记录保存在每个开发人员的机器上。您需要在本地计算机上安装该软件，可以按照本指南 <https://docs.github.com/en/get-started/quickstart/set-up-git>`_ 进行设置。

source: GitHub, itself, is a code hosting platform for version control and collaboration. It allows for everyone to collaborate and work from anywhere on remote repositories.
fr: GitHub, lui-même, est une plateforme d'hébergement de code pour le contrôle des versions et la collaboration. Il permet à chacun de collaborer et de travailler de n'importe où sur des dépôts à distance.
zh_hans: GitHub 本身是一个用于版本控制和协作的代码托管平台。它允许每个人在任何地方对远程仓库进行协作和工作。

source: If you haven't already, you will need to create an account on `GitHub <https://github.com/signup>`_.
fr: Si ce n'est pas déjà fait, tu devras créer un compte sur `GitHub <https://github.com/signup>`_.
zh_hans: 如果还没有，您需要在 `GitHub <https://github.com/signup>`_ 上创建一个账户。
