Repository: lucacorbucci/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: fr, zh_hans

source: The :code:`VirtualClientEngine` schedules, launches and manages `virtual` clients. These clients are identical to `non-virtual` clients (i.e. the ones you launch via the command `flwr.client.start_numpy_client <ref-api-flwr.html#start-numpy-client>`_) in the sense that they can be configure by creating a class inheriting, for example, from `flwr.client.NumPyClient <ref-api-flwr.html#flwr.client.NumPyClient>`_ and therefore behave in an identical way. In addition to that, clients managed by the :code:`VirtualClientEngine` are:
zh_hans: 代码:`VirtualClientEngine`调度、启动和管理`虚拟`客户端。这些客户端与 "非虚拟 "客户端（即通过命令 `flwr.client.start_numpy_client <ref-api-flwr.html#start-numpy-client>`_启动的客户端）完全相同，它们可以通过创建一个继承自 "flwr.client.NumPyClient <ref-api-flwr.html#flwr.client.NumPyClient>`_" 的类来配置，因此行为方式也完全相同。除此之外，由 :code:`VirtualClientEngine` 管理的客户端还包括：

source: That's it for the client. We only have to implement :code:`Client` or :code:`NumPyClient` and call :code:`fl.client.start_client()` or :code:`fl.client.start_numpy_client()`. The string :code:`"0.0.0.0:8080"` tells the client which server to connect to. In our case we can run the server and the client on the same machine, therefore we use :code:`"0.0.0.0:8080"`. If we run a truly federated workload with the server and clients running on different machines, all that needs to change is the :code:`server_address` we pass to the client.
zh_hans: 这就是客户端。我们只需实现 :code:`Client` 或 :code:`NumPyClient` 并调用 :code:`fl.client.start_client()` 或 :code:`fl.client.start_numpy_client()`。字符串 :code:`"0.0.0.0:8080"`会告诉客户端要连接的服务器。在本例中，我们可以在同一台机器上运行服务器和客户端，因此我们使用 :code:`"0.0.0.0:8080"`。如果我们运行的是真正的联邦工作负载，服务器和客户端运行在不同的机器上，那么需要改变的只是传递给客户端的 :code:`server_address`。

source: That's it for the client. We only have to implement :code:`Client` or :code:`NumPyClient` and call :code:`fl.client.start_client()` or :code:`fl.client.start_numpy_client()`. The string :code:`"[::]:8080"` tells the client which server to connect to. In our case we can run the server and the client on the same machine, therefore we use :code:`"[::]:8080"`. If we run a truly federated workload with the server and clients running on different machines, all that needs to change is the :code:`server_address` we point the client at.
zh_hans: 这就是客户端。我们只需实现 :code:`Client` 或 :code:`NumPyClient` 并调用 :code:`fl.client.start_client()` 或 :code:`fl.client.start_numpy_client()`。字符串 :code:`"[::]:8080"`会告诉客户端要连接的服务器。在本例中，我们可以在同一台机器上运行服务器和客户端，因此使用 :code:`"[::]:8080"。如果我们运行的是真正的联邦工作负载，服务器和客户端运行在不同的机器上，那么需要改变的只是客户端指向的 :code:`server_address`。

source: Thank the authors who contributed since the last release. This command helps extract them: ``git log --format='%aN' v1.1.0..HEAD | sort -u``. The command has the same order as ``git shortlog``.
fr: Remerciez les auteurs qui ont contribué depuis la dernière version. Cette commande permet de les extraire : ``git log --format='%aN' v1.1.0..HEAD | sort -u``. La commande a le même ordre que ``git shortlog``.

source: Tag the release commit with the version number as soon as the PR is merged: ``git tag v0.12.3``, then ``git push --tags``
fr: Marquez le commit de la version avec le numéro de version dès que le PR est fusionné : ``git tag v0.12.3``, puis ``git push --tags``

source: Build the release with ``./dev/build.sh``, then publish it with ``./dev/publish.sh``
fr: Construisez la version avec ``./dev/build.sh``, puis publiez-la avec ``./dev/publish.sh``

source: Create an entry in GitHub releases with the release notes for the previously tagged commit and attach the build artifacts (:code:`.whl` and :code:`.tar.gz`).
fr: Crée une entrée dans GitHub releases avec les notes de version pour le commit précédemment étiqueté et attache les artefacts de construction (:code:`.whl` et :code:`.tar.gz`).

source: This tutorial will show you how to use Flower to build a federated version of an existing machine learning workload with `FedBN <https://github.com/med-air/FedBN>`_, a federated training strategy designed for non-iid data. We are using PyTorch to train a Convolutional Neural Network(with Batch Normalization layers) on the CIFAR-10 dataset. When applying FedBN, only few changes needed compared to `Example: PyTorch - From Centralized To Federated <https://flower.dev/docs/example-pytorch-from-centralized-to-federated.html>`_.
fr: Ce tutoriel te montrera comment utiliser Flower pour construire une version fédérée d'une charge de travail d'apprentissage automatique existante avec `FedBN <https://github.com/med-air/FedBN>`_, une stratégie de formation fédérée conçue pour les données non-identifiées. Nous utilisons PyTorch pour former un réseau neuronal convolutif (avec des couches de normalisation par lots) sur l'ensemble de données CIFAR-10. Lors de l'application de FedBN, seules quelques modifications sont nécessaires par rapport à `Exemple : PyTorch - De la centralisation à la fédération <https://flower.dev/docs/example-pytorch-from-centralized-to-federated.html>`_.

source: All files are revised based on `Example: PyTorch - From Centralized To Federated <https://flower.dev/docs/example-pytorch-from-centralized-to-federated.html>`_. The only thing to do is modifying the file called :code:`cifar.py`, revised part is shown below:
fr: Tous les fichiers sont révisés sur la base de `Exemple : PyTorch - From Centralized To Federated <https://flower.dev/docs/example-pytorch-from-centralized-to-federated.html>`_. La seule chose à faire est de modifier le fichier appelé :code:`cifar.py`, la partie révisée est montrée ci-dessous :

source: If you have read `Example: PyTorch - From Centralized To Federated <https://flower.dev/docs/example-pytorch-from-centralized-to-federated.html>`_, the following parts are easy to follow, onyl :code:`get_parameters` and :code:`set_parameters` function in :code:`client.py` needed to revise. If not, please read the `Example: PyTorch - From Centralized To Federated <https://flower.dev/docs/example-pytorch-from-centralized-to-federated.html>`_. first.
fr: Si vous avez lu `Exemple : PyTorch - From Centralized To Federated <https://flower.dev/docs/example-pytorch-from-centralized-to-federated.html>`_, les parties suivantes sont faciles à suivre, seules les fonctions :code:`get_parameters` et :code:`set_parameters` dans :code:`client.py` ont besoin d'être révisées. Si ce n'est pas le cas, veuillez lire `Exemple : PyTorch - From Centralized To Federated <https://flower.dev/docs/example-pytorch-from-centralized-to-federated.html>`. d'abord.

source: :code:`evaluate`
fr: :code:`évaluer`

source: This can be achieved by customizing an existing strategy or by `implementing a custom strategy from scratch <https://flower.dev/docs/how-to-implement-strategies.html>`_. Here's a nonsensical example that customizes :code:`FedAvg` by adding a custom ``"hello": "world"`` configuration key/value pair to the config dict of a *single client* (only the first client in the list, the other clients in this round to not receive this "special" config value):
fr: Ceci peut être réalisé en personnalisant une stratégie existante ou en `mettant en œuvre une stratégie personnalisée à partir de zéro <https://flower.dev/docs/framework/how-to-implement-strategies.html>`_. Voici un exemple absurde qui personnalise :code:`FedAvg` en ajoutant une paire clé/valeur de configuration personnalisée ``"hello" : "world"`` au config dict d'un *seul client* (uniquement le premier client de la liste, les autres clients de cette série ne recevant pas cette valeur de configuration "spéciale") :

source: ``weights_to_parameters`` --> ``ndarrays_to_parameters``
fr: ``Poids_à_paramètres`` --> ``Réseaux_à_paramètres``

source: Writing a fully custom strategy is a bit more involved, but it provides the most flexibility. Read the `Implementing Strategies <implementing-strategies.html>`_ guide to learn more.
fr: L'écriture d'une stratégie entièrement personnalisée est un peu plus complexe, mais c'est celle qui offre le plus de souplesse. Lis le guide `Implémentation des stratégies <how-to-implement-strategies.html>`_ pour en savoir plus.

source: start_simulation
fr: démarrer_simulation

source: server.start_server
fr: serveur.start_server

source: server.strategy
fr: stratégie.du.serveur

source: server.strategy.Strategy
fr: serveur.stratégie.Stratégie

source: server.strategy.FedAvg
fr: serveur.stratégie.FedAvg

source: server.strategy.FedAvgM
fr: stratégie.serveur.FedAvgM

source: server.strategy.FedOpt
fr: serveur.stratégie.FedOpt

source: server.strategy.FedProx
fr: serveur.stratégie.FedProx

source: server.strategy.FedAdagrad
fr: serveur.stratégie.FedAdagrad

source: server.strategy.FedAdam
fr: serveur.stratégie.FedAdam

source: server.strategy.FedYogi
fr: serveur.stratégie.FedYogi

source: [@rtaiello](https://github.com/rtaiello), [@g-pichler](https://github.com/g-pichler), [@rob-luke](https://github.com/rob-luke), [@andreea-zaharia](https://github.com/andreea-zaharia), [@kinshukdua](https://github.com/kinshukdua), [@nfnt](https://github.com/nfnt), [@tatiana-s](https://github.com/tatiana-s), [@TParcollet](https://github.com/TParcollet), [@vballoli](https://github.com/vballoli), [@negedng](https://github.com/negedng), [@RISHIKESHAVAN](https://github.com/RISHIKESHAVAN), [@hei411](https://github.com/hei411), [@SebastianSpeitel](https://github.com/SebastianSpeitel), [@AmitChaulwar](https://github.com/AmitChaulwar), [@Rubiel1](https://github.com/Rubiel1), [@FANTOME-PAN](https://github.com/FANTOME-PAN), [@Rono-BC](https://github.com/Rono-BC), [@lbhm](https://github.com/lbhm), [@sishtiaq](https://github.com/sishtiaq), [@remde](https://github.com/remde), [@Jueun-Park](https://github.com/Jueun-Park), [@architjen](https://github.com/architjen), [@PratikGarai](https://github.com/PratikGarai), [@mrinaald](https://github.com/mrinaald), [@zliel](https://github.com/zliel), [@MeiruiJiang](https://github.com/MeiruiJiang), [@sandracl72](https://github.com/sandracl72), [@gubertoli](https://github.com/gubertoli), [@Vingt100](https://github.com/Vingt100), [@MakGulati](https://github.com/MakGulati), [@cozek](https://github.com/cozek), [@jafermarq](https://github.com/jafermarq), [@sisco0](https://github.com/sisco0), [@akhilmathurs](https://github.com/akhilmathurs), [@CanTuerk](https://github.com/CanTuerk), [@mariaboerner1987](https://github.com/mariaboerner1987), [@pedropgusmao](https://github.com/pedropgusmao), [@tanertopal](https://github.com/tanertopal), [@danieljanes](https://github.com/danieljanes).
fr: [@rtaiello](https://github.com/rtaiello), [@g-pichler](https://github.com/g-pichler), [@rob-luke](https://github.com/rob-luke), [@andreea-zaharia](https://github.com/andreea-zaharia), [@kinshukdua](https://github.com/kinshukdua), [@nfnt](https://github.com/nfnt), [@tatiana-s](https://github.com/tatiana-s), [@TParcollet](https://github.com/TParcollet), [@vballoli](https://github.com/vballoli), [@negedng](https://github.com/negedng), [@RISHIKESHAVAN](https://github.com/RISHIKESHAVAN), [@hei411](https://github.com/hei411), [@SebastianSpeitel](https://github.com/SebastianSpeitel), [@AmitChaulwar](https://github.com/AmitChaulwar), [@Rubiel1](https://github.com/Rubiel1), [@FANTOME-PAN](https://github.com/FANTOME-PAN), [@Rono-BC](https://github.com/Rono-BC), [@lbhm](https://github.com/lbhm), [@sishtiaq](https://github.com/sishtiaq), [@remde](https://github.com/remde), [@Jueun-Park](https://github.com/Jueun-Park), [@architjen](https://github.com/architjen), [@PratikGarai](https://github.com/PratikGarai), [@mrinaald](

source: `strategy = FedAvg(fraction_fit=0.1, fraction_evaluate=0.1)`
fr: `stratégie = FedAvg(fraction_fit=0.1, fraction_evaluate=0.1)`

source: `quickstart_pytorch`
fr: `quickstart_pytorch` (démarrage rapide)

source: `advanced_tensorflow`
fr: `advanced_tensorflow` (en anglais)

source: New documentation for [implementing strategies](https://flower.dev/docs/how-to-implement-strategies.html) ([#1097](https://github.com/adap/flower/pull/1097), [#1175](https://github.com/adap/flower/pull/1175))
fr: Nouvelle documentation pour [mettre en œuvre des stratégies](https://flower.dev/docs/framework/how-to-implement-strategies.html) ([#1097](https://github.com/adap/flower/pull/1097), [#1175](https://github.com/adap/flower/pull/1175))

source: `PyTorch: From Centralized To Federated (Tutorial) <https://flower.dev/docs/example-pytorch-from-centralized-to-federated.html>`_
fr: `PyTorch : De la centralisation à la fédération (Tutoriel) <https://flower.dev/docs/example-pytorch-from-centralized-to-federated.html>`_

source: `Flower meets KOSMoS <https://www.kosmos-bmbf.de/wp-content/uploads/sites/13/2021/05/Talk-Flower-Summit-2021.pdf>`_.
fr: `Flower rencontre KOSMoS <https://www.kosmos-bmbf.de/wp-content/uploads/sites/13/2021/05/Talk-Flower-Summit-2021.pdf>`_.

source: `Flower meets Talan GitHub Repository <https://gitlab.com/Talan_Innovation_Factory/food-waste-prevention>`_ .
fr: `Flower rencontre Talan Dépôt GitHub <https://gitlab.com/Talan_Innovation_Factory/food-waste-prevention>`_ .

source: Let's build a federated learning system using PyTorch Lightning and Flower!
fr: Construisons un système d'apprentissage fédéré en utilisant PyTorch Lightning et Flower !

source: Let's build a horizontal federated learning system using XGBoost and Flower!
fr: Construisons un système d'apprentissage fédéré horizontal en utilisant XGBoost et Flower !

source: Flower
fr: Fleur
