Repository: lucacorbucci/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: fr, zh_hans

source: The idea forming the enhancement should already have been discussed or pitched in the community. As such, it needs a champion, usually the author, who shepherds the enhancement. This person also has to find committers to Flower willing to review the proposal.
fr: L'idée à l'origine de l'amélioration doit déjà avoir fait l'objet d'une discussion ou d'une présentation au sein de la communauté. À ce titre, elle a besoin d'un champion, généralement l'auteur, qui se charge de l'amélioration. Cette personne doit également trouver des committers to Flower prêts à examiner la proposition.
zh_hans: 形成增强功能的想法应该已经在社区中讨论过或提出过。因此，它需要一个支持者（通常是作者）来引导增强。这个人还必须找到愿意审核提案的提交者。

source: New enhancements are checked in with a file name in the form of `NNNN-YYYYMMDD-enhancement-title.md`, with `NNNN` being the Flower Enhancement Doc number, to `enhancements`. All enhancements start in `provisional` state as part of a pull request. Discussions are done as part of the pull request review.
fr: Les nouvelles améliorations sont enregistrées avec un nom de fichier de la forme `NNN-YYYMMDD-enhancement-title.md`, `NNNN` étant le numéro du document d'amélioration de la fleur, dans `enhancements`. Toutes les améliorations commencent à l'état `provisionnel` dans le cadre d'une demande d'extraction. Les discussions sont effectuées dans le cadre de l'examen de la demande d'extraction.
zh_hans: 新的增强功能以 `NNNN-YYYYMMDD-enhancement-title.md` 的文件名签入，其中 `NNNN` 是花朵增强文档的编号，并将其转入 `enhancements`。作为拉取请求（pull request）的一部分，所有增强功能都从 `provisional` 状态开始。讨论是作为拉取请求审查的一部分进行的。

source: Once an enhancement has been reviewed and approved, its status is changed to `implementable`. The actual implementation is then done in separate pull requests. These pull requests should mention the respective enhancement as part of their description. After the implementation is done, the proposal status is changed to `implemented`.
fr: Une fois qu'une amélioration a été examinée et approuvée, son statut passe à `implémentable`. L'implémentation réelle est alors réalisée dans des demandes d'extension séparées. Ces demandes d'extension doivent mentionner l'amélioration concernée dans leur description. Une fois l'implémentation réalisée, le statut de la proposition passe à `implémented`.
zh_hans: 一旦增强功能通过审核和批准，其状态就会变为 `可实施`。实际的实施工作将在单独的拉取请求中完成。这些拉取请求应在其描述中提及相应的增强功能。实施完成后，提案状态将更改为 `已实施`。

source: Under certain conditions, other states are possible. An Enhancement has the following states:
fr: Sous certaines conditions, d'autres états sont possibles. Une amélioration a les états suivants :
zh_hans: 在某些条件下，还可能出现其他状态。增强提案具有以下状态：

source: `provisional`: The enhancement has been proposed and is actively being defined. This is the starting state while the proposal is being fleshed out and actively defined and discussed.
fr: `provisoire` : L'amélioration a été proposée et est en cours de définition. C'est l'état de départ pendant que la proposition est étoffée et activement définie et discutée.
zh_hans: `暂定`： 已提出改进建议并正在积极定义。这是在提案得到充实、积极定义和讨论时的起始状态。

source: `implementable`: The enhancement has been reviewed and approved.
fr: `implementable` : L'amélioration a été examinée et approuvée.
zh_hans: `可实施`： 增强功能已审核通过。

source: `implemented`: The enhancement has been implemented and is no longer actively changed.
fr: `implemented` : L'amélioration a été mise en œuvre et n'est plus activement modifiée.
zh_hans: `已实施`： 增强功能已实施，不再主动更改。

source: `deferred`: The enhancement is proposed but not actively being worked on.
fr: `deferred` : L'amélioration est proposée mais n'est pas activement travaillée.
zh_hans: `推迟`： 已提出改进建议，但尚未积极开展工作。

source: `rejected`: The authors and reviewers have decided that this enhancement is not moving forward.
fr: `rejeté` : Les auteurs et les réviseurs ont décidé que cette amélioration n'allait pas de l'avant.
zh_hans: `拒绝`： 作者和审稿人已决定不再推进该增强功能。

source: `withdrawn`: The authors have withdrawn the enhancement.
fr: `withdrawn` : Les auteurs ont retiré l'amélioration.
zh_hans: `撤回`： 作者已撤回增强功能。

source: `replaced`: The enhancement has been replaced by a new enhancement.
fr: `replaced` : L'amélioration a été remplacée par une nouvelle amélioration.
zh_hans: `已替换`： 增强功能已被新的增强功能取代。

source: Adding an additional process to the ones already provided by GitHub (Issues and Pull Requests) adds more complexity and can be a barrier for potential first-time contributors.
fr: L'ajout d'un processus supplémentaire à ceux déjà fournis par GitHub (Issues et Pull Requests) ajoute plus de complexité et peut constituer un obstacle pour les éventuels nouveaux contributeurs.
zh_hans: 在 GitHub 已提供的流程（问题和拉取请求）之外再增加一个流程，会增加复杂性，并可能成为潜在首次贡献者的障碍。

source: Expanding the proposal template beyond the single-sentence description currently required in the features issue template may be a heavy burden for non-native English speakers.
fr: Élargir le modèle de proposition au-delà de la description d'une seule phrase actuellement requise dans le modèle de questions sur les caractéristiques peut constituer une lourde charge pour les personnes dont l'anglais n'est pas la langue maternelle.
zh_hans: 对于英语非母语者来说，将提案模板扩展到目前要求的单句描述之外可能是一个沉重的负担。

source: GitHub Issues
fr: Questions sur GitHub
zh_hans: GitHub 问题

source: Using GitHub Issues for these kinds of enhancements is doable. One could use, for example, tags, to differentiate and filter them from other issues. The main issue is in discussing and reviewing an enhancement: GitHub issues only have a single thread for comments. Enhancements usually have multiple threads of discussion at the same time for various parts of the doc. Managing these multiple discussions can be confusing when using GitHub Issues.
fr: Il est possible d'utiliser GitHub Issues pour ce type d'améliorations. On pourrait utiliser, par exemple, des balises pour les différencier et les filtrer par rapport aux autres problèmes. Le principal problème concerne la discussion et la révision d'une amélioration : les GitHub Issues n'ont qu'un seul fil de discussion pour les commentaires. Les améliorations ont généralement plusieurs fils de discussion en même temps pour différentes parties de la documentation. La gestion de ces multiples discussions peut être déroutante lorsque l'on utilise GitHub Issues.
zh_hans: 使用 GitHub Issues 进行此类改进是可行的。例如，我们可以使用标签来区分和过滤这些问题。主要的问题在于讨论和审查增强功能： GitHub 问题只有一个评论线程。而增强功能通常会同时有多个讨论线程，针对文档的不同部分。在使用 GitHub 问题时，管理这些多重讨论会很混乱。

source: Google Docs
zh_hans: 谷歌文档

source: Google Docs allow for multiple threads of discussions. But as Google Docs are hosted outside the project, their discoverability by the community needs to be taken care of. A list of links to all proposals has to be managed and made available for the community. Compared to shipping proposals as part of Flower's repository, the potential for missing links is much higher.
fr: Les Google Docs permettent de multiplier les fils de discussion. Mais comme les Google Docs sont hébergés en dehors du projet, il faut veiller à ce que la communauté puisse les découvrir. Une liste de liens vers toutes les propositions doit être gérée et mise à la disposition de la communauté. Par rapport à l'envoi de propositions dans le cadre du référentiel de Flower, le risque de liens manquants est beaucoup plus élevé.
zh_hans: 谷歌文档允许多线程讨论。但是，由于谷歌文档是在项目之外托管的，因此需要注意它们是否能被社区发现。我们必须管理所有提案的链接列表，并提供给社区使用。与作为 Flower 资源库一部分的提案相比，丢失链接的可能性要大得多。

source: FED - Flower Enhancement Doc
fr: FED - Doc pour l'amélioration des fleurs
zh_hans: FED - Flower 增强文件

source: Aggregate evaluation results
zh_hans: 整合评估结果

source: The Flower server does not prescribe a way to aggregate evaluation results, but it enables the user to fully customize result aggregation.
zh_hans: Flower 服务器没有规定整合评估结果的方法，但用户可以完全自定义如何整合。

source: Aggregate Custom Evaluation Results
fr: Agréger les résultats de l'évaluation personnalisée
zh_hans: 自定义整合评估结果

source: The same :code:`Strategy`-customization approach can be used to aggregate custom evaluation results coming from individual clients. Clients can return custom metrics to the server by returning a dictionary:
fr: La même approche de personnalisation :code:`Stratégie` peut être utilisée pour agréger les résultats d'évaluation personnalisés provenant de clients individuels. Les clients peuvent renvoyer des mesures personnalisées au serveur en renvoyant un dictionnaire :
zh_hans: 同样的 :code:`Strategy` 定制方法也可用于汇总来自单个客户端的自定义评估结果。客户端可以通过返回字典的方式向服务器返回自定义指标：

source: The server can then use a customized strategy to aggregate the metrics provided in these dictionaries:
fr: Le serveur peut alors utiliser une stratégie personnalisée pour agréger les mesures fournies dans ces dictionnaires :
zh_hans: 然后，服务器可以使用定制的策略来汇总这些字典中提供的指标：

source: Configure clients
zh_hans: 配置客户端

source: Along with model parameters, Flower can send configuration values to clients. Configuration values can be used for various purposes. They are, for example, a popular way to control client-side hyperparameters from the server.
fr: En plus des paramètres du modèle, Flower peut envoyer des valeurs de configuration aux clients. Les valeurs de configuration peuvent être utilisées à diverses fins. Elles constituent, par exemple, un moyen populaire de contrôler les hyperparamètres côté client à partir du serveur.
zh_hans: 除了模型参数，Flower 还可以向客户端发送配置值。配置值有多种用途。它们是一种从服务器控制客户端超参数的常用方法。

source: Configuration values
fr: Valeurs de configuration
zh_hans: 配置值

source: Configuration values are represented as a dictionary with ``str`` keys and values of type ``bool``, ``bytes``, ``double`` (64-bit precision float), ``int``, or ``str`` (or equivalent types in different languages). Here is an example of a configuration dictionary in Python:
fr: Les valeurs de configuration sont représentées sous forme de dictionnaire avec des clés `str`` et des valeurs de type `bool`, `bytes`, `double` (float de précision 64 bits), `int`, ou `str` (ou des types équivalents dans d'autres langages). Voici un exemple de dictionnaire de configuration en Python :
zh_hans: 配置值以字典的形式表示，字典的键为 ``str``，值的类型为 ``bool``、``bytes``、``double``（64 位精度浮点型）、``int``或 ``str`（或不同语言中的等效类型）。下面是一个 Python 配置字典的示例：

source: Flower serializes these configuration dictionaries (or *config dict* for short) to their ProtoBuf representation, transports them to the client using gRPC, and then deserializes them back to Python dictionaries.
fr: Flower sérialise ces dictionnaires de configuration (ou *config dict* en abrégé) dans leur représentation ProtoBuf, les transporte vers le client à l'aide de gRPC, puis les désérialise à nouveau en dictionnaires Python.
zh_hans: Flower 将这些配置字典（简称 *config dict*）序列化为 ProtoBuf 表示形式，使用 gRPC 将其传输到客户端，然后再反序列化为 Python 字典。

source: Currently, there is no support for directly sending collection types (e.g., ``Set``, ``List``, ``Map``) as values in configuration dictionaries. There are several workarounds to send collections as values by converting them to one of the supported value types (and converting them back on the client-side).
fr: Actuellement, il n'est pas possible d'envoyer directement des types de collections (par exemple, ``Set``, ``List``, ``Map``) en tant que valeurs dans les dictionnaires de configuration. Il existe plusieurs solutions pour envoyer des collections en tant que valeurs en les convertissant en l'un des types de valeurs pris en charge (et en les reconvertissant du côté client).
zh_hans: 目前，还不支持在配置字典中直接发送作为值的集合类型（例如，`Set``, `List`, `Map``）。有几种变通方法可将集合转换为支持的值类型之一（并在客户端将其转换回），从而将集合作为值发送。

source: One can, for example, convert a list of floating-point numbers to a JSON string, then send the JSON string using the configuration dictionary, and then convert the JSON string back to a list of floating-point numbers on the client.
fr: On peut, par exemple, convertir une liste de nombres à virgule flottante en une chaîne JSON, puis envoyer la chaîne JSON à l'aide du dictionnaire de configuration, et enfin reconvertir la chaîne JSON en une liste de nombres à virgule flottante sur le client.
zh_hans: 例如，可以将浮点数列表转换为 JSON 字符串，然后使用配置字典发送 JSON 字符串，再在客户端将 JSON 字符串转换回浮点数列表。

source: Configuration through built-in strategies
fr: Configuration par le biais de stratégies intégrées
zh_hans: 通过内置策略进行配置

source: The easiest way to send configuration values to clients is to use a built-in strategy like :code:`FedAvg`. Built-in strategies support so-called configuration functions. A configuration function is a function that the built-in strategy calls to get the configuration dictionary for the current round. It then forwards the configuration dictionary to all the clients selected during that round.
fr: La façon la plus simple d'envoyer des valeurs de configuration aux clients est d'utiliser une stratégie intégrée comme :code:`FedAvg`. Les stratégies intégrées prennent en charge ce que l'on appelle les fonctions de configuration. Une fonction de configuration est une fonction que la stratégie intégrée appelle pour obtenir le dictionnaire de configuration pour le tour en cours. Elle transmet ensuite le dictionnaire de configuration à tous les clients sélectionnés au cours de ce tour.
zh_hans: 向客户端发送配置值的最简单方法是使用内置策略，如 :code:`FedAvg`。内置策略支持所谓的配置函数。配置函数是内置策略调用的函数，用于获取当前轮的配置字典。然后，它会将配置字典转发给该轮中选择的所有客户端。

source: Let's start with a simple example. Imagine we want to send (a) the batch size that the client should use, (b) the current global round of federated learning, and (c) the number of epochs to train on the client-side. Our configuration function could look like this:
fr: Commençons par un exemple simple. Imaginons que nous voulions envoyer (a) la taille du lot que le client doit utiliser, (b) le cycle global actuel de l'apprentissage fédéré et (c) le nombre d'époques à former du côté client. Notre fonction de configuration pourrait ressembler à ceci :
zh_hans: 让我们从一个简单的例子开始。想象一下，我们想要发送给客户端（a）应该使用的批次大小，（b）当前联邦学习的全局轮次，以及（c）客户端训练的遍历数。我们的配置函数可以是这样的：

source: To make the built-in strategies use this function, we can pass it to ``FedAvg`` during initialization using the parameter :code:`on_fit_config_fn`:
fr: Pour que les stratégies intégrées utilisent cette fonction, nous pouvons la passer à ``FedAvg`` lors de l'initialisation en utilisant le paramètre :code:`on_fit_config_fn` :
zh_hans: 为了让内置策略使用这个函数，我们可以在初始化时使用参数 :code:`on_fit_config_fn` 将它传递给 ``FedAvg`` ：

source: One the client side, we receive the configuration dictionary in ``fit``:
fr: Côté client, nous recevons le dictionnaire de configuration dans ``fit`` :
zh_hans: 在客户端，我们在 ``fit`` 中接收配置字典：

source: There is also an `on_evaluate_config_fn` to configure evaluation, which works the same way. They are separate functions because one might want to send different configuration values to `evaluate` (for example, to use a different batch size).
fr: Il existe également une fonction `on_evaluate_config_fn` pour configurer l'évaluation, qui fonctionne de la même manière. Ce sont des fonctions séparées car on peut vouloir envoyer différentes valeurs de configuration à `evaluate` (par exemple, pour utiliser une taille de lot différente).
zh_hans: 还有一个 `on_evaluate_config_fn` 用于配置评估，其工作方式相同。它们是不同的函数，因为可能需要向 `evaluate` 发送不同的配置值（例如，使用不同的批量大小）。

source: The built-in strategies call this function every round (that is, every time `Strategy.configure_fit` or `Strategy.configure_evaluate` runs). Calling `on_evaluate_config_fn` every round allows us to vary/change the config dict over consecutive rounds. If we wanted to implement a hyperparameter schedule, for example, to increase the number of local epochs during later rounds, we could do the following:
fr: Les stratégies intégrées appellent cette fonction à chaque tour (c'est-à-dire à chaque fois que `Strategy.configure_fit` ou `Strategy.configure_evaluate` s'exécute). Appeler `on_evaluate_config_fn` à chaque tour nous permet de varier/changer le dict de config au cours de tours consécutifs. Si nous voulions mettre en place un calendrier d'hyperparamètres, par exemple, pour augmenter le nombre d'époques locales au cours des derniers tours, nous pourrions faire ce qui suit :
zh_hans: 内置策略每轮都会调用此函数（即每次运行 `Strategy.configure_fit` 或 `Strategy.configure_evaluate` 时）。每轮调用 `on_evaluate_config_fn` 允许我们在连续几轮中改变配置指令。例如，如果我们想实现一个超参数时间表，以增加后几轮的本地遍历次数，我们可以这样做：

source: The :code:`FedAvg` strategy will call this function *every round*.
fr: La stratégie :code:`FedAvg` appellera cette fonction *à chaque tour*.
zh_hans: 代码:`FedAvg`策略*每轮*都会调用该函数。

source: Configuring individual clients
fr: Configuration des clients individuels
zh_hans: 配置个别客户端

source: In some cases, it is necessary to send different configuration values to different clients.
fr: Dans certains cas, il est nécessaire d'envoyer des valeurs de configuration différentes à des clients différents.
zh_hans: 在某些情况下，有必要向不同的客户端发送不同的配置值。

source: This can be achieved by customizing an existing strategy or by `implementing a custom strategy from scratch <https://flower.dev/docs/framework/how-to-implement-strategies.html>`_. Here's a nonsensical example that customizes :code:`FedAvg` by adding a custom ``"hello": "world"`` configuration key/value pair to the config dict of a *single client* (only the first client in the list, the other clients in this round to not receive this "special" config value):
zh_hans: 这可以通过定制现有策略或 `从头开始实施一个定制策略 <https://flower.dev/docs/framework/how-to-implement-strategies.html>`_来实现。下面是一个无厘头的例子，`FedAvg`通过在*单个客户端*的配置指令（config dict）中添加自定义的``"hello"： "world"``配置键/值对添加到此的配置 dict 中（仅列表中的第一个客户端，本轮中的其他客户端不会收到此 "特殊 "配置值）：

source: Configure logging
zh_hans: 配置日志记录

source: The Flower logger keeps track of all core events that take place in federated learning workloads. It presents information by default following a standard message format:
zh_hans: Flower 日志记录器会跟踪联邦学习工作负载中发生的所有核心事件。它默认按照标准信息格式提供信息：

source: containing relevant information including: log message level (e.g. :code:`INFO`, :code:`DEBUG`), a timestamp, the line where the logging took place from, as well as the log message itself. In this way, the logger would typically display information on your terminal as follows:
zh_hans: 相关信息包括：日志信息级别（例如 :code:`INFO`、:code:`DEBUG`）、时间戳、日志记录的行以及日志信息本身。这样，日志记录器通常会在终端上显示如下信息：

source: Saving log to file
zh_hans: 将日志保存到文件

source: By default, the Flower log is outputted to the terminal where you launch your Federated Learning workload from. This applies for both gRPC-based federation (i.e. when you do :code:`fl.server.start_server`) and when using the :code:`VirtualClientEngine` (i.e. when you do :code:`fl.simulation.start_simulation`). In some situations you might want to save this log to disk. You can do so by calling the `fl.common.logger.configure() <https://github.com/adap/flower/blob/main/src/py/flwr/common/logger.py>`_ function. For example:
zh_hans: 默认情况下，Flower 日志会输出到启动联邦学习工作负载的终端。这既适用于基于 gRPC 的联邦学习（即执行 :code:`fl.server.start_server` 时），也适用于使用 :code:`VirtualClientEngine` 时（即执行 :code:`fl.simulation.start_simulation` 时）。在某些情况下，您可能希望将此日志保存到磁盘。为此，您可以调用 `fl.common.logger.configure() <https://github.com/adap/flower/blob/main/src/py/flwr/common/logger.py>`_ 函数。例如：

source: With the above, Flower will record the log you see on your terminal to :code:`log.txt`. This file will be created in the same directory as were you are running the code from. If we inspect we see the log above is also recorded but prefixing with :code:`identifier` each line:
fr: Avec ce qui précède, Flower enregistrera le log que vous voyez sur votre terminal dans :code:`log.txt`. Ce fichier sera créé dans le répertoire depuis lequel le code est exécuté. Si nous inspectons nous voyons que le log ci-dessous est également enregistré mais préfixé avec :code:`identifier` sur chaque ligne :
zh_hans: 通过上述操作，Flower 会将您在终端上看到的日志记录到 :code:`log.txt`。该文件将创建在运行代码的同一目录下。如果我们检查一下，就会发现上面的日志也被记录了下来，但每一行都以 :code:`identifier` 作为前缀：

source: Log your own messages
fr: Loggez vos propres messages
zh_hans: 记录自己的信息

source: You might expand the information shown by default with the Flower logger by adding more messages relevant to your application. You can achieve this easily as follows.
zh_hans: 您可以通过添加更多与应用程序相关的信息来扩展 Flower 日志记录器默认显示的信息。您可以通过以下方法轻松实现这一目标。

source: In this way your logger will show, in addition to the default messages, the ones introduced by the clients as specified above.
zh_hans: 这样，除默认信息外，您的日志记录器还将显示由客户引入的信息，如上文所述。

source: Log to a remote service
zh_hans: 登录远程服务

source: The :code:`fl.common.logger.configure` function, also allows specifying a host to which logs can be pushed (via :code:`POST`) through a native Python :code:`logging.handler.HTTPHandler`. This is a particularly useful feature in :code:`gRPC`-based Federated Learning workloads where otherwise gathering logs from all entities (i.e. the server and the clients) might be cumbersome. Note that in Flower simulation, the server automatically displays all logs. You can still specify a :code:`HTTPHandler` should you whish to backup or analyze the logs somewhere else.
zh_hans: 此外，:code:`fl.common.logger.configure`函数还允许指定主机，通过本地 Python :code:`logging.handler.HTTPHandler`，向该主机推送日志（通过 :code:`POST`）。在基于 :code:`gRPC` 的联邦学习工作负载中，这是一个特别有用的功能，否则从所有实体（即服务器和客户端）收集日志可能会很麻烦。请注意，在 Flower 模拟器中，服务器会自动显示所有日志。如果希望在其他地方备份或分析日志，仍可指定 :code:`HTTPHandler`。

source: Enable SSL connections
zh_hans: 启用 SSL 连接

source: This guide describes how to a SSL-enabled secure Flower server can be started and how a Flower client can establish a secure connections to it.
fr: Ce guide décrit comment démarrer un serveur Flower sécurisé par SSL et comment un client Flower peut établir une connexion sécurisée avec lui.
zh_hans: 本指南介绍如何启动启用 SSL 的安全 Flower 服务器，以及 Flower 客户端如何与其建立安全连接。

source: A complete code example demonstrating a secure connection can be found `here <https://github.com/adap/flower/tree/main/examples/advanced-tensorflow>`_.
zh_hans: 有关安全连接的完整代码示例，请参见 <https://github.com/adap/flower/tree/main/examples/advanced-tensorflow>`_ 。

source: The code example comes with a README.md file which will explain how to start it. Although it is already SSL-enabled, it might be less descriptive on how. Stick to this guide for a deeper introduction to the topic.
fr: L'exemple de code est accompagné d'un fichier README.md qui t'expliquera comment le démarrer. Bien qu'il soit déjà activé par SSL, il peut être moins descriptif sur la façon de procéder. Tiens-toi en à ce guide pour une introduction plus approfondie sur le sujet.
zh_hans: 代码示例附带的 README.md 文件将解释如何启动它。虽然它已经启用了 SSL，但对如何启用可能描述较少。请参考本指南，了解更深入的相关介绍。

source: Certificates
fr: Certificats
zh_hans: 证书

source: Using SSL-enabled connections requires certificates to be passed to the server and client. For the purpose of this guide we are going to generate self-signed certificates. As this can become quite complex we are going to ask you to run the script in :code:`examples/advanced-tensorflow/certificates/generate.sh`
zh_hans: 使用支持 SSL 的连接需要向服务器和客户端传递证书。在本指南中，我们将生成自签名证书。由于这可能会变得相当复杂，我们将要求你运行 :code:`examples/advanced-tensorflow/certificates/generate.sh` 中的脚本

source: with the following command sequence:
fr: avec la séquence de commandes suivante :
zh_hans: 使用以下命令序列：

source: This will generate the certificates in :code:`examples/advanced-tensorflow/.cache/certificates`.
zh_hans: 这将在 :code:`examples/advanced-tensorflow/.cache/certificates` 中生成证书。

source: The approach how the SSL certificates are generated in this example can serve as an inspiration and starting point but should not be taken as complete for production environments. Please refer to other sources regarding the issue of correctly generating certificates for production environments.
fr: L'approche de la génération des certificats SSL dans cet exemple peut servir d'inspiration et de point de départ, mais ne doit pas être considérée comme complète pour les environnements de production.
zh_hans: 本示例中生成 SSL 证书的方法可作为启发和起点，但不应被视为生产环境的完整方法。有关在生产环境中正确生成证书的问题，请参考其他资料。
