Repository: lucacorbucci/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: fr, zh_hans

source: Welcome to the next part of the federated learning tutorial. In previous parts of this tutorial, we introduced federated learning with PyTorch and Flower (`part 1 <https://flower.dev/docs/framework/tutorial-get-started-with-flower-pytorch.html>`__).
zh_hans: 欢迎来到联邦学习教程的下一部分。在本教程的前几部分，我们介绍了使用 PyTorch 和 Flower 进行联邦学习（`第 1 部分 <https://flower.dev/docs/framework/tutorial-get-started-with-flower-pytorch.html>`___）。

source: In this notebook, we'll begin to customize the federated learning system we built in the introductory notebook (again, using `Flower <https://flower.dev/>`__ and `PyTorch <https://pytorch.org/>`__).
fr: Dans ce carnet, nous allons commencer à personnaliser le système d'apprentissage fédéré que nous avons construit dans le carnet d'introduction (toujours en utilisant `Flower <https://flower.dev/>`__ et `PyTorch <https://pytorch.org/>`__).
zh_hans: 在本笔记中，我们将开始定制在入门笔记中构建的联邦学习系统（再次使用 `Flower <https://flower.dev/>`__ 和 `PyTorch <https://pytorch.org/>`__）。

source: Let's move beyond FedAvg with Flower strategies!
zh_hans: 让我们超越 FedAvg，采用Flower策略！

source: Strategy customization
fr: Personnalisation de la stratégie
zh_hans: 策略定制

source: So far, everything should look familiar if you've worked through the introductory notebook. With that, we're ready to introduce a number of new features.
fr: Jusqu'à présent, tout devrait te sembler familier si tu as travaillé sur le cahier d'introduction. Avec cela, nous sommes prêts à présenter un certain nombre de nouvelles fonctionnalités.
zh_hans: 到目前为止，如果您已经阅读过入门笔记本，那么一切都应该很熟悉了。接下来，我们将介绍一些新功能。

source: Server-side parameter **initialization**
fr: Paramètres côté serveur **initialisation**
zh_hans: 服务器端参数 **初始化**

source: Flower, by default, initializes the global model by asking one random client for the initial parameters. In many cases, we want more control over parameter initialization though. Flower therefore allows you to directly pass the initial parameters to the Strategy:
fr: Flower, par défaut, initialise le modèle global en demandant à un client aléatoire les paramètres initiaux. Dans de nombreux cas, nous voulons cependant avoir plus de contrôle sur l'initialisation des paramètres. Flower te permet donc de passer directement les paramètres initiaux à la Stratégie :
zh_hans: 默认情况下，Flower 会通过向一个随机客户端询问初始参数来初始化全局模型。但在许多情况下，我们需要对参数初始化进行更多控制。因此，Flower 允许您直接将初始参数传递给策略：

source: Passing ``initial_parameters`` to the ``FedAvg`` strategy prevents Flower from asking one of the clients for the initial parameters. If we look closely, we can see that the logs do not show any calls to the ``FlowerClient.get_parameters`` method.
fr: Le fait de passer ``initial_parameters`` à la stratégie ``FedAvg`` empêche Flower de demander les paramètres initiaux à l'un des clients. Si nous regardons de près, nous pouvons voir que les journaux ne montrent aucun appel à la méthode ``FlowerClient.get_parameters``.
zh_hans: 向 ``FedAvg`` 策略传递 ``initial_parameters`` 可以防止 Flower 向其中一个客户端询问初始参数。如果我们仔细观察，就会发现日志中没有显示对 ``FlowerClient.get_parameters`` 方法的任何调用。

source: Starting with a customized strategy
fr: Commencer par une stratégie personnalisée
zh_hans: 从定制战略开始

source: We've seen the function ``start_simulation`` before. It accepts a number of arguments, amongst them the ``client_fn`` used to create ``FlowerClient`` instances, the number of clients to simulate ``num_clients``, the number of rounds ``num_rounds``, and the strategy.
fr: Elle accepte un certain nombre d'arguments, parmi lesquels le ``client_fn`` utilisé pour créer les instances de ``FlowerClient``, le nombre de clients à simuler ``num_clients``, le nombre de rounds ``num_rounds``, et la stratégie.
zh_hans: 我们以前见过函数 ``start_simulation``。它接受许多参数，其中包括用于创建 ``FlowerClient`` 实例的 ``client_fn``、要模拟的客户数量 ``num_clients``、回合数 ``num_rounds``和策略。

source: The strategy encapsulates the federated learning approach/algorithm, for example, ``FedAvg`` or ``FedAdagrad``. Let's try to use a different strategy this time:
fr: La stratégie englobe l'approche/l'algorithme d'apprentissage fédéré, par exemple, ``FedAvg`` ou ``FedAdagrad``. Essayons d'utiliser une stratégie différente cette fois-ci :
zh_hans: 该策略封装了联邦学习方法/算法，例如`FedAvg``或`FedAdagrad``。这次让我们尝试使用不同的策略：

source: Server-side parameter **evaluation**
fr: Paramètre côté serveur **évaluation**
zh_hans: 服务器端参数**评估**

source: Flower can evaluate the aggregated model on the server-side or on the client-side. Client-side and server-side evaluation are similar in some ways, but different in others.
fr: Flower peut évaluer le modèle agrégé côté serveur ou côté client. Les évaluations côté client et côté serveur sont similaires à certains égards, mais différentes à d'autres.
zh_hans: Flower 可以在服务器端或客户端评估聚合模型。客户端和服务器端评估在某些方面相似，但也有不同之处。

source: **Centralized Evaluation** (or *server-side evaluation*) is conceptually simple: it works the same way that evaluation in centralized machine learning does. If there is a server-side dataset that can be used for evaluation purposes, then that's great. We can evaluate the newly aggregated model after each round of training without having to send the model to clients. We're also fortunate in the sense that our entire evaluation dataset is available at all times.
fr: **L'évaluation centralisée** (ou *évaluation côté serveur*) est conceptuellement simple : elle fonctionne de la même manière que l'évaluation dans l'apprentissage automatique centralisé. S'il existe un ensemble de données côté serveur qui peut être utilisé à des fins d'évaluation, alors c'est parfait. Nous pouvons évaluer le modèle nouvellement agrégé après chaque cycle de formation sans avoir à envoyer le modèle aux clients. Nous avons également la chance que l'ensemble de notre ensemble de données d'évaluation soit disponible à tout moment.
zh_hans: **集中评估**（或*服务器端评估*）在概念上很简单：它的工作方式与集中式机器学习中的评估方式相同。如果有一个服务器端数据集可用于评估目的，那就太好了。我们可以在每一轮训练后对新聚合的模型进行评估，而无需将模型发送给客户端。我们也很幸运，因为我们的整个评估数据集随时可用。

source: **Federated Evaluation** (or *client-side evaluation*) is more complex, but also more powerful: it doesn't require a centralized dataset and allows us to evaluate models over a larger set of data, which often yields more realistic evaluation results. In fact, many scenarios require us to use **Federated Evaluation** if we want to get representative evaluation results at all. But this power comes at a cost: once we start to evaluate on the client side, we should be aware that our evaluation dataset can change over consecutive rounds of learning if those clients are not always available. Moreover, the dataset held by each client can also change over consecutive rounds. This can lead to evaluation results that are not stable, so even if we would not change the model, we'd see our evaluation results fluctuate over consecutive rounds.
fr: **L'évaluation fédérée** (ou évaluation côté client) est plus complexe, mais aussi plus puissante : elle ne nécessite pas d'ensemble de données centralisé et nous permet d'évaluer les modèles sur un plus grand ensemble de données, ce qui donne souvent des résultats d'évaluation plus réalistes. En fait, de nombreux scénarios exigent que nous utilisions l'évaluation fédérée** si nous voulons obtenir des résultats d'évaluation représentatifs. Mais cette puissance a un coût : une fois que nous commençons à évaluer côté client, nous devons savoir que notre ensemble de données d'évaluation peut changer au cours des cycles d'apprentissage consécutifs si ces clients ne sont pas toujours disponibles. De plus, l'ensemble de données détenu par chaque client peut également changer au cours des cycles consécutifs. Cela peut conduire à des résultats d'évaluation qui ne sont pas stables, donc même si nous ne changions pas le modèle, nous verrions nos résultats d'évaluation fluctuer au cours des cycles consécutifs.
zh_hans: **联邦评估**（或*客户端评估*）更为复杂，但也更为强大：它不需要集中的数据集，允许我们在更大的数据集上对模型进行评估，这通常会产生更真实的评估结果。事实上，如果我们想得到有代表性的评估结果，很多情况下都需要使用**联邦评估**。但是，这种能力是有代价的：一旦我们开始在客户端进行评估，我们就应该意识到，如果这些客户端并不总是可用，我们的评估数据集可能会在连续几轮学习中发生变化。此外，每个客户端所拥有的数据集也可能在连续几轮学习中发生变化。这可能会导致评估结果不稳定，因此即使我们不改变模型，也会看到评估结果在连续几轮中波动。

source: We've seen how federated evaluation works on the client side (i.e., by implementing the ``evaluate`` method in ``FlowerClient``). Now let's see how we can evaluate aggregated model parameters on the server-side:
fr: Nous avons vu comment l'évaluation fédérée fonctionne du côté client (c'est-à-dire en implémentant la méthode ``evaluate`` dans ``FlowerClient``). Voyons maintenant comment nous pouvons évaluer les paramètres du modèle agrégé du côté serveur :
zh_hans: 我们已经了解了联邦评估如何在客户端工作（即通过在 ``FlowerClient`` 中实现 ``evaluate`` 方法）。现在让我们看看如何在服务器端评估聚合模型参数：

source: Sending/receiving arbitrary values to/from clients
fr: Envoi/réception de valeurs arbitraires vers/depuis les clients
zh_hans: 向/从客户端发送/接收任意值

source: In some situations, we want to configure client-side execution (training, evaluation) from the server-side. One example for that is the server asking the clients to train for a certain number of local epochs. Flower provides a way to send configuration values from the server to the clients using a dictionary. Let's look at an example where the clients receive values from the server through the ``config`` parameter in ``fit`` (``config`` is also available in ``evaluate``). The ``fit`` method receives the configuration dictionary through the ``config`` parameter and can then read values from this dictionary. In this example, it reads ``server_round`` and ``local_epochs`` and uses those values to improve the logging and configure the number of local training epochs:
zh_hans: 在某些情况下，我们希望从服务器端配置客户端的执行（训练、评估）。其中一个例子就是服务器要求客户端训练一定数量的本地遍历。Flower 提供了一种使用字典从服务器向客户端发送配置值的方法。让我们来看一个例子：客户端通过 ``fit`` 中的 ``config`` 参数从服务器接收配置值（``evaluate`` 中也有 ``config`` 参数）。``fit`` 方法通过 ``config`` 参数接收配置字典，然后从字典中读取值。在本例中，它读取了 ``server_round`` 和 ``local_epochs``，并使用这些值来改进日志记录和配置本地训练遍历的数量：

source: So how can we send this config dictionary from server to clients? The built-in Flower Strategies provide way to do this, and it works similarly to the way server-side evaluation works. We provide a function to the strategy, and the strategy calls this function for every round of federated learning:
fr: Comment pouvons-nous donc envoyer ce dictionnaire de configuration du serveur aux clients ? Les stratégies de Flower intégrées fournissent un moyen de le faire, et cela fonctionne de la même façon que l'évaluation côté serveur. Nous fournissons une fonction à la stratégie, et la stratégie appelle cette fonction pour chaque cycle d'apprentissage fédéré :
zh_hans: 那么，如何将配置字典从服务器发送到客户端呢？内置的 "Flower策略"（Flower Strategies）提供了这样的方法，其工作原理与服务器端评估的工作原理类似。我们为策略提供一个函数，策略会在每一轮联邦学习中调用这个函数：

source: Next, we'll just pass this function to the FedAvg strategy before starting the simulation:
fr: Ensuite, nous allons simplement passer cette fonction à la stratégie FedAvg avant de commencer la simulation :
zh_hans: 接下来，我们只需在开始模拟前将此函数传递给 FedAvg 策略即可：

source: As we can see, the client logs now include the current round of federated learning (which they read from the ``config`` dictionary). We can also configure local training to run for one epoch during the first and second round of federated learning, and then for two epochs during the third round.
fr: Comme nous pouvons le voir, les journaux des clients incluent maintenant le cycle actuel d'apprentissage fédéré (qu'ils lisent depuis le dictionnaire ``config``). Nous pouvons également configurer l'apprentissage local pour qu'il s'exécute pendant une époque au cours du premier et du deuxième cycle d'apprentissage fédéré, puis pendant deux époques au cours du troisième cycle.
zh_hans: 我们可以看到，客户端日志现在包含了当前一轮的联邦学习（从 ``config`` 字典中读取）。我们还可以将本地训练配置为在第一轮和第二轮联邦学习期间运行一个遍历，然后在第三轮联邦学习期间运行两个遍历。

source: Clients can also return arbitrary values to the server. To do so, they return a dictionary from ``fit`` and/or ``evaluate``. We have seen and used this concept throughout this notebook without mentioning it explicitly: our ``FlowerClient`` returns a dictionary containing a custom key/value pair as the third return value in ``evaluate``.
fr: Les clients peuvent également renvoyer des valeurs arbitraires au serveur. Pour ce faire, ils renvoient un dictionnaire depuis ``fit`` et/ou ``evaluate``. Nous avons vu et utilisé ce concept tout au long de ce carnet sans le mentionner explicitement : notre ``FlowerClient`` renvoie un dictionnaire contenant une paire clé/valeur personnalisée en tant que troisième valeur de retour dans ``evaluate``.
zh_hans: 客户端还可以向服务器返回任意值。为此，它们会从 ``fit`` 和/或 ``evaluate`` 返回一个字典。我们在本笔记中看到并使用了这一概念，但并未明确提及：我们的 ``FlowerClient`` 返回一个包含自定义键/值对的字典，作为 ``evaluate`` 中的第三个返回值。

source: Scaling federated learning
fr: Mise à l'échelle de l'apprentissage fédéré
zh_hans: 扩大联邦学习的规模

source: As a last step in this notebook, let's see how we can use Flower to experiment with a large number of clients.
fr: Comme dernière étape de ce carnet, voyons comment nous pouvons utiliser Flower pour expérimenter avec un grand nombre de clients.
zh_hans: 作为本笔记的最后一步，让我们看看如何使用 Flower 对大量客户端进行实验。

source: We now have 1000 partitions, each holding 45 training and 5 validation examples. Given that the number of training examples on each client is quite small, we should probably train the model a bit longer, so we configure the clients to perform 3 local training epochs. We should also adjust the fraction of clients selected for training during each round (we don't want all 1000 clients participating in every round), so we adjust ``fraction_fit`` to ``0.05``, which means that only 5% of available clients (so 50 clients) will be selected for training each round:
fr: Nous avons maintenant 1000 partitions, chacune contenant 45 exemples d'entraînement et 5 exemples de validation. Etant donné que le nombre d'exemples d'entraînement sur chaque client est assez faible, nous devrions probablement entraîner le modèle un peu plus longtemps, nous configurons donc les clients pour qu'ils effectuent 3 époques d'entraînement local. Nous devrions également ajuster la fraction de clients sélectionnés pour l'entraînement à chaque tour (nous ne voulons pas que les 1000 clients participent à chaque tour), nous ajustons donc ``fraction_fit`` à ``0.05``, ce qui signifie que seulement 5% des clients disponibles (donc 50 clients) seront sélectionnés pour l'entraînement à chaque tour :
zh_hans: 现在我们有 1000 个分区，每个分区有 45 个训练数据和 5 个验证数据。鉴于每个客户端上的训练示例数量较少，我们可能需要对模型进行更长时间的训练，因此我们将客户端配置为执行 3 个本地训练遍历。我们还应该调整每轮训练中被选中的客户端的比例（我们不希望每轮训练都有 1000 个客户端参与），因此我们将 ``fraction_fit`` 调整为 ``0.05``，这意味着每轮训练只选中 5%的可用客户端（即 50 个客户端）：

source: In this notebook, we've seen how we can gradually enhance our system by customizing the strategy, initializing parameters on the server side, choosing a different strategy, and evaluating models on the server-side. That's quite a bit of flexibility with so little code, right?
fr: Dans ce carnet, nous avons vu comment nous pouvons progressivement améliorer notre système en personnalisant la stratégie, en initialisant les paramètres côté serveur, en choisissant une stratégie différente et en évaluant les modèles côté serveur. C'est une sacrée flexibilité avec si peu de code, n'est-ce pas ?
zh_hans: 在本笔记中，我们看到了如何通过自定义策略、在服务器端初始化参数、选择不同的策略以及在服务器端评估模型来逐步增强我们的系统。用这么少的代码就能实现这么大的灵活性，不是吗？

source: In the later sections, we've seen how we can communicate arbitrary values between server and clients to fully customize client-side execution. With that capability, we built a large-scale Federated Learning simulation using the Flower Virtual Client Engine and ran an experiment involving 1000 clients in the same workload - all in a Jupyter Notebook!
fr: Dans les sections ultérieures, nous avons vu comment nous pouvons communiquer des valeurs arbitraires entre le serveur et les clients pour personnaliser entièrement l'exécution côté client. Grâce à cette capacité, nous avons construit une simulation d'apprentissage fédéré à grande échelle en utilisant le moteur de client virtuel Flower et nous avons mené une expérience impliquant 1000 clients dans la même charge de travail - le tout dans un carnet Jupyter !
zh_hans: 在后面的章节中，我们将看到如何在服务器和客户端之间传递任意值，以完全自定义客户端执行。有了这种能力，我们使用 Flower 虚拟客户端引擎构建了一个大规模的联邦学习模拟，并在 Jupyter Notebook 中进行了一次实验，在相同的工作负载中运行了 1000 个客户端！

source: The `Flower Federated Learning Tutorial - Part 3 <https://flower.dev/docs/framework/tutorial-build-a-strategy-from-scratch-pytorch.html>`__ shows how to build a fully custom ``Strategy`` from scratch.
zh_hans: `Flower 联邦学习教程 - 第 3 部分 <https://flower.dev/docs/framework/tutorial-build-a-strategy-from-scratch-pytorch.html>`__ 展示了如何从头开始构建完全自定义的 "策略"。

source: What is Federated Learning?
fr: Qu'est-ce que l'apprentissage fédéré ?
zh_hans: 什么是联邦学习？

source: In this tutorial, you will learn what federated learning is, build your first system in Flower, and gradually extend it. If you work through all parts of the tutorial, you will be able to build advanced federated learning systems that approach the current state of the art in the field.
zh_hans: 在本教程中，你将了解什么是联邦学习，用 Flower 搭建第一个系统，并逐步对其进行扩展。如果你能完成本教程的所有部分，你就能构建高级的联邦学习系统，从而接近该领域当前的技术水平。

source: 🧑‍🏫 This tutorial starts at zero and expects no familiarity with federated learning. Only a basic understanding of data science and Python programming is assumed.
fr: 🧑‍🏫 Ce tutoriel part de zéro et n'attend aucune familiarité avec l'apprentissage fédéré. Seule une compréhension de base de la science des données et de la programmation Python est supposée.
zh_hans: 🧑‍🏫 本教程从零开始，不要求熟悉联邦学习。仅假定对数据科学和 Python 编程有基本了解。

source: `Star Flower on GitHub <https://github.com/adap/flower>`__ ⭐️ and join the open-source Flower community on Slack to connect, ask questions, and get help: `Join Slack <https://flower.dev/join-slack>`__ 🌼 We'd love to hear from you in the ``#introductions`` channel! And if anything is unclear, head over to the ``#questions`` channel.
zh_hans: `Star Flower on GitHub <https://github.com/adap/flower>`__ ⭐️ 并加入 Slack 上的开源 Flower 社区，进行交流、提问并获得帮助： 加入 Slack <https://flower.dev/join-slack>`__ 🌼 我们希望在 ``#introductions`` 频道听到您的声音！如果有任何不清楚的地方，请访问 ``#questions`` 频道。

source: Let's get started!
zh_hans: 让我们开始吧！

source: Classic machine learning
fr: Apprentissage automatique classique
zh_hans: 经典机器学习

source: Before we begin to discuss federated learning, let us quickly recap how most machine learning works today.
fr: Avant de commencer à discuter de l'apprentissage fédéré, récapitulons rapidement la façon dont la plupart des apprentissages automatiques fonctionnent aujourd'hui.
zh_hans: 在开始讨论联邦学习之前，让我们先快速回顾一下目前大多数机器学习的工作原理。

source: In machine learning, we have a model, and we have data. The model could be a neural network (as depicted here), or something else, like classical linear regression.
fr: Dans l'apprentissage automatique, nous avons un modèle et des données. Le modèle peut être un réseau neuronal (comme illustré ici), ou quelque chose d'autre, comme la régression linéaire classique.
zh_hans: 在机器学习中，我们有一个模型和数据。模型可以是一个神经网络（如图所示），也可以是其他东西，比如经典的线性回归。

source: Model and data
fr: Modèle et données
zh_hans: 模型和数据

source: We train the model using the data to perform a useful task. A task could be to detect objects in images, transcribe an audio recording, or play a game like Go.
fr: Nous entraînons le modèle en utilisant les données pour effectuer une tâche utile. Une tâche peut consister à détecter des objets dans des images, à transcrire un enregistrement audio ou à jouer à un jeu comme le Go.
zh_hans: 我们使用数据来训练模型，以完成一项有用的任务。任务可以是检测图像中的物体、转录音频或玩围棋等游戏。

source: Train model using data
fr: Entraîne le modèle à l'aide des données
zh_hans: 使用数据训练模型

source: Now, in practice, the training data we work with doesn't originate on the machine we train the model on. It gets created somewhere else.
zh_hans: 实际上，我们使用的训练数据并不来自我们训练模型的机器。它是在其他地方创建的。

source: It originates on a smartphone by the user interacting with an app, a car collecting sensor data, a laptop receiving input via the keyboard, or a smart speaker listening to someone trying to sing a song.
zh_hans: 它源于智能手机上用户与应用程序的交互、汽车上传感器数据的收集、笔记本电脑上键盘输入的接收，或者智能扬声器上某人试着唱的歌。

source: Data on a phone
fr: Données sur un téléphone
zh_hans: 手机上的数据

source: What's also important to mention, this "somewhere else" is usually not just one place, it's many places. It could be several devices all running the same app. But it could also be several organizations, all generating data for the same task.
fr: Il est également important de mentionner que cet "ailleurs" n'est généralement pas un seul endroit, mais plusieurs. Il peut s'agir de plusieurs appareils fonctionnant tous avec la même application. Mais il peut également s'agir de plusieurs organisations, qui génèrent toutes des données pour la même tâche.
zh_hans: 值得一提的是，这个 "其他地方 "通常不只是一个地方，而是很多地方。它可能是多个运行同一应用程序的设备。但也可能是多个组织，都在为同一任务生成数据。

source: Data is on many devices
fr: Les données se trouvent sur de nombreux appareils
zh_hans: 数据存在于多种设备中

source: So to use machine learning, or any kind of data analysis, the approach that has been used in the past was to collect all data on a central server. This server can be somewhere in a data center, or somewhere in the cloud.
fr: Ainsi, pour utiliser l'apprentissage automatique, ou tout autre type d'analyse de données, l'approche utilisée par le passé consistait à collecter toutes les données sur un serveur central. Ce serveur peut se trouver quelque part dans un centre de données, ou quelque part dans le cloud.
zh_hans: 因此，要使用机器学习或任何类型的数据分析，过去使用的方法是在中央服务器上收集所有数据。这个服务器可以在数据中心的某个地方，也可以在云端的某个地方。

source: Central data collection
fr: Collecte centralisée des données
zh_hans: 集中数据收集

source: Once all the data is collected in one place, we can finally use machine learning algorithms to train our model on the data. This is the machine learning approach that we've basically always relied on.
zh_hans: 一旦所有数据都收集到一处，我们最终就可以使用机器学习算法在数据上训练我们的模型。这就是我们基本上一直依赖的机器学习方法。

source: Central model training
fr: Formation au modèle central
zh_hans: 集中模型训练

source: Challenges of classical machine learning
fr: Les défis de l'apprentissage automatique classique
zh_hans: 经典机器学习面临的挑战

source: The classic machine learning approach we've just seen can be used in some cases. Great examples include categorizing holiday photos, or analyzing web traffic. Cases, where all the data is naturally available on a centralized server.
fr: L'approche classique de l'apprentissage automatique que nous venons de voir peut être utilisée dans certains cas. Parmi les grands exemples, on peut citer la catégorisation des photos de vacances, ou l'analyse du trafic web. Des cas, où toutes les données sont naturellement disponibles sur un serveur centralisé.
zh_hans: 我们刚刚看到的经典机器学习方法可以在某些情况下使用。很好的例子包括对假日照片进行分类或分析网络流量。在这些案例中，所有数据自然都可以在中央服务器上获得。

source: Centralized possible
fr: Possibilité de centralisation
zh_hans: 可集中管理

source: But the approach can not be used in many other cases. Cases, where the data is not available on a centralized server, or cases where the data available on one server is not enough to train a good model.
fr: Mais cette approche ne peut pas être utilisée dans de nombreux autres cas : lorsque les données ne sont pas disponibles sur un serveur centralisé, ou lorsque les données disponibles sur un serveur ne sont pas suffisantes pour former un bon modèle.
zh_hans: 但这种方法并不适用于许多其他情况。例如，集中服务器上没有数据，或者一台服务器上的数据不足以训练出一个好的模型。

source: Centralized impossible
fr: Impossible de centraliser
zh_hans: 无法集中

source: There are many reasons why the classic centralized machine learning approach does not work for a large number of highly important real-world use cases. Those reasons include:
zh_hans: 传统的集中式机器学习方法无法满足现实世界中大量极为重要的使用案例，原因有很多。这些原因包括：
