Repository: lucacorbucci/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: fr, zh_hans

source: **Remove deprecated DefaultStrategy strategy** ([#1142](https://github.com/adap/flower/pull/1142))
fr: **Supprime la stratégie DefaultStrategy qui est obsolète** ([#1142](https://github.com/adap/flower/pull/1142))
zh_hans: **删除过时的 DefaultStrategy 策略** ([#1142](https://github.com/adap/flower/pull/1142))

source: **Remove deprecated support for eval_fn accuracy return value** ([#1142](https://github.com/adap/flower/pull/1142))
fr: **Supprimer la prise en charge obsolète de la valeur de retour de la précision eval_fn** ([#1142](https://github.com/adap/flower/pull/1142))
zh_hans: **删除已过时的对 eval_fn 返回值准确性的支持** ([#1142](https://github.com/adap/flower/pull/1142))

source: **Remove deprecated support for passing initial parameters as NumPy ndarrays** ([#1142](https://github.com/adap/flower/pull/1142))
fr: **Supprime la prise en charge obsolète du passage des paramètres initiaux en tant que ndarrays NumPy** ([#1142](https://github.com/adap/flower/pull/1142))
zh_hans: **移除对以 NumPy ndarrays 传递初始参数的过时支持** ([#1142](https://github.com/adap/flower/pull/1142))

source: **Improved Virtual Client Engine compatibility with Jupyter Notebook / Google Colab** ([#866](https://github.com/adap/flower/pull/866), [#872](https://github.com/adap/flower/pull/872), [#833](https://github.com/adap/flower/pull/833), [#1036](https://github.com/adap/flower/pull/1036))
fr: **Amélioration de la compatibilité du moteur de client virtuel avec Jupyter Notebook / Google Colab** ([#866](https://github.com/adap/flower/pull/866), [#872](https://github.com/adap/flower/pull/872), [#833](https://github.com/adap/flower/pull/833), [#1036](https://github.com/adap/flower/pull/1036))
zh_hans: **改进了虚拟客户端引擎与 Jupyter Notebook / Google Colab 的兼容性** ([#866](https://github.com/adap/flower/pull/866), [#872](https://github.com/adap/flower/pull/872), [#833](https://github.com/adap/flower/pull/833), [#1036](https://github.com/adap/flower/pull/1036))

source: Simulations (using the Virtual Client Engine through `start_simulation`) now work more smoothly on Jupyter Notebooks (incl. Google Colab) after installing Flower with the `simulation` extra (`pip install flwr[simulation]`).
fr: Les simulations (utilisant le moteur de client virtuel via `start_simulation`) fonctionnent maintenant plus facilement sur les Notebooks Jupyter (y compris Google Colab) après avoir installé Flower avec l'option `simulation` (`pip install flwr[simulation]`).
zh_hans: 通过 `start_simulation` 在 Jupyter 笔记本（包括 Google Colab）上安装 Flower 并附加 `simulation` (`pip install flwr[simulation]`)后，模拟（通过 `start_simulation` 使用虚拟客户端引擎）现在可以更流畅地运行。

source: **New Jupyter Notebook code example** ([#833](https://github.com/adap/flower/pull/833))
fr: **Nouvel exemple de code Jupyter Notebook** ([#833](https://github.com/adap/flower/pull/833))
zh_hans: **新的 Jupyter Notebook 代码示例** ([#833](https://github.com/adap/flower/pull/833))

source: A new code example (`quickstart_simulation`) demonstrates Flower simulations using the Virtual Client Engine through Jupyter Notebook (incl. Google Colab).
fr: Un nouvel exemple de code (`quickstart_simulation`) démontre des simulations de Flower en utilisant le moteur de client virtuel via Jupyter Notebook (y compris Google Colab).
zh_hans: 新代码示例（`quickstart_simulation`）通过 Jupyter Notebook（包括 Google Colab）演示了使用虚拟客户端引擎进行 Flower 模拟。

source: **Client properties (feature preview)** ([#795](https://github.com/adap/flower/pull/795))
fr: **Propriétés du client (aperçu des fonctionnalités)** ([#795](https://github.com/adap/flower/pull/795))
zh_hans: **客户端属性（功能预览）** ([#795](https://github.com/adap/flower/pull/795))

source: Clients can implement a new method `get_properties` to enable server-side strategies to query client properties.
fr: Les clients peuvent implémenter une nouvelle méthode `get_properties` pour permettre aux stratégies côté serveur d'interroger les propriétés du client.
zh_hans: 客户端可以实现一个新方法 `get_properties`，以启用服务器端策略来查询客户端属性。

source: **Experimental Android support with TFLite** ([#865](https://github.com/adap/flower/pull/865))
fr: **Support expérimental d'Android avec TFLite** ([#865](https://github.com/adap/flower/pull/865))
zh_hans: ** 使用 TFLite 实验性支持安卓系统** ([#865](https://github.com/adap/flower/pull/865))

source: Android support has finally arrived in `main`! Flower is both client-agnostic and framework-agnostic by design. One can integrate arbitrary client platforms and with this release, using Flower on Android has become a lot easier.
fr: La prise en charge d'Android est enfin arrivée dans `main` ! Flower est à la fois agnostique au niveau du client et du cadre de travail. On peut intégrer des plates-formes client arbitraires et avec cette version, l'utilisation de Flower sur Android est devenue beaucoup plus facile.
zh_hans: `main`终于支持 Android 了！Flower 的设计与客户端和框架无关。我们可以集成任意客户端平台，有了这个版本，在安卓系统上使用 Flower 就变得更容易了。

source: The example uses TFLite on the client side, along with a new `FedAvgAndroid` strategy. The Android client and `FedAvgAndroid` are still experimental, but they are a first step towards a fully-fledged Android SDK and a unified `FedAvg` implementation that integrated the new functionality from `FedAvgAndroid`.
fr: L'exemple utilise TFLite du côté client, ainsi qu'une nouvelle stratégie `FedAvgAndroid`. Le client Android et `FedAvgAndroid` sont encore expérimentaux, mais ils constituent un premier pas vers un SDK Android à part entière et une implémentation unifiée de `FedAvg` intégrant la nouvelle fonctionnalité de `FedAvgAndroid`.
zh_hans: 该示例在客户端使用了 TFLite 以及新的 `FedAvgAndroid`策略。Android 客户端和 `FedAvgAndroid`仍处于试验阶段，但这是向成熟的 Android SDK 和集成了 `FedAvgAndroid`新功能的统一 `FedAvg`实现迈出的第一步。

source: **Make gRPC keepalive time user-configurable and decrease default keepalive time** ([#1069](https://github.com/adap/flower/pull/1069))
fr: **Rendre le temps de garde gRPC configurable par l'utilisateur et diminuer le temps de garde par défaut** ([#1069](https://github.com/adap/flower/pull/1069))
zh_hans: **使 gRPC 保持连接时间可由用户配置，并缩短默认保持连接时间** ([#1069](https://github.com/adap/flower/pull/1069))

source: The default gRPC keepalive time has been reduced to increase the compatibility of Flower with more cloud environments (for example, Microsoft Azure). Users can configure the keepalive time to customize the gRPC stack based on specific requirements.
fr: Le temps de keepalive gRPC par défaut a été réduit pour augmenter la compatibilité de Flower avec davantage d'environnements cloud (par exemple, Microsoft Azure). Les utilisateurs peuvent configurer le temps de keepalive pour personnaliser la pile gRPC en fonction d'exigences spécifiques.
zh_hans: 为提高 Flower 与更多云环境（如 Microsoft Azure）的兼容性，缩短了默认 gRPC 保持时间。用户可以根据具体要求配置 keepalive 时间，自定义 gRPC 堆栈。

source: **New differential privacy example using Opacus and PyTorch** ([#805](https://github.com/adap/flower/pull/805))
fr: **Nouvel exemple de confidentialité différentielle utilisant Opacus et PyTorch** ([#805](https://github.com/adap/flower/pull/805))
zh_hans: **使用 Opacus 和 PyTorch 的新差分隐私示例** ([#805](https://github.com/adap/flower/pull/805))

source: A new code example (`opacus`) demonstrates differentially-private federated learning with Opacus, PyTorch, and Flower.
fr: Un nouvel exemple de code (`opacus`) démontre l'apprentissage fédéré différentiellement privé avec Opacus, PyTorch et Flower.
zh_hans: 一个新的代码示例（"opacus"）演示了使用 Opacus、PyTorch 和 Flower 进行差分隐私的联邦学习。

source: **New Hugging Face Transformers code example** ([#863](https://github.com/adap/flower/pull/863))
fr: **Nouvel exemple de code pour les Transformers à visage embrassant** ([#863](https://github.com/adap/flower/pull/863))
zh_hans: **新的Hugging Face Transformers代码示例** ([#863](https://github.com/adap/flower/pull/863))

source: A new code example (`quickstart_huggingface`) demonstrates usage of Hugging Face Transformers with Flower.
fr: Un nouvel exemple de code (`quickstart_huggingface`) démontre l'utilisation des transformateurs Hugging Face avec Flower.
zh_hans: 新的代码示例(`quickstart_huggingface`)证明了结合Flower和Hugging Face Transformers的实用性。

source: **New MLCube code example** ([#779](https://github.com/adap/flower/pull/779), [#1034](https://github.com/adap/flower/pull/1034), [#1065](https://github.com/adap/flower/pull/1065), [#1090](https://github.com/adap/flower/pull/1090))
fr: **Nouvel exemple de code MLCube** ([#779](https://github.com/adap/flower/pull/779), [#1034](https://github.com/adap/flower/pull/1034), [#1065](https://github.com/adap/flower/pull/1065), [#1090](https://github.com/adap/flower/pull/1090))
zh_hans: **新的 MLCube 代码示例** ([#779](https://github.com/adap/flower/pull/779), [#1034](https://github.com/adap/flower/pull/1034), [#1065](https://github.com/adap/flower/pull/1065), [#1090](https://github.com/adap/flower/pull/1090))

source: A new code example (`quickstart_mlcube`) demonstrates usage of MLCube with Flower.
fr: Un nouvel exemple de code (`quickstart_mlcube`) démontre l'utilisation de MLCube avec Flower.
zh_hans: 新代码示例（"quickstart_mlcube"）演示了 MLCube 与 Flower 的用法。

source: **SSL-enabled server and client** ([#842](https://github.com/adap/flower/pull/842), [#844](https://github.com/adap/flower/pull/844), [#845](https://github.com/adap/flower/pull/845), [#847](https://github.com/adap/flower/pull/847), [#993](https://github.com/adap/flower/pull/993), [#994](https://github.com/adap/flower/pull/994))
fr: **([#842](https://github.com/adap/flower/pull/842), [#844](https://github.com/adap/flower/pull/844), [#845](https://github.com/adap/flower/pull/845), [#847](https://github.com/adap/flower/pull/847), [#993](https://github.com/adap/flower/pull/993), [#994](https://github.com/adap/flower/pull/994))
zh_hans: ** 支持 SSL 的服务器和客户端** ([#842](https://github.com/adap/flower/pull/842), [#844](https://github.com/adap/flower/pull/844), [#845](https://github.com/adap/flower/pull/845), [#847](https://github.com/adap/flower/pull/847), [#993](https://github.com/adap/flower/pull/993), [#994](https://github.com/adap/flower/pull/994))

source: SSL enables secure encrypted connections between clients and servers. This release open-sources the Flower secure gRPC implementation to make encrypted communication channels accessible to all Flower users.
fr: SSL permet d'établir des connexions cryptées et sécurisées entre les clients et les serveurs. Cette version met en open-source l'implémentation gRPC sécurisée de Flower afin de rendre les canaux de communication cryptés accessibles à tous les utilisateurs de Flower.
zh_hans: SSL 可实现客户端与服务器之间的安全加密连接。该版本开源了 Flower 安全 gRPC 实现，使所有 Flower 用户都能访问加密通信通道。

source: **Updated** `FedAdam` **and** `FedYogi` **strategies** ([#885](https://github.com/adap/flower/pull/885), [#895](https://github.com/adap/flower/pull/895))
fr: **Mise à jour** `FedAdam` **et** `FedYogi` **stratégies** ([#885](https://github.com/adap/flower/pull/885), [#895](https://github.com/adap/flower/pull/895))
zh_hans: **更新**`FedAdam`**和**`FedYogi`**战略** ([#885](https://github.com/adap/flower/pull/885), [#895](https://github.com/adap/flower/pull/895))

source: `FedAdam` and `FedAdam` match the latest version of the Adaptive Federated Optimization paper.
fr: `FedAdam` et `FedAdam` correspondent à la dernière version de l'article sur l'optimisation fédérée adaptative.
zh_hans: FedAdam "和 "FedAdam "与最新版本的 "自适应联邦优化 "论文相匹配。

source: **Initialize** `start_simulation` **with a list of client IDs** ([#860](https://github.com/adap/flower/pull/860))
fr: **Initialise** `start_simulation` **avec une liste d'ID de clients** ([#860](https://github.com/adap/flower/pull/860))
zh_hans: **初始化** `start_simulation` **使用客户端 ID 列表** ([#860](https://github.com/adap/flower/pull/860))

source: `start_simulation` can now be called with a list of client IDs (`clients_ids`, type: `List[str]`). Those IDs will be passed to the `client_fn` whenever a client needs to be initialized, which can make it easier to load data partitions that are not accessible through `int` identifiers.
fr: `start_simulation` peut maintenant être appelé avec une liste d'identifiants de clients (`clients_ids`, type : `List[str]`). Ces identifiants seront passés à `client_fn` chaque fois qu'un client doit être initialisé, ce qui peut faciliter le chargement de partitions de données qui ne sont pas accessibles par des identifiants `int`.
zh_hans: 现在可以使用客户端 ID 列表（`clients_ids`，类型：`List[str]`）调用 `start_simulation`。每当需要初始化客户端时，这些 ID 就会被传递到 `client_fn` 中，这样就能更轻松地加载无法通过 `int` 标识符访问的数据分区。

source: Update `num_examples` calculation in PyTorch code examples in ([#909](https://github.com/adap/flower/pull/909))
fr: Mettre à jour le calcul de `num_examples` dans les exemples de code PyTorch dans ([#909](https://github.com/adap/flower/pull/909))
zh_hans: 更新 PyTorch 代码示例中的 "num_examples "计算 ([#909](https://github.com/adap/flower/pull/909))

source: Expose Flower version through `flwr.__version__` ([#952](https://github.com/adap/flower/pull/952))
fr: Exposer la version de Flower à travers `flwr.__version__` ([#952](https://github.com/adap/flower/pull/952))
zh_hans: 通过 `flwr.__version__` 公开 Flower 版本 ([#952](https://github.com/adap/flower/pull/952))

source: `start_server` in `app.py` now returns a `History` object containing metrics from training ([#974](https://github.com/adap/flower/pull/974))
fr: `start_server` dans `app.py` renvoie maintenant un objet `History` contenant les métriques de l'entraînement ([#974](https://github.com/adap/flower/pull/974))
zh_hans: `app.py`中的 `start_server`现在会返回一个 `History` 对象，其中包含训练中的指标（[#974](https://github.com/adap/flower/pull/974)）

source: Make `max_workers` (used by `ThreadPoolExecutor`) configurable ([#978](https://github.com/adap/flower/pull/978))
fr: Rendre `max_workers` (utilisé par `ThreadPoolExecutor`) configurable ([#978](https://github.com/adap/flower/pull/978))
zh_hans: 使 `max_workers`（由 `ThreadPoolExecutor`使用）可配置（[#978](https://github.com/adap/flower/pull/978)）

source: Increase sleep time after server start to three seconds in all code examples ([#1086](https://github.com/adap/flower/pull/1086))
fr: Augmente le temps de sommeil après le démarrage du serveur à trois secondes dans tous les exemples de code ([#1086](https://github.com/adap/flower/pull/1086))
zh_hans: 在所有代码示例中，将服务器启动后的休眠时间延长至三秒（[#1086](https://github.com/adap/flower/pull/1086)）

source: Added a new FAQ section to the documentation ([#948](https://github.com/adap/flower/pull/948))
fr: Ajout d'une nouvelle section FAQ à la documentation ([#948](https://github.com/adap/flower/pull/948))
zh_hans: 在文档中添加了新的常见问题部分 ([#948](https://github.com/adap/flower/pull/948))

source: And many more under-the-hood changes, library updates, documentation changes, and tooling improvements!
fr: Et bien d'autres changements sous le capot, des mises à jour de la bibliothèque, des modifications de la documentation et des améliorations de l'outillage !
zh_hans: 还有更多底层更改、库更新、文档更改和工具改进！

source: **Removed** `flwr_example` **and** `flwr_experimental` **from release build** ([#869](https://github.com/adap/flower/pull/869))
fr: **Supprimé** `flwr_example` **et** `flwr_experimental` **de la version release build** ([#869](https://github.com/adap/flower/pull/869))
zh_hans: **从发布版中删除**`flwr_example`**和**`flwr_experimental`** ([#869](https://github.com/adap/flower/pull/869))

source: The packages `flwr_example` and `flwr_experimental` have been deprecated since Flower 0.12.0 and they are not longer included in Flower release builds. The associated extras (`baseline`, `examples-pytorch`, `examples-tensorflow`, `http-logger`, `ops`) are now no-op and will be removed in an upcoming release.
fr: Les paquets `flwr_example` et `flwr_experimental` ont été dépréciés depuis Flower 0.12.0 et ils ne sont plus inclus dans les builds de Flower. Les extras associés (`baseline`, `examples-pytorch`, `examples-tensorflow`, `http-logger`, `ops`) sont maintenant no-op et seront supprimés dans une prochaine version.
zh_hans: 自 Flower 0.12.0 起，软件包 `flwr_example` 和 `flwr_experimental` 已被弃用，它们不再包含在 Flower 的发布版本中。相关的额外包（`baseline`, `examples-pytorch`, `examples-tensorflow`, `http-logger`, `ops`）现在已不再使用，并将在即将发布的版本中移除。

source: **Experimental virtual client engine** ([#781](https://github.com/adap/flower/pull/781) [#790](https://github.com/adap/flower/pull/790) [#791](https://github.com/adap/flower/pull/791))
fr: **Moteur expérimental de client virtuel** ([#781](https://github.com/adap/flower/pull/781) [#790](https://github.com/adap/flower/pull/790) [#791](https://github.com/adap/flower/pull/791))
zh_hans: **实验性虚拟客户端引擎** ([#781](https://github.com/adap/flower/pull/781) [#790](https://github.com/adap/flower/pull/790) [#791](https://github.com/adap/flower/pull/791))

source: One of Flower's goals is to enable research at scale. This release enables a first (experimental) peek at a major new feature, codenamed the virtual client engine. Virtual clients enable simulations that scale to a (very) large number of clients on a single machine or compute cluster. The easiest way to test the new functionality is to look at the two new code examples called `quickstart_simulation` and `simulation_pytorch`.
fr: L'un des objectifs de Flower est de permettre la recherche à grande échelle. Cette version donne un premier aperçu (expérimental) d'une nouvelle fonctionnalité majeure, connue sous le nom de code de moteur de client virtuel. Les clients virtuels permettent des simulations qui s'étendent à un (très) grand nombre de clients sur une seule machine ou une grappe de calcul. La façon la plus simple de tester la nouvelle fonctionnalité est de regarder les deux nouveaux exemples de code appelés `quickstart_simulation` et `simulation_pytorch`.
zh_hans: Flower 的目标之一是实现大规模研究。这一版本首次（试验性地）展示了代号为 "虚拟客户端引擎 "的重要新功能。虚拟客户端可以在单台机器或计算集群上对大量客户端进行模拟。测试新功能的最简单方法是查看名为 "quickstart_simulation "和 "simulation_pytorch "的两个新代码示例。

source: The feature is still experimental, so there's no stability guarantee for the API. It's also not quite ready for prime time and comes with a few known caveats. However, those who are curious are encouraged to try it out and share their thoughts.
fr: La fonction est encore expérimentale, il n'y a donc aucune garantie de stabilité pour l'API. Elle n'est pas non plus tout à fait prête pour le prime time et s'accompagne de quelques mises en garde connues. Cependant, les personnes curieuses sont encouragées à l'essayer et à faire part de leurs réflexions.
zh_hans: 该功能仍处于试验阶段，因此无法保证 API 的稳定性。此外，它还没有完全准备好进入黄金时间，并有一些已知的注意事项。不过，我们鼓励好奇的用户尝试使用并分享他们的想法。

source: **New built-in strategies** ([#828](https://github.com/adap/flower/pull/828) [#822](https://github.com/adap/flower/pull/822))
fr: **Nouvelles stratégies intégrées** ([#828](https://github.com/adap/flower/pull/828) [#822](https://github.com/adap/flower/pull/822))
zh_hans: **新的内置策略**（[#828](https://github.com/adap/flower/pull/828) [#822](https://github.com/adap/flower/pull/822)

source: FedYogi - Federated learning strategy using Yogi on server-side. Implementation based on https://arxiv.org/abs/2003.00295
fr: FedYogi - Stratégie d'apprentissage fédéré utilisant Yogi côté serveur. Mise en oeuvre basée sur https://arxiv.org/abs/2003.00295
zh_hans: FedYogi - 在服务器端使用 Yogi 的联邦学习策略。基于 https://arxiv.org/abs/2003.00295 实现

source: FedAdam - Federated learning strategy using Adam on server-side. Implementation based on https://arxiv.org/abs/2003.00295
fr: FedAdam - Stratégie d'apprentissage fédéré utilisant Adam côté serveur. Mise en œuvre basée sur https://arxiv.org/abs/2003.00295
zh_hans: FedAdam - 在服务器端使用 Adam 的联邦学习策略。基于 https://arxiv.org/abs/2003.00295 实现

source: **New PyTorch Lightning code example** ([#617](https://github.com/adap/flower/pull/617))
fr: **Nouvel exemple de code PyTorch Lightning** ([#617](https://github.com/adap/flower/pull/617))
zh_hans: **新的 PyTorch Lightning 代码示例** ([#617](https://github.com/adap/flower/pull/617))

source: **New Variational Auto-Encoder code example** ([#752](https://github.com/adap/flower/pull/752))
fr: **Nouvel exemple de code d'autocodage variationnel** ([#752](https://github.com/adap/flower/pull/752))
zh_hans: **新的变分自动编码器代码示例** ([#752](https://github.com/adap/flower/pull/752))

source: **New scikit-learn code example** ([#748](https://github.com/adap/flower/pull/748))
fr: **Nouvel exemple de code scikit-learn** ([#748](https://github.com/adap/flower/pull/748))
zh_hans: **新的 scikit-learn 代码示例** ([#748](https://github.com/adap/flower/pull/748))

source: **New experimental TensorBoard strategy** ([#789](https://github.com/adap/flower/pull/789))
fr: **Nouvelle stratégie expérimentale TensorBoard** ([#789](https://github.com/adap/flower/pull/789))
zh_hans: **新的实验性 TensorBoard 策略**（[#789](https://github.com/adap/flower/pull/789)）

source: Improved advanced TensorFlow code example ([#769](https://github.com/adap/flower/pull/769))
fr: Amélioration de l'exemple de code TensorFlow avancé ([#769](https://github.com/adap/flower/pull/769))
zh_hans: 改进的高级 TensorFlow 代码示例（[#769](https://github.com/adap/flower/pull/769)

source: Warning when `min_available_clients` is misconfigured ([#830](https://github.com/adap/flower/pull/830))
fr: Avertissement lorsque `min_available_clients` est mal configuré ([#830](https://github.com/adap/flower/pull/830))
zh_hans: 当 `min_available_clients` 配置错误时发出警告 ([#830](https://github.com/adap/flower/pull/830))

source: Improved gRPC server docs ([#841](https://github.com/adap/flower/pull/841))
fr: Amélioration de la documentation sur le serveur gRPC ([#841](https://github.com/adap/flower/pull/841))
zh_hans: 改进了 gRPC 服务器文档（[#841](https://github.com/adap/flower/pull/841)）

source: Improved error message in `NumPyClient` ([#851](https://github.com/adap/flower/pull/851))
fr: Amélioration du message d'erreur dans `NumPyClient` ([#851](https://github.com/adap/flower/pull/851))
zh_hans: 改进了 `NumPyClient` 中的错误信息 ([#851](https://github.com/adap/flower/pull/851))

source: Improved PyTorch quickstart code example ([#852](https://github.com/adap/flower/pull/852))
fr: Exemple de code de démarrage rapide PyTorch amélioré ([#852](https://github.com/adap/flower/pull/852))
zh_hans: 改进的 PyTorch 快速启动代码示例 ([#852](https://github.com/adap/flower/pull/852))

source: **Disabled final distributed evaluation** ([#800](https://github.com/adap/flower/pull/800))
fr: **Désactivé l'évaluation finale distribuée** ([#800](https://github.com/adap/flower/pull/800))
zh_hans: **禁用最终分布式评价** ([#800](https://github.com/adap/flower/pull/800))

source: Prior behaviour was to perform a final round of distributed evaluation on all connected clients, which is often not required (e.g., when using server-side evaluation). The prior behaviour can be enabled by passing `force_final_distributed_eval=True` to `start_server`.
fr: Le comportement précédent consistait à effectuer un dernier tour d'évaluation distribuée sur tous les clients connectés, ce qui n'est souvent pas nécessaire (par exemple, lors de l'utilisation de l'évaluation côté serveur). Le comportement précédent peut être activé en passant `force_final_distributed_eval=True` à `start_server`.
zh_hans: 之前的行为是在所有连接的客户端上执行最后一轮分布式评估，而这通常是不需要的（例如，在使用服务器端评估时）。可以通过向 `start_server` 传递 `force_final_distributed_eval=True` 来启用之前的行为。

source: **Renamed q-FedAvg strategy** ([#802](https://github.com/adap/flower/pull/802))
fr: **Renommé stratégie q-FedAvg** ([#802](https://github.com/adap/flower/pull/802))
zh_hans: **更名为 q-FedAvg 策略** ([#802](https://github.com/adap/flower/pull/802))
