Repository: lucacorbucci/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: fr, zh_hans

source: The strategy named `QffedAvg` was renamed to `QFedAvg` to better reflect the notation given in the original paper (q-FFL is the optimization objective, q-FedAvg is the proposed solver). Note the the original (now deprecated) `QffedAvg` class is still available for compatibility reasons (it will be removed in a future release).
fr: La stratégie nommée `QffedAvg` a été renommée en `QFedAvg` pour mieux refléter la notation donnée dans l'article original (q-FFL est l'objectif d'optimisation, q-FedAvg est le solveur proposé). Notez que la classe `QffedAvg` originale (maintenant obsolète) est toujours disponible pour des raisons de compatibilité (elle sera supprimée dans une prochaine version).
zh_hans: 名为 `QffedAvg` 的策略已更名为 `QFedAvg`，以更好地反映原始论文中给出的符号（q-FFL 是优化目标，q-FedAvg 是建议的求解器）。请注意，出于兼容性原因，原始（现已废弃）的 `QffedAvg` 类仍然可用（它将在未来的版本中移除）。

source: **Deprecated and renamed code example** `simulation_pytorch` **to** `simulation_pytorch_legacy` ([#791](https://github.com/adap/flower/pull/791))
fr: **Exemple de code déprécié et renommé** `simulation_pytorch` **en** `simulation_pytorch_legacy` ([#791](https://github.com/adap/flower/pull/791))
zh_hans: **删除并重命名代码示例**`simulation_pytorch`**为**`simulation_pytorch_legacy` ([#791](https://github.com/adap/flower/pull/791))

source: This example has been replaced by a new example. The new example is based on the experimental virtual client engine, which will become the new default way of doing most types of large-scale simulations in Flower. The existing example was kept for reference purposes, but it might be removed in the future.
fr: Cet exemple a été remplacé par un nouvel exemple. Le nouvel exemple est basé sur le moteur expérimental du client virtuel, qui deviendra la nouvelle méthode par défaut pour effectuer la plupart des types de simulations à grande échelle dans Flower. L'exemple existant a été conservé à des fins de référence, mais il pourrait être supprimé à l'avenir.
zh_hans: 该示例已被新示例取代。新示例基于试验性虚拟客户端引擎，它将成为在 Flower 中进行大多数类型大规模模拟的新的默认方式。现有示例将作为参考保留，但将来可能会删除。

source: **New built-in strategies** ([#549](https://github.com/adap/flower/pull/549))
fr: **Nouvelles stratégies intégrées** ([#549](https://github.com/adap/flower/pull/549))
zh_hans: **新的内置策略** ([#549](https://github.com/adap/flower/pull/549))

source: (abstract) FedOpt
fr: (résumé) FedOpt
zh_hans: （摘要） FedOpt

source: **Custom metrics for server and strategies** ([#717](https://github.com/adap/flower/pull/717))
fr: **Métriques personnalisées pour le serveur et les stratégies** ([#717](https://github.com/adap/flower/pull/717))
zh_hans: **服务器和策略的自定义指标** ([#717](https://github.com/adap/flower/pull/717))

source: The Flower server is now fully task-agnostic, all remaining instances of task-specific metrics (such as `accuracy`) have been replaced by custom metrics dictionaries. Flower 0.15 introduced the capability to pass a dictionary containing custom metrics from client to server. As of this release, custom metrics replace task-specific metrics on the server.
fr: Le serveur Flower est maintenant totalement agnostique, toutes les instances restantes de métriques spécifiques à une tâche (telles que `accuracy`) ont été remplacées par des dictionnaires de métriques personnalisées. Flower 0.15 a introduit la possibilité de passer un dictionnaire contenant des métriques personnalisées du client au serveur. À partir de cette version, les métriques personnalisées remplacent les métriques spécifiques à une tâche sur le serveur.
zh_hans: Flower 服务器现在完全与任务无关，所有剩余的任务特定度量（如 "准确度"）都已被自定义度量字典取代。Flower 0.15 引入了从客户端向服务器传递包含自定义指标的字典的功能。从本版本开始，自定义指标将取代服务器上的特定任务指标。

source: Custom metric dictionaries are now used in two user-facing APIs: they are returned from Strategy methods `aggregate_fit`/`aggregate_evaluate` and they enable evaluation functions passed to build-in strategies (via `eval_fn`) to return more than two evaluation metrics. Strategies can even return *aggregated* metrics dictionaries for the server to keep track of.
fr: Les dictionnaires de métriques personnalisés sont maintenant utilisés dans deux API orientées vers l'utilisateur : ils sont renvoyés par les méthodes de stratégie `aggregate_fit`/`aggregate_evaluate` et ils permettent aux fonctions d'évaluation passées aux stratégies intégrées (via `eval_fn`) de renvoyer plus de deux métriques d'évaluation. Les stratégies peuvent même renvoyer des dictionnaires de métriques *agrégées* pour que le serveur puisse en garder la trace.
zh_hans: 自定义度量字典现在可在两个面向用户的 API 中使用：它们可从策略方法 `aggregate_fit`/`aggregate_evaluate` 返回，还可使传递给内置策略（通过 `eval_fn`）的评估函数返回两个以上的评估度量。策略甚至可以返回 *aggregated* 指标字典，以便服务器跟踪。

source: Stratey implementations should migrate their `aggregate_fit` and `aggregate_evaluate` methods to the new return type (e.g., by simply returning an empty `{}`), server-side evaluation functions should migrate from `return loss, accuracy` to `return loss, {"accuracy": accuracy}`.
fr: Les implémentations de Stratey doivent migrer leurs méthodes `aggregate_fit` et `aggregate_evaluate` vers le nouveau type de retour (par exemple, en renvoyant simplement un `{}` vide), les fonctions d'évaluation côté serveur doivent migrer de `return loss, accuracy` à `return loss, {"accuracy" : accuracy}`.
zh_hans: Stratey 实现应将其 `aggregate_fit` 和 `aggregate_evaluate` 方法迁移到新的返回类型（例如，只需返回空的 `{}`），服务器端评估函数应从 `return loss, accuracy` 迁移到 `return loss, {"accuracy": accuracy}`。

source: Flower 0.15-style return types are deprecated (but still supported), compatibility will be removed in a future release.
fr: Les types de retour du style Flower 0.15 sont dépréciés (mais toujours pris en charge), la compatibilité sera supprimée dans une prochaine version.
zh_hans: Flower 0.15 风格的返回类型已被弃用（但仍受支持），兼容性将在未来的版本中移除。

source: **Migration warnings for deprecated functionality** ([#690](https://github.com/adap/flower/pull/690))
fr: **Avertissements de migration pour les fonctionnalités obsolètes** ([#690](https://github.com/adap/flower/pull/690))
zh_hans: ** 过时功能的迁移警告** ([#690](https://github.com/adap/flower/pull/690))

source: Earlier versions of Flower were often migrated to new APIs, while maintaining compatibility with legacy APIs. This release introduces detailed warning messages if usage of deprecated APIs is detected. The new warning messages often provide details on how to migrate to more recent APIs, thus easing the transition from one release to another.
fr: Les versions antérieures de Flower ont souvent été migrées vers de nouvelles API, tout en maintenant la compatibilité avec les anciennes API. Cette version introduit des messages d'avertissement détaillés si l'utilisation d'API obsolètes est détectée. Les nouveaux messages d'avertissement fournissent souvent des détails sur la façon de migrer vers des API plus récentes, facilitant ainsi la transition d'une version à l'autre.
zh_hans: Flower 早期版本通常会迁移到新的应用程序接口，同时保持与旧版应用程序接口的兼容。如果检测到使用了过时的 API，本版本将引入详细的警告信息。新的警告信息通常会详细说明如何迁移到更新的 API，从而简化从一个版本到另一个版本的过渡。

source: Improved docs and docstrings ([#691](https://github.com/adap/flower/pull/691) [#692](https://github.com/adap/flower/pull/692) [#713](https://github.com/adap/flower/pull/713))
fr: Amélioration des docs et des docstrings ([#691](https://github.com/adap/flower/pull/691) [#692](https://github.com/adap/flower/pull/692) [#713](https://github.com/adap/flower/pull/713))
zh_hans: 改进了文档和文档说明 ([#691](https://github.com/adap/flower/pull/691) [#692](https://github.com/adap/flower/pull/692) [#713](https://github.com/adap/flower/pull/713))

source: MXNet example and documentation
fr: Exemple et documentation MXNet
zh_hans: MXNet 示例和文档

source: FedBN implementation in example PyTorch: From Centralized To Federated ([#696](https://github.com/adap/flower/pull/696) [#702](https://github.com/adap/flower/pull/702) [#705](https://github.com/adap/flower/pull/705))
fr: Mise en œuvre de FedBN dans l'exemple PyTorch : De la centralisation à la fédération ([#696](https://github.com/adap/flower/pull/696) [#702](https://github.com/adap/flower/pull/702) [#705](https://github.com/adap/flower/pull/705))
zh_hans: PyTorch 示例中的 FedBN 实现： 从集中到联邦 ([#696](https://github.com/adap/flower/pull/696) [#702](https://github.com/adap/flower/pull/702) [#705](https://github.com/adap/flower/pull/705))

source: **Serialization-agnostic server** ([#721](https://github.com/adap/flower/pull/721))
fr: **Serveur agnostique de sérialisation** ([#721](https://github.com/adap/flower/pull/721))
zh_hans: **序列化无关服务器** ([#721](https://github.com/adap/flower/pull/721))

source: The Flower server is now fully serialization-agnostic. Prior usage of class `Weights` (which represents parameters as deserialized NumPy ndarrays) was replaced by class `Parameters` (e.g., in `Strategy`). `Parameters` objects are fully serialization-agnostic and represents parameters as byte arrays, the `tensor_type` attributes indicates how these byte arrays should be interpreted (e.g., for serialization/deserialization).
fr: Le serveur Flower est désormais totalement agnostique en matière de sérialisation. L'utilisation antérieure de la classe `Weights` (qui représente les paramètres sous forme de tableaux NumPy désérialisés) a été remplacée par la classe `Parameters` (par exemple, dans `Strategy`). Les objets `Parameters` sont totalement agnostiques en matière de sérialisation et représentent les paramètres sous forme de tableaux d'octets, les attributs `tensor_type` indiquent comment ces tableaux d'octets doivent être interprétés (par exemple, pour la sérialisation/désérialisation).
zh_hans: Flower 服务器现在完全不依赖序列化。之前使用的 `Weights` 类（以反序列化的 NumPy ndarrays 表示参数）已被 `Parameters` 类取代（例如在 `Strategy`中）。参数 "对象与序列化完全无关，它以字节数组的形式表示参数，"tensor_type "属性表示如何解释这些字节数组（例如，用于序列化/反序列化）。

source: Built-in strategies implement this approach by handling serialization and deserialization to/from `Weights` internally. Custom/3rd-party Strategy implementations should update to the slighly changed Strategy method definitions. Strategy authors can consult PR [#721](https://github.com/adap/flower/pull/721) to see how strategies can easily migrate to the new format.
fr: Les stratégies intégrées mettent en œuvre cette approche en gérant en interne la sérialisation et la désérialisation de `Weights`. Les implémentations de stratégies personnalisées ou tierces doivent être mises à jour avec les définitions de méthodes de stratégie légèrement modifiées. Les auteurs de stratégies peuvent consulter le PR [#721](https://github.com/adap/flower/pull/721) pour voir comment les stratégies peuvent facilement migrer vers le nouveau format.
zh_hans: 内置策略通过在内部处理序列化和反序列化到/从`Weights`来实现这种方法。自定义/第三方策略实现应更新为稍有改动的策略方法定义。策略作者可查阅 PR [#721](https://github.com/adap/flower/pull/721) 以了解如何将策略轻松迁移到新格式。

source: Deprecated `flwr.server.Server.evaluate`, use `flwr.server.Server.evaluate_round` instead ([#717](https://github.com/adap/flower/pull/717))
fr: Déclassé `flwr.server.Server.evaluate`, utiliser `flwr.server.Server.evaluate_round` à la place ([#717](https://github.com/adap/flower/pull/717))
zh_hans: 已弃用 `flwr.server.Server.evaluate`，改用 `flwr.server.Server.evaluate_round`（[#717](https://github.com/adap/flower/pull/717)

source: **Server-side parameter initialization** ([#658](https://github.com/adap/flower/pull/658))
fr: **Initialisation des paramètres côté serveur** ([#658](https://github.com/adap/flower/pull/658))
zh_hans: **服务器端参数初始化** ([#658](https://github.com/adap/flower/pull/658))

source: Model parameters can now be initialized on the server-side. Server-side parameter initialization works via a new `Strategy` method called `initialize_parameters`.
fr: Les paramètres du modèle peuvent maintenant être initialisés côté serveur. L'initialisation des paramètres côté serveur fonctionne via une nouvelle méthode `Strategy` appelée `initialize_parameters`.
zh_hans: 现在可以在服务器端初始化模型参数。服务器端参数初始化通过名为 "initialize_parameters "的新 "Strategy "方法进行。

source: Built-in strategies support a new constructor argument called `initial_parameters` to set the initial parameters. Built-in strategies will provide these initial parameters to the server on startup and then delete them to free the memory afterwards.
fr: Les stratégies intégrées prennent en charge un nouvel argument du constructeur appelé `initial_parameters` pour définir les paramètres initiaux. Les stratégies intégrées fourniront ces paramètres initiaux au serveur au démarrage et les supprimeront ensuite pour libérer la mémoire.
zh_hans: 内置策略支持名为 "initial_parameters "的新构造函数参数，用于设置初始参数。内置策略会在启动时向服务器提供这些初始参数，然后删除它们以释放内存。

source: If no initial parameters are provided to the strategy, the server will continue to use the current behaviour (namely, it will ask one of the connected clients for its parameters and use these as the initial global parameters).
fr: Si aucun paramètre initial n'est fourni à la stratégie, le serveur continuera à utiliser le comportement actuel (à savoir qu'il demandera à l'un des clients connectés ses paramètres et les utilisera comme paramètres globaux initiaux).
zh_hans: 如果没有向策略提供初始参数，服务器将继续使用当前行为（即向其中一个已连接的客户端询问参数，并将这些参数用作初始全局参数）。

source: Deprecations
fr: Dépréciations
zh_hans: 停用

source: Deprecate `flwr.server.strategy.DefaultStrategy` (migrate to `flwr.server.strategy.FedAvg`, which is equivalent)
fr: Déclasser `flwr.server.strategy.DefaultStrategy` (migrer vers `flwr.server.strategy.FedAvg`, qui est équivalent)
zh_hans: 停用 `flwr.server.strategy.DefaultStrategy`（迁移到等价的 `flwr.server.strategy.FedAvg`）

source: **Generalized** `Client.fit` **and** `Client.evaluate` **return values** ([#610](https://github.com/adap/flower/pull/610) [#572](https://github.com/adap/flower/pull/572) [#633](https://github.com/adap/flower/pull/633))
fr: **Généralisé** `Client.fit` **et** `Client.evaluate` **valeurs de retour** ([#610](https://github.com/adap/flower/pull/610) [#572](https://github.com/adap/flower/pull/572) [#633](https://github.com/adap/flower/pull/633))
zh_hans: **通用** `Client.fit` **和** `Client.evaluate` **返回值** ([#610](https://github.com/adap/flower/pull/610) [#572](https://github.com/adap/flower/pull/572) [#633](https://github.com/adap/flower/pull/633))

source: Clients can now return an additional dictionary mapping `str` keys to values of the following types: `bool`, `bytes`, `float`, `int`, `str`. This means one can return almost arbitrary values from `fit`/`evaluate` and make use of them on the server side!
fr: Les clients peuvent maintenant renvoyer un dictionnaire supplémentaire associant les clés `str` aux valeurs des types suivants : `bool`, `bytes`, `float`, `int`, `str`. Cela signifie que l'on peut renvoyer des valeurs presque arbitraires de `fit`/`evaluate` et les utiliser du côté du serveur !
zh_hans: 客户端现在可以返回一个额外的字典，将 `str` 键映射为以下类型的值： bool`、`bytes`、`float`、`int`、`str`。这意味着我们可以从 `fit`/`evaluate` 返回几乎任意的值，并在服务器端使用它们！

source: This improvement also allowed for more consistent return types between `fit` and `evaluate`: `evaluate` should now return a tuple `(float, int, dict)` representing the loss, number of examples, and a dictionary holding arbitrary problem-specific values like accuracy.
fr: Cette amélioration a également permis de rendre plus cohérents les types de retour entre `fit` et `evaluate` : `evaluate` devrait maintenant retourner un tuple `(float, int, dict)` représentant la perte, le nombre d'exemples, et un dictionnaire contenant des valeurs arbitraires spécifiques au problème comme la précision.
zh_hans: 这一改进还使 `fit` 和 `evaluate` 之间的返回类型更加一致：`evaluate` 现在应返回一个元组`(float, int, dict)`，代表损失、示例数和一个包含特定问题任意值（如准确度）的字典。

source: In case you wondered: this feature is compatible with existing projects, the additional dictionary return value is optional. New code should however migrate to the new return types to be compatible with upcoming Flower releases (`fit`: `List[np.ndarray], int, Dict[str, Scalar]`, `evaluate`: `float, int, Dict[str, Scalar]`). See the example below for details.
fr: Au cas où tu te poserais la question : cette fonctionnalité est compatible avec les projets existants, la valeur de retour supplémentaire du dictionnaire est facultative. Le nouveau code doit cependant migrer vers les nouveaux types de retour pour être compatible avec les prochaines versions de Flower (`fit` : `List[np.ndarray], int, Dict[str, Scalar]`, `evaluate` : `float, int, Dict[str, Scalar]`). Voir l'exemple ci-dessous pour plus de détails.
zh_hans: 如果你想知道：此功能与现有项目兼容，额外的字典返回值是可选的。不过，新代码应迁移到新的返回类型，以便与即将发布的 Flower 版本兼容（`fit`: `List[np.ndarray], int, Dict[str, Scalar]`，`evaluate`: `float, int, Dict[str, Scalar]`）。详见下面的示例。

source: *Code example:* note the additional dictionary return values in both `FlwrClient.fit` and `FlwrClient.evaluate`:
fr: *Exemple de code:* note les valeurs de retour du dictionnaire supplémentaires dans `FlwrClient.fit` et `FlwrClient.evaluate` :
zh_hans: *代码示例：* 注意 `FlwrClient.fit` 和 `FlwrClient.evaluate` 中的附加字典返回值：

source: **Generalized** `config` **argument in** `Client.fit` **and** `Client.evaluate` ([#595](https://github.com/adap/flower/pull/595))
fr: **Généralisé** `config` **argument dans** `Client.fit` **et** `Client.evaluate` ([#595](https://github.com/adap/flower/pull/595))
zh_hans: **在**`Client.fit` **和**`Client.evaluate`中泛化**`config`参数（[#595](https://github.com/adap/flower/pull/595)）

source: The `config` argument used to be of type `Dict[str, str]`, which means that dictionary values were expected to be strings. The new release generalizes this to enable values of the following types: `bool`, `bytes`, `float`, `int`, `str`.
fr: L'argument `config` était auparavant de type `Dict[str, str]`, ce qui signifie que les valeurs du dictionnaire devaient être des chaînes. La nouvelle version généralise cela pour permettre les valeurs des types suivants : `bool`, `bytes`, `float`, `int`, `str`.
zh_hans: `config`参数曾是 "字典[str, str]"类型，这意味着字典值应是字符串。新版本将其扩展为以下类型的值： bool`、`bytes`、`float`、`int`、`str`。

source: This means one can now pass almost arbitrary values to `fit`/`evaluate` using the `config` dictionary. Yay, no more `str(epochs)` on the server-side and `int(config["epochs"])` on the client side!
fr: Cela signifie que l'on peut maintenant passer des valeurs presque arbitraires à `fit`/`evaluate` en utilisant le dictionnaire `config`. Yay, plus de `str(epochs)` du côté serveur et `int(config["epochs"])` du côté client !
zh_hans: 这意味着现在可以使用 `config` 字典向 `fit`/`evaluate` 传递几乎任意的值。耶，服务器端不再需要 `str(epochs)`，客户端不再需要 `int(config["epochs"])`！

source: *Code example:* note that the `config` dictionary now contains non-`str` values in both `Client.fit` and `Client.evaluate`:
fr: *Exemple de code:* Notez que le dictionnaire `config` contient maintenant des valeurs autres que `str` dans `Client.fit` et `Client.evaluate` :
zh_hans: *代码示例：* 注意 `config` 字典现在在 `Client.fit` 和 `Client.evaluate` 中都包含非 `str` 值：

source: New example: PyTorch From Centralized To Federated ([#549](https://github.com/adap/flower/pull/549))
fr: Nouvel exemple : PyTorch de centralisé à fédéré ([#549](https://github.com/adap/flower/pull/549))
zh_hans: 新示例： PyTorch 从集中到联邦 ([#549](https://github.com/adap/flower/pull/549))

source: Improved documentation
fr: Amélioration de la documentation
zh_hans: 改进文档

source: New documentation theme ([#551](https://github.com/adap/flower/pull/551))
fr: Nouveau thème de documentation ([#551](https://github.com/adap/flower/pull/551))
zh_hans: 新文档主题 ([#551](https://github.com/adap/flower/pull/551))

source: New API reference ([#554](https://github.com/adap/flower/pull/554))
fr: Nouvelle référence API ([#554](https://github.com/adap/flower/pull/554))
zh_hans: 新的 API 参考 ([#554](https://github.com/adap/flower/pull/554))

source: Updated examples documentation ([#549](https://github.com/adap/flower/pull/549))
fr: Mise à jour de la documentation des exemples ([#549](https://github.com/adap/flower/pull/549))
zh_hans: 更新了示例文档 ([#549](https://github.com/adap/flower/pull/549))

source: Removed obsolete documentation ([#548](https://github.com/adap/flower/pull/548))
fr: Suppression de la documentation obsolète ([#548](https://github.com/adap/flower/pull/548))
zh_hans: 删除了过时的文档 ([#548](https://github.com/adap/flower/pull/548))

source: Bugfix:
fr: Correction de bogues :
zh_hans: 错误修正：

source: `Server.fit` does not disconnect clients when finished, disconnecting the clients is now handled in `flwr.server.start_server` ([#553](https://github.com/adap/flower/pull/553) [#540](https://github.com/adap/flower/issues/540)).
fr: `Server.fit` ne déconnecte pas les clients lorsqu'il est terminé, la déconnexion des clients est maintenant gérée dans `flwr.server.start_server` ([#553](https://github.com/adap/flower/pull/553) [#540](https://github.com/adap/flower/issues/540)).
zh_hans: Server.fit "完成后不会断开客户端连接，现在断开客户端连接是在 "flwr.server.start_server "中处理的（[#553](https://github.com/adap/flower/pull/553) [#540](https://github.com/adap/flower/issues/540)）。

source: Important changes:
fr: Changements importants :
zh_hans: 重要变更：

source: Added an example for embedded devices ([#507](https://github.com/adap/flower/pull/507))
fr: Ajout d'un exemple pour les périphériques embarqués ([#507](https://github.com/adap/flower/pull/507))
zh_hans: 添加了嵌入式设备示例 ([#507](https://github.com/adap/flower/pull/507))

source: Added a new NumPyClient (in addition to the existing KerasClient) ([#504](https://github.com/adap/flower/pull/504) [#508](https://github.com/adap/flower/pull/508))
fr: Ajout d'un nouveau NumPyClient (en plus du KerasClient existant) ([#504](https://github.com/adap/flower/pull/504) [#508](https://github.com/adap/flower/pull/508))
zh_hans: 添加了一个新的 NumPyClient（除现有的 KerasClient 之外）（[#504](https://github.com/adap/flower/pull/504) [#508](https://github.com/adap/flower/pull/508)

source: Deprecated `flwr_example` package and started to migrate examples into the top-level `examples` directory ([#494](https://github.com/adap/flower/pull/494) [#512](https://github.com/adap/flower/pull/512))
fr: Déclassement du paquet `flwr_example` et migration des exemples dans le répertoire de premier niveau `examples` ([#494](https://github.com/adap/flower/pull/494) [#512](https://github.com/adap/flower/pull/512))
zh_hans: 弃用 `flwr_example` 软件包，并开始将示例迁移到顶层的 `examples` 目录 ([#494](https://github.com/adap/flower/pull/494) [#512](https://github.com/adap/flower/pull/512))

source: Incompatible changes:
fr: Changements incompatibles :
zh_hans: 不兼容的更改：

source: Renamed strategy methods ([#486](https://github.com/adap/flower/pull/486)) to unify the naming of Flower's public APIs. Other public methods/functions (e.g., every method in `Client`, but also `Strategy.evaluate`) do not use the `on_` prefix, which is why we're removing it from the four methods in Strategy. To migrate rename the following `Strategy` methods accordingly:
fr: Renommé les méthodes de stratégie ([#486](https://github.com/adap/flower/pull/486)) pour unifier le nommage des API publiques de Flower. D'autres méthodes/fonctions publiques (par exemple, toutes les méthodes de `Client`, mais aussi `Strategy.evaluate`) n'utilisent pas le préfixe `on_`, c'est pourquoi nous le supprimons des quatre méthodes de Stratégie. Pour migrer, renommez les méthodes de `Strategy` suivantes en conséquence :
zh_hans: 重命名了策略方法（[#486](https://github.com/adap/flower/pull/486)），以统一 Flower公共 API 的命名。其他公共方法/函数（例如 `Client` 中的每个方法，以及 `Strategy.evaluate`）不使用 `on_` 前缀，这就是我们从 Strategy 中的四个方法中移除它的原因。迁移时，请相应地重命名以下 `Strategy` 方法：

source: Deprecated `DefaultStrategy` ([#479](https://github.com/adap/flower/pull/479)). To migrate use `FedAvg` instead.
fr: Déclassé `DefaultStrategy` ([#479](https://github.com/adap/flower/pull/479)). Pour migrer, utilisez `FedAvg` à la place.
zh_hans: 已废弃的 `DefaultStrategy` ([#479](https://github.com/adap/flower/pull/479)) 。迁移时请使用 `FedAvg`。
