Repository: lucacorbucci/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: fr, zh_hans

source: **Hardware properties.** Understanding the hardware environment that Flower is being used in helps to decide whether we should, for example, put more effort into supporting low-resource environments.
fr: **Comprendre l'environnement matériel dans lequel Flower est utilisé permet de décider si nous devrions, par exemple, faire plus d'efforts pour prendre en charge les environnements à faibles ressources.
zh_hans: **硬件属性** 了解 Flower 的硬件使用环境，有助于决定我们是否应在支持低资源环境等方面投入更多精力。

source: **Execution mode.** Knowing what execution mode Flower starts in enables us to understand how heavily certain features are being used and better prioritize based on that.
fr: **Mode d'exécution** Connaître le mode d'exécution dans lequel Flower démarre nous permet de comprendre à quel point certaines fonctionnalités sont utilisées et de mieux établir les priorités en fonction de cela.
zh_hans: ** 执行模式** 了解 Flower 的启动执行模式，能让我们了解某些功能的使用率，并据此更好地确定优先级。

source: **Cluster.** Flower telemetry assigns a random in-memory cluster ID each time a Flower workload starts. This allows us to understand which device types not only start Flower workloads but also successfully complete them.
fr: **Cluster.** La télémétrie Flower attribue un ID de cluster en mémoire aléatoire à chaque fois qu'une charge de travail Flower démarre. Cela nous permet de comprendre quels types d'appareils non seulement démarrent les charges de travail Flower, mais aussi les terminent avec succès.
zh_hans: **每次 Flower 工作负载启动时，Flower 遥测都会随机分配一个内存集群 ID。这样，我们就能了解哪些设备类型不仅启动了 Flower 工作负载，而且还成功完成了它们。

source: **Source.** Flower telemetry tries to store a random source ID in `~/.flwr/source` the first time a telemetry event is generated. The source ID is important to identify whether an issue is recurring or whether an issue is triggered by multiple clusters running concurrently (which often happens in simulation). For example, if a device runs multiple workloads at the same time, and this results in an issue, then, in order to reproduce the issue, multiple workloads must be started at the same time.
fr: **Source.** La télémétrie de Flower essaie de stocker un ID de source aléatoire dans `~/.flwr/source` la première fois qu'un événement de télémétrie est généré. L'ID de source est important pour identifier si un problème est récurrent ou si un problème est déclenché par plusieurs clusters fonctionnant simultanément (ce qui arrive souvent en simulation). Par exemple, si un périphérique exécute plusieurs charges de travail en même temps, et que cela entraîne un problème, alors, afin de reproduire le problème, plusieurs charges de travail doivent être démarrées en même temps.
zh_hans: **Source.** Flower 遥测会在第一次生成遥测事件时，尝试在 `~/.flwr/source` 中存储一个随机源 ID。源 ID 对于识别问题是否反复出现或问题是否由多个集群同时运行触发（这在模拟中经常发生）非常重要。例如，如果设备同时运行多个工作负载并导致问题，那么为了重现问题，必须同时启动多个工作负载。

source: You may delete the source ID at any time. If you wish for all events logged under a specific source ID to be deleted, you can send a deletion request mentioning the source ID to `telemetry@flower.dev`. All events related to that source ID will then be permanently deleted.
fr: Tu peux supprimer l'identifiant de la source à tout moment. Si tu souhaites que tous les événements enregistrés sous un identifiant de source spécifique soient supprimés, tu peux envoyer une demande de suppression mentionnant l'identifiant de source à `telemetry@flower.dev`. Tous les événements liés à cet identifiant de source seront alors définitivement supprimés.
zh_hans: 您可以随时删除源 ID。如果您希望删除特定源 ID 下记录的所有事件，可以向 `telemetry@flower.dev` 发送删除请求，并提及该源 ID。届时，与该源 ID 相关的所有事件都将被永久删除。

source: We will not collect any personally identifiable information. If you think any of the metrics collected could be misused in any way, please [get in touch with us](#how-to-contact-us). We will update this page to reflect any changes to the metrics collected and publish changes in the changelog.
fr: Nous ne collecterons aucune information personnelle identifiable. Si tu penses que l'une des métriques collectées pourrait être utilisée à mauvais escient de quelque manière que ce soit, merci de [nous contacter](#commentnouscontacter). Nous mettrons à jour cette page pour refléter toute modification des métriques collectées et nous publierons les changements dans le journal des modifications (changelog).
zh_hans: 我们不会收集任何个人身份信息。如果您认为所收集的任何指标可能以任何方式被滥用，请[与我们联系]（#how-to-contact-us）。我们将更新本页面，以反映对所收集指标的任何更改，并在更新日志中公布更改内容。

source: If you think other metrics would be helpful for us to better guide our decisions, please let us know! We will carefully review them; if we are confident that they do not compromise user privacy, we may add them.
fr: Si tu penses que d'autres mesures nous seraient utiles pour mieux orienter nos décisions, fais-le nous savoir ! Nous les examinerons attentivement ; si nous sommes convaincus qu'elles ne compromettent pas la vie privée des utilisateurs, nous pourrons les ajouter.
zh_hans: 如果您认为其他指标有助于我们更好地指导决策，请告诉我们！我们将仔细审查这些指标；如果我们确信它们不会损害用户隐私，我们可能会添加这些指标。

source: How to inspect what is being reported
fr: Comment inspecter ce qui est rapporté
zh_hans: 如何检查报告中的内容

source: We wanted to make it very easy for you to inspect what anonymous usage metrics are reported. You can view all the reported telemetry information by setting the environment variable `FLWR_TELEMETRY_LOGGING=1`. Logging is disabled by default. You may use logging independently from `FLWR_TELEMETRY_ENABLED` so that you can inspect the telemetry feature without sending any metrics.
fr: Nous avons voulu qu'il soit très facile pour toi d'inspecter les mesures d'utilisation anonymes qui sont rapportées. Tu peux voir toutes les informations de télémétrie rapportées en définissant la variable d'environnement `FLWR_TELEMETRY_LOGGING=1`. La journalisation est désactivée par défaut. Tu peux utiliser la journalisation indépendamment de `FLWR_TELEMETRY_ENABLED` afin d'inspecter la fonction de télémétrie sans envoyer de mesures.
zh_hans: 我们希望能让您轻松查看所报告的匿名使用指标。通过设置环境变量 `FLWR_TELEMETRY_LOGGING=1` 可以查看所有报告的遥测信息。日志记录默认为禁用。您可以不使用 `FLWR_TELEMETRY_ENABLED` 而单独使用日志记录，这样就可以在不发送任何指标的情况下检查遥测功能。

source: The inspect Flower telemetry without sending any anonymous usage metrics, use both environment variables:
fr: L'inspecteur Flower telemetry sans envoyer de métriques d'utilisation anonymes, utilise les deux variables d'environnement :
zh_hans: 在不发送任何匿名使用指标的情况下检查 Flower 遥测，可使用这两个环境变量：

source: How to contact us
fr: Comment nous contacter
zh_hans: 如何联系我们

source: We want to hear from you. If you have any feedback or ideas on how to improve the way we handle anonymous usage metrics, reach out to us via [Slack](https://flower.dev/join-slack/) (channel `#telemetry`) or email (`telemetry@flower.dev`).
fr: Si tu as des commentaires ou des idées pour améliorer la façon dont nous traitons les mesures d'utilisation anonymes, contacte-nous via [Slack](https://flower.dev/join-slack/) (canal `#telemetry`) ou par courriel (`telemetry@flower.dev`).
zh_hans: 我们希望听到您的意见。如果您对如何改进我们处理匿名使用指标的方式有任何反馈或想法，请通过 [Slack](https://flower.dev/join-slack/) （频道 `#telemetry`）或电子邮件 (`telemetry@flower.dev`)与我们联系。

source: Read this Federated Learning quickstart tutorial for creating an Android app using Flower.
zh_hans: 阅读本联邦学习快速入门教程，了解如何使用 Flower 创建 Android 应用程序。

source: Quickstart Android
zh_hans: 快速入门 Android

source: Let's build a federated learning system using TFLite and Flower on Android!
zh_hans: 让我们在 Android 上使用 TFLite 和 Flower 构建一个联邦学习系统！

source: Please refer to the `full code example <https://github.com/adap/flower/tree/main/examples/android>`_ to learn more.
zh_hans: 请参阅`完整代码示例 <https://github.com/adap/flower/tree/main/examples/android>`_了解更多信息。

source: Check out this Federated Learning quickstart tutorial for using Flower with FastAI to train a vision model on CIFAR-10.
zh_hans: 查看此联邦学习快速入门教程，了解如何使用 Flower 和 FastAI 在 CIFAR-10 上训练视觉模型。

source: Quickstart fastai
fr: Démarrage rapide fastai
zh_hans: 快速入门 fastai

source: Let's build a federated learning system using fastai and Flower!
fr: Construisons un système d'apprentissage fédéré en utilisant fastai et Flower !
zh_hans: 让我们用 fastai 和 Flower 建立一个联邦学习系统！

source: Please refer to the `full code example <https://github.com/adap/flower/tree/main/examples/quickstart-fastai>`_ to learn more.
zh_hans: 请参阅 `完整代码示例 <https://github.com/adap/flower/tree/main/examples/quickstart-fastai>`_了解更多信息。

source: Check out this Federating Learning quickstart tutorial for using Flower with HuggingFace Transformers in order to fine-tune an LLM.
zh_hans: 查看此联邦学习 快速入门教程，了解如何使用 Flower 和 HuggingFace Transformers 来微调 LLM。

source: Quickstart 🤗 Transformers
fr: Démarrage rapide 🤗 Transformateurs
zh_hans: 🤗 Transformers快速入门

source: Let's build a federated learning system using Hugging Face Transformers and Flower!
fr: Construisons un système d'apprentissage fédéré à l'aide des transformateurs Hugging Face et de Flower !
zh_hans: 让我们用Hugging Face Transformers和Flower来构建一个联邦学习系统！

source: We will leverage Hugging Face to federate the training of language models over multiple clients using Flower. More specifically, we will fine-tune a pre-trained Transformer model (distilBERT) for sequence classification over a dataset of IMDB ratings. The end goal is to detect if a movie rating is positive or negative.
fr: Nous nous appuierons sur Hugging Face pour fédérer l'entraînement de modèles de langage sur plusieurs clients à l'aide de Flower. Plus précisément, nous mettrons au point un modèle Transformer pré-entraîné (distilBERT) pour la classification de séquences sur un ensemble de données d'évaluations IMDB. L'objectif final est de détecter si l'évaluation d'un film est positive ou négative.
zh_hans: 我们将利用Hugging Face技术，使用 Flower 在多个客户端上联邦训练语言模型。更具体地说，我们将对预先训练好的 Transformer 模型（distilBERT）进行微调，以便在 IMDB 评分数据集上进行序列分类。最终目标是检测电影评分是正面还是负面。

source: Dependencies
fr: Dépendances
zh_hans: 依赖关系

source: To follow along this tutorial you will need to install the following packages: :code:`datasets`, :code:`evaluate`, :code:`flwr`, :code:`torch`, and :code:`transformers`. This can be done using :code:`pip`:
fr: Pour suivre ce tutoriel, tu devras installer les paquets suivants : :code:`datasets`, :code:`evaluate`, :code:`flwr`, :code:`torch`, et :code:`transformers`. Cela peut être fait en utilisant :code:`pip` :
zh_hans: 要学习本教程，您需要安装以下软件包： :code:`datasets`、 :code:`evaluate`、 :code:`flwr`、 :code:`torch`和 :code:`transformers`。这可以通过 :code:`pip` 来完成：

source: Standard Hugging Face workflow
fr: Flux de travail standard pour le visage
zh_hans: 标准Hugging Face工作流程

source: Handling the data
fr: Traitement des données
zh_hans: 处理数据

source: To fetch the IMDB dataset, we will use Hugging Face's :code:`datasets` library. We then need to tokenize the data and create :code:`PyTorch` dataloaders, this is all done in the :code:`load_data` function:
fr: Pour récupérer le jeu de données IMDB, nous utiliserons la bibliothèque :code:`datasets` de Hugging Face. Nous devons ensuite tokeniser les données et créer des :code:`PyTorch` dataloaders, ce qui est fait dans la fonction :code:`load_data` :
zh_hans: 为了获取 IMDB 数据集，我们将使用 Hugging Face 的 :code:`datasets` 库。然后，我们需要对数据进行标记化，并创建 :code:`PyTorch` 数据加载器，这些都将在 :code:`load_data` 函数中完成：

source: Training and testing the model
fr: Former et tester le modèle
zh_hans: 训练和测试模型

source: Once we have a way of creating our trainloader and testloader, we can take care of the training and testing. This is very similar to any :code:`PyTorch` training or testing loop:
fr: Une fois que nous avons trouvé un moyen de créer notre trainloader et notre testloader, nous pouvons nous occuper de l'entraînement et du test. C'est très similaire à n'importe quelle boucle d'entraînement ou de test :code:`PyTorch` :
zh_hans: 有了创建 trainloader 和 testloader 的方法后，我们就可以进行训练和测试了。这与任何 :code:`PyTorch` 训练或测试循环都非常相似：

source: Creating the model itself
fr: Créer le modèle lui-même
zh_hans: 创建模型本身

source: To create the model itself, we will just load the pre-trained distillBERT model using Hugging Face’s :code:`AutoModelForSequenceClassification` :
fr: Pour créer le modèle lui-même, nous allons simplement charger le modèle distillBERT pré-entraîné en utilisant le :code:`AutoModelForSequenceClassification` de Hugging Face :
zh_hans: 要创建模型本身，我们只需使用 Hugging Face 的 :code:`AutoModelForSequenceClassification` 加载预训练的 distillBERT 模型：

source: Federating the example
fr: Fédérer l'exemple
zh_hans: 将示例联邦化

source: Creating the IMDBClient
fr: Création du client IMDBC
zh_hans: 创建 IMDBClient

source: To federate our example to multiple clients, we first need to write our Flower client class (inheriting from :code:`flwr.client.NumPyClient`). This is very easy, as our model is a standard :code:`PyTorch` model:
fr: Pour fédérer notre exemple à plusieurs clients, nous devons d'abord écrire notre classe de client Flower (héritant de :code:`flwr.client.NumPyClient`). C'est très facile, car notre modèle est un modèle :code:`PyTorch` standard :
zh_hans: 要将我们的示例联邦到多个客户端，我们首先需要编写 Flower 客户端类（继承自 :code:`flwr.client.NumPyClient`）。这很容易，因为我们的模型是一个标准的 :code:`PyTorch` 模型：

source: The :code:`get_parameters` function lets the server get the client's parameters. Inversely, the :code:`set_parameters` function allows the server to send its parameters to the client. Finally, the :code:`fit` function trains the model locally for the client, and the :code:`evaluate` function tests the model locally and returns the relevant metrics.
fr: La fonction :code:`get_parameters` permet au serveur d'obtenir les paramètres du client. Inversement, la fonction :code:`set_parameters` permet au serveur d'envoyer ses paramètres au client. Enfin, la fonction :code:`fit` forme le modèle localement pour le client, et la fonction :code:`evaluate` teste le modèle localement et renvoie les mesures correspondantes.
zh_hans: :code:`get_parameters` 函数允许服务器获取客户端的参数。相反，:code:`set_parameters`函数允许服务器将其参数发送给客户端。最后，:code:`fit`函数在本地为客户端训练模型，:code:`evaluate`函数在本地测试模型并返回相关指标。

source: Starting the server
fr: Démarrer le serveur
zh_hans: 启动服务器

source: Now that we have a way to instantiate clients, we need to create our server in order to aggregate the results. Using Flower, this can be done very easily by first choosing a strategy (here, we are using :code:`FedAvg`, which will define the global weights as the average of all the clients' weights at each round) and then using the :code:`flwr.server.start_server` function:
fr: Maintenant que nous avons un moyen d'instancier les clients, nous devons créer notre serveur afin d'agréger les résultats. Avec Flower, cela peut être fait très facilement en choisissant d'abord une stratégie (ici, nous utilisons :code:`FedAvg`, qui définira les poids globaux comme la moyenne des poids de tous les clients à chaque tour) et en utilisant ensuite la fonction :code:`flwr.server.start_server` :
zh_hans: 现在我们有了实例化客户端的方法，我们需要创建服务器，以便汇总结果。使用 Flower，首先选择一个策略（这里我们使用 :code:`FedAvg`，它将把全局模型参数定义为每轮所有客户端模型参数的平均值），然后使用 :code:`flwr.server.start_server`函数，就可以非常轻松地完成这项工作：

source: The :code:`weighted_average` function is there to provide a way to aggregate the metrics distributed amongst the clients (basically this allows us to display a nice average accuracy and loss for every round).
fr: La fonction :code:`weighted_average` est là pour fournir un moyen d'agréger les mesures réparties entre les clients (en gros, cela nous permet d'afficher une belle moyenne de précision et de perte pour chaque tour).
zh_hans: 使用 :code:`weighted_average` 函数是为了提供一种方法来汇总分布在客户端的指标（基本上，这可以让我们显示每一轮的平均精度和损失值）。

source: Putting everything together
fr: Tout assembler
zh_hans: 把所有东西放在一起

source: We can now start client instances using:
fr: Nous pouvons maintenant démarrer des instances de clients en utilisant :
zh_hans: 现在我们可以使用：

source: And they will be able to connect to the server and start the federated training.
fr: Et ils pourront se connecter au serveur et démarrer la formation fédérée.
zh_hans: 他们就能连接到服务器，开始联邦训练。

source: If you want to check out everything put together, you should check out the full code example: [https://github.com/adap/flower/tree/main/examples/quickstart-huggingface](https://github.com/adap/flower/tree/main/examples/quickstart-huggingface).
zh_hans: 如果您想查看所有内容，请查看完整的代码示例： [https://github.com/adap/flower/tree/main/examples/quickstart-huggingface](https://github.com/adap/flower/tree/main/examples/quickstart-huggingface).

source: Of course, this is a very basic example, and a lot can be added or modified, it was just to showcase how simply we could federate a Hugging Face workflow using Flower.
fr: Bien sûr, c'est un exemple très basique, et beaucoup de choses peuvent être ajoutées ou modifiées, il s'agissait juste de montrer avec quelle simplicité on pouvait fédérer un flux de travail Hugging Face à l'aide de Flower.
zh_hans: 当然，这只是一个非常基本的示例，还可以添加或修改很多内容，只是为了展示我们可以如何简单地使用 Flower 联合Hugging Face的工作流程。

source: Note that in this example we used :code:`PyTorch`, but we could have very well used :code:`TensorFlow`.
fr: Notez que dans cet exemple, nous avons utilisé :code:`PyTorch`, mais nous aurions très bien pu utiliser :code:`TensorFlow`.
zh_hans: 请注意，在本例中我们使用了 :code:`PyTorch`，但也完全可以使用 :code:`TensorFlow`。

source: Read this Federated Learning quickstart tutorial for creating an iOS app using Flower to train a neural network on MNIST.
zh_hans: 阅读本联邦学习快速入门教程，了解如何使用 Flower 创建 iOS 应用程序，并在 MNIST 上训练神经网络。

source: Quickstart iOS
zh_hans: 快速入门 iOS

source: In this tutorial we will learn how to train a Neural Network on MNIST using Flower and CoreML on iOS devices.
zh_hans: 在本教程中，我们将学习如何在 iOS 设备上使用 Flower 和 CoreML 在 MNIST 上训练神经网络。

source: First of all, for running the Flower Python server, it is recommended to create a virtual environment and run everything within a `virtualenv <https://flower.dev/docs/recommended-env-setup.html>`_. For the Flower client implementation in iOS, it is recommended to use Xcode as our IDE.
zh_hans: 首先，为了运行 Flower Python 服务器，建议创建一个虚拟环境，并在 `virtualenv <https://flower.dev/docs/recommended-env-setup.html>`_ 中运行一切。对于在 iOS 中实现 Flower 客户端，建议使用 Xcode 作为我们的集成开发环境。

source: Our example consists of one Python *server* and two iPhone *clients* that all have the same model.
zh_hans: 我们的示例包括一个 Python *服务器*和两个 iPhone *客户端*，它们都具有相同的模型。

source: *Clients* are responsible for generating individual weight updates for the model based on their local datasets. These updates are then sent to the *server* which will aggregate them to produce a better model. Finally, the *server* sends this improved version of the model back to each *client*. A complete cycle of weight updates is called a *round*.
zh_hans: *客户端*负责根据其本地数据集为模型生成独立的模型参数。然后，这些参数更新会被发送到*服务器*，由*服务器*汇总后生成一个更好的模型。最后，*服务器*将改进后的模型发送回每个*客户端*。一个完整的参数更新周期称为一*轮*。

source: Now that we have a rough idea of what is going on, let's get started to setup our Flower server environment. We first need to install Flower. You can do this by using pip:
zh_hans: 现在我们已经有了一个大致的概念，让我们开始设置 Flower 服务器环境吧。首先，我们需要安装 Flower。你可以使用 pip 来安装：

source: Or Poetry:
zh_hans: 或者Poetry：

source: Now that we have all our dependencies installed, let's run a simple distributed training using CoreML as our local training pipeline and MNIST as our dataset. For simplicity reasons we will use the complete Flower client with CoreML, that has been implemented and stored inside the Swift SDK. The client implementation can be seen below:
zh_hans: 现在我们已经安装了所有依赖项，让我们使用 CoreML 作为本地训练框架和 MNIST 作为数据集，运行一个简单的分布式训练。为了简单起见，我们将使用 CoreML 的完整 Flower 客户端，该客户端已在 Swift SDK 中实现并存储。客户端实现如下：

source: Let's create a new application project in Xcode and add :code:`flwr` as a dependency in your project. For our application, we will store the logic of our app in :code:`FLiOSModel.swift` and the UI elements in :code:`ContentView.swift`. We will focus more on :code:`FLiOSModel.swift` in this quickstart. Please refer to the `full code example <https://github.com/adap/flower/tree/main/examples/ios>`_ to learn more about the app.
zh_hans: 让我们在 Xcode 中创建一个新的应用程序项目，并在项目中添加 :code:`flwr` 作为依赖关系。对于我们的应用程序，我们将在 :code:`FLiOSModel.swift` 中存储应用程序的逻辑，在 :code:`ContentView.swift` 中存储 UI 元素。在本快速入门中，我们将更多地关注 :code:`FLiOSModel.swift`。请参阅 `完整代码示例 <https://github.com/adap/flower/tree/main/examples/ios>`_ 以了解更多有关应用程序的信息。

source: Import Flower and CoreML related packages in :code:`FLiOSModel.swift`:
zh_hans: 在 :code:`FLiOSModel.swift` 中导入 Flower 和 CoreML 相关软件包：

source: Then add the mlmodel to the project simply by drag-and-drop, the mlmodel will be bundled inside the application during deployment to your iOS device. We need to pass the url to access mlmodel and run CoreML machine learning processes, it can be retrieved by calling the function :code:`Bundle.main.url`. For the MNIST dataset, we need to preprocess it into :code:`MLBatchProvider` object. The preprocessing is done inside :code:`DataLoader.swift`.
zh_hans: 然后通过拖放将 mlmodel 添加到项目中，在部署到 iOS 设备时，mlmodel 将被捆绑到应用程序中。我们需要传递 url 以访问 mlmodel 并运行 CoreML 机器学习进程，可通过调用函数 :code:`Bundle.main.url` 获取。对于 MNIST 数据集，我们需要将其预处理为 :code:`MLBatchProvider` 对象。预处理在 :code:`DataLoader.swift` 中完成。

source: Since CoreML does not allow the model parameters to be seen before training, and accessing the model parameters during or after the training can only be done by specifying the layer name, we need to know this informations beforehand, through looking at the model specification, which are written as proto files. The implementation can be seen in :code:`MLModelInspect`.
zh_hans: 由于 CoreML 不允许在训练前查看模型参数，而在训练过程中或训练后访问模型参数只能通过指定层名来完成，因此我们需要事先通过查看模型规范（写成 proto 文件）来了解这些信息。具体实现可参见 :code:`MLModelInspect`。

source: After we have all of the necessary informations, let's create our Flower client.
zh_hans: 获得所有必要信息后，让我们创建 Flower 客户端。

source: Then start the Flower gRPC client and start communicating to the server by passing our Flower client to the function :code:`startFlwrGRPC`.
zh_hans: 然后启动 Flower gRPC 客户端，并通过将 Flower 客户端传递给函数 :code:`startFlwrGRPC` 来开始与服务器通信。

source: That's it for the client. We only have to implement :code:`Client` or call the provided :code:`MLFlwrClient` and call :code:`startFlwrGRPC()`. The attribute :code:`hostname` and :code:`port` tells the client which server to connect to. This can be done by entering the hostname and port in the application before clicking the start button to start the federated learning process.
zh_hans: 这就是客户端。我们只需实现 :code:`Client` 或调用提供的 :code:`MLFlwrClient` 并调用 :code:`startFlwrGRPC()`。属性 :code:`hostname` 和 :code:`port` 会告诉客户端要连接到哪个服务器。这可以通过在应用程序中输入主机名和端口来实现，然后再点击开始按钮启动联邦学习进程。

source: For simple workloads we can start a Flower server and leave all the configuration possibilities at their default values. In a file named :code:`server.py`, import Flower and start the server:
fr: Pour les charges de travail simples, nous pouvons démarrer un serveur Flower et laisser toutes les possibilités de configuration à leurs valeurs par défaut. Dans un fichier nommé :code:`server.py`, importe Flower et démarre le serveur :
zh_hans: 对于简单的工作负载，我们可以启动 Flower 服务器，并将所有配置选项保留为默认值。在名为 :code:`server.py` 的文件中，导入 Flower 并启动服务器：

source: Train the model, federated!
fr: Entraîne le modèle, fédéré !
zh_hans: 联邦训练模型！

source: With both client and server ready, we can now run everything and see federated learning in action. FL systems usually have a server and multiple clients. We therefore have to start the server first:
fr: Le client et le serveur étant prêts, nous pouvons maintenant tout exécuter et voir l'apprentissage fédéré en action. Les systèmes FL ont généralement un serveur et plusieurs clients. Nous devons donc commencer par démarrer le serveur :
zh_hans: 客户端和服务器都已准备就绪，我们现在可以运行一切，看看联邦学习的实际效果。FL 系统通常有一个服务器和多个客户端。因此，我们必须先启动服务器：
