Repository: lucacorbucci/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: fr, zh_hans

source: **Introduce Differential Privacy wrappers (preview)** ([#1357](https://github.com/adap/flower/pull/1357), [#1460](https://github.com/adap/flower/pull/1460))
fr: **Introduire les enveloppes de confidentialité différentielle (aperçu)** ([#1357](https://github.com/adap/flower/pull/1357), [#1460](https://github.com/adap/flower/pull/1460))
zh_hans: **引入差分隐私包装器（预览）** ([#1357](https://github.com/adap/flower/pull/1357), [#1460](https://github.com/adap/flower/pull/1460))

source: The first (experimental) preview of pluggable Differential Privacy wrappers enables easy configuration and usage of differential privacy (DP). The pluggable DP wrappers enable framework-agnostic **and** strategy-agnostic usage of both client-side DP and server-side DP. Head over to the Flower docs, a new explainer goes into more detail.
fr: Le premier aperçu (expérimental) des wrappers enfichables de confidentialité différentielle permet de configurer et d'utiliser facilement la confidentialité différentielle (DP). Les wrappers DP enfichables permettent une utilisation agnostique du cadre **et** de la stratégie à la fois de la DP côté client et de la DP côté serveur. Va voir les documents de Flower, un nouvel explicatif va plus loin dans les détails.
zh_hans: 可插拔差分隐私封装器的首个（实验性）预览版可轻松配置和使用差分隐私（DP）。可插拔的差分隐私封装器可实现客户端差分隐私和服务器端差分隐私的框架无关**以及**策略无关的使用。请访问 Flower 文档，新的解释器会提供更多细节。

source: **New iOS CoreML code example** ([#1289](https://github.com/adap/flower/pull/1289))
fr: **Nouvel exemple de code CoreML pour iOS** ([#1289](https://github.com/adap/flower/pull/1289))
zh_hans: **新的 iOS CoreML 代码示例**（[#1289](https://github.com/adap/flower/pull/1289)）

source: Flower goes iOS! A massive new code example shows how Flower clients can be built for iOS. The code example contains both Flower iOS SDK components that can be used for many tasks, and one task example running on CoreML.
fr: Flower passe à iOS ! Un nouvel exemple de code massif montre comment les clients Flower peuvent être construits pour iOS. L'exemple de code contient à la fois des composants Flower iOS SDK qui peuvent être utilisés pour de nombreuses tâches, et un exemple de tâche fonctionnant sur CoreML.
zh_hans: Flower 进入 iOS！大量新代码示例展示了如何为 iOS 构建 Flower 客户端。该代码示例包含可用于多种任务的 Flower iOS SDK 组件，以及在 CoreML 上运行的一个任务示例。

source: **New FedMedian strategy** ([#1461](https://github.com/adap/flower/pull/1461))
fr: **Nouvelle stratégie de FedMedian** ([#1461](https://github.com/adap/flower/pull/1461))
zh_hans: **新的联邦医疗策略** ([#1461](https://github.com/adap/flower/pull/1461))

source: The new `FedMedian` strategy implements Federated Median (FedMedian) by [Yin et al., 2018](https://arxiv.org/pdf/1803.01498v1.pdf).
fr: La nouvelle stratégie `FedMedian` met en œuvre Federated Median (FedMedian) par [Yin et al., 2018] (https://arxiv.org/pdf/1803.01498v1.pdf).
zh_hans: 新的 "FedMedian "战略实现了[Yin 等人，2018]的联邦中值（FedMedian）(https://arxiv.org/pdf/1803.01498v1.pdf)。

source: **Log** `Client` **exceptions in Virtual Client Engine** ([#1493](https://github.com/adap/flower/pull/1493))
fr: **Log** `Client` **exceptions dans le moteur de client virtuel** ([#1493](https://github.com/adap/flower/pull/1493))
zh_hans: **虚拟客户端引擎中的**日志**`客户端`**异常（[#1493](https://github.com/adap/flower/pull/1493)）

source: All `Client` exceptions happening in the VCE are now logged by default and not just exposed to the configured `Strategy` (via the `failures` argument).
fr: Toutes les exceptions `Client` qui se produisent dans le VCE sont maintenant enregistrées par défaut et ne sont pas seulement exposées à la `Stratégie` configurée (via l'argument `failures`).
zh_hans: VCE 中发生的所有 "客户端 "异常现在都会被默认记录下来，而不只是暴露给配置的 `Strategy`（通过 `failures`参数）。

source: **Improve Virtual Client Engine internals** ([#1401](https://github.com/adap/flower/pull/1401), [#1453](https://github.com/adap/flower/pull/1453))
fr: **Améliorer le moteur du client virtuel** ([#1401](https://github.com/adap/flower/pull/1401), [#1453](https://github.com/adap/flower/pull/1453))
zh_hans: **改进虚拟客户端引擎内部**（[#1401](https://github.com/adap/flower/pull/1401)、[#1453](https://github.com/adap/flower/pull/1453)）

source: Some internals of the Virtual Client Engine have been revamped. The VCE now uses Ray 2.0 under the hood, the value type of the `client_resources` dictionary changed to `float` to allow fractions of resources to be allocated.
fr: Le VCE utilise maintenant Ray 2.0 sous le capot, le type de valeur du dictionnaire `client_resources` a été remplacé par `float` pour permettre l'allocation de fractions de ressources.
zh_hans: 虚拟客户端引擎的部分内部结构已进行了修改。VCE 现在使用 Ray 2.0，"client_resources "字典的值类型改为 "float"，以允许分配分数资源。

source: **Support optional** `Client`**/**`NumPyClient` **methods in Virtual Client Engine**
zh_hans: **支持虚拟客户端引擎中的可选** `Client`**/**`NumPyClient` **方法**

source: The Virtual Client Engine now has full support for optional `Client` (and `NumPyClient`) methods.
fr: Le moteur de client virtuel prend désormais en charge les méthodes optionnelles `Client` (et `NumPyClient`).
zh_hans: 虚拟客户端引擎现在完全支持可选的 `Client`（和 `NumPyClient`）方法。

source: **Provide type information to packages using** `flwr` ([#1377](https://github.com/adap/flower/pull/1377))
fr: **Fournir des informations de type aux paquets en utilisant** `flwr` ([#1377](https://github.com/adap/flower/pull/1377))
zh_hans: **使用** `flwr`向软件包提供类型信息 ([#1377](https://github.com/adap/flower/pull/1377))

source: The package `flwr` is now bundled with a `py.typed` file indicating that the package is typed. This enables typing support for projects or packages that use `flwr` by enabling them to improve their code using static type checkers like `mypy`.
fr: Le paquet `flwr` est maintenant accompagné d'un fichier `py.typed` indiquant que le paquet est typé. Cela permet de prendre en charge le typage pour les projets ou les paquets qui utilisent `flwr` en leur permettant d'améliorer leur code à l'aide de vérificateurs de types statiques comme `mypy`.
zh_hans: 软件包 `flwr` 现在捆绑了一个 `py.typed` 文件，表明该软件包是类型化的。这样，使用 `flwr` 的项目或软件包就可以使用 `mypy` 等静态类型检查器改进代码，从而获得类型支持。

source: **Updated code example** ([#1344](https://github.com/adap/flower/pull/1344), [#1347](https://github.com/adap/flower/pull/1347))
fr: **Exemple de code mis à jour** ([#1344](https://github.com/adap/flower/pull/1344), [#1347](https://github.com/adap/flower/pull/1347))
zh_hans: ** 更新代码示例** ([#1344](https://github.com/adap/flower/pull/1344), [#1347](https://github.com/adap/flower/pull/1347))

source: The code examples covering scikit-learn and PyTorch Lightning have been updated to work with the latest version of Flower.
fr: Les exemples de code couvrant scikit-learn et PyTorch Lightning ont été mis à jour pour fonctionner avec la dernière version de Flower.
zh_hans: 涵盖 scikit-learn 和 PyTorch Lightning 的代码示例已更新，以便与最新版本的 Flower 配合使用。

source: **Updated documentation** ([#1355](https://github.com/adap/flower/pull/1355), [#1558](https://github.com/adap/flower/pull/1558), [#1379](https://github.com/adap/flower/pull/1379), [#1380](https://github.com/adap/flower/pull/1380), [#1381](https://github.com/adap/flower/pull/1381), [#1332](https://github.com/adap/flower/pull/1332), [#1391](https://github.com/adap/flower/pull/1391), [#1403](https://github.com/adap/flower/pull/1403), [#1364](https://github.com/adap/flower/pull/1364), [#1409](https://github.com/adap/flower/pull/1409), [#1419](https://github.com/adap/flower/pull/1419), [#1444](https://github.com/adap/flower/pull/1444), [#1448](https://github.com/adap/flower/pull/1448), [#1417](https://github.com/adap/flower/pull/1417), [#1449](https://github.com/adap/flower/pull/1449), [#1465](https://github.com/adap/flower/pull/1465), [#1467](https://github.com/adap/flower/pull/1467))
fr: **Documentation mise à jour** ([#1355](https://github.com/adap/flower/pull/1355), [#1558](https://github.com/adap/flower/pull/1558), [#1379](https://github.com/adap/flower/pull/1379), [#1380](https://github.com/adap/flower/pull/1380), [#1381](https://github.com/adap/flower/pull/1381), [#1332](https://github.com/adap/flower/pull/1332), [#1391](https://github.com/adap/flower/pull/1391), [#1403](https://github.com/adap/flower/pull/1403), [#1364](https://github.com/adap/flower/pull/1364), [#1409](https://github.com/adap/flower/pull/1409), [#1419](https://github.com/adap/flower/pull/1419), [#1444](https://github.com/adap/flower/pull/1444), [#1448](https://github.com/adap/flower/pull/1448), [#1417](https://github.com/adap/flower/pull/1417), [#1449](https://github.com/adap/flower/pull/1449), [#1465](https://github.com/adap/flower/pull/1465), [#1467](https://github.com/adap/flower/pull/1467))
zh_hans: **更新文档** ([#1355](https://github.com/adap/flower/pull/1355), [#1558](https://github.com/adap/flower/pull/1558), [#1379](https://github.com/adap/flower/pull/1379), [#1380](https://github.com/adap/flower/pull/1380), [#1381](https://github.com/adap/flower/pull/1381), [#1332](https://github.com/adap/flower/pull/1332), [#1391](https://github.com/adap/flower/pull/1391), [#1403](https://github.com/adap/flower/pull/1403), [#1364](https://github. com/adap/flower/pull/1364), [#1409](https://github.com/adap/flower/pull/1409), [#1419](https://github.com/adap/flower/pull/1419), [#1444](https://github.com/adap/flower/pull/1444), [#1448](https://github.com/adap/flower/pull/1448), [#1417](https://github.com/adap/flower/pull/1417), [#1449](https://github.com/adap/flower/pull/1449), [#1465](https://github.com/adap/flower/pull/1465), [#1467](https://github.com/adap/flower/pull/1467))

source: There have been so many documentation updates that it doesn't even make sense to list them individually.
fr: Il y a eu tellement de mises à jour de la documentation que cela n'a même pas de sens de les énumérer individuellement.
zh_hans: 文档更新的数量之多，甚至没有必要逐一列出。

source: **Restructured documentation** ([#1387](https://github.com/adap/flower/pull/1387))
fr: **Documentation restructurée** ([#1387](https://github.com/adap/flower/pull/1387))
zh_hans: **重构文档**（[#1387](https://github.com/adap/flower/pull/1387)）

source: The documentation has been restructured to make it easier to navigate. This is just the first step in a larger effort to make the Flower documentation the best documentation of any project ever. Stay tuned!
fr: La documentation a été restructurée pour faciliter la navigation. Ce n'est que la première étape d'un effort plus important visant à faire de la documentation de Flower la meilleure documentation de tous les projets
zh_hans: 我们对文档进行了重组，使其更易于浏览。这只是让 Flower 文档成为所有项目中最好文档的第一步。敬请期待！

source: **Open in Colab button** ([#1389](https://github.com/adap/flower/pull/1389))
fr: **Ouvrir dans le bouton Colab** ([#1389](https://github.com/adap/flower/pull/1389))
zh_hans: **在 Colab 中打开按钮** ([#1389](https://github.com/adap/flower/pull/1389))

source: The four parts of the Flower Federated Learning Tutorial now come with a new `Open in Colab` button. No need to install anything on your local machine, you can now use and learn about Flower in your browser, it's only a single click away.
fr: Les quatre parties du didacticiel d'apprentissage fédéré Flower sont maintenant accompagnées d'un nouveau bouton "Ouvrir dans Colab". Pas besoin d'installer quoi que ce soit sur ta machine locale, tu peux maintenant utiliser et apprendre à connaître Flower dans ton navigateur, il te suffit d'un simple clic.
zh_hans: Flower 联邦学习教程的四个部分现在都带有一个新的 "在 Colab 中打开 "按钮。现在，您无需在本地计算机上安装任何软件，只需点击一下，就可以在浏览器中使用和学习 Flower。

source: **Improved tutorial** ([#1468](https://github.com/adap/flower/pull/1468), [#1470](https://github.com/adap/flower/pull/1470), [#1472](https://github.com/adap/flower/pull/1472), [#1473](https://github.com/adap/flower/pull/1473), [#1474](https://github.com/adap/flower/pull/1474), [#1475](https://github.com/adap/flower/pull/1475))
fr: **Tutoriel amélioré** ([#1468](https://github.com/adap/flower/pull/1468), [#1470](https://github.com/adap/flower/pull/1470), [#1472](https://github.com/adap/flower/pull/1472), [#1473](https://github.com/adap/flower/pull/1473), [#1474](https://github.com/adap/flower/pull/1474), [#1475](https://github.com/adap/flower/pull/1475))
zh_hans: **改进教程** ([#1468](https://github.com/adap/flower/pull/1468), [#1470](https://github.com/adap/flower/pull/1470), [#1472](https://github.com/adap/flower/pull/1472), [#1473](https://github.com/adap/flower/pull/1473), [#1474](https://github.com/adap/flower/pull/1474), [#1475](https://github.com/adap/flower/pull/1475)))

source: The Flower Federated Learning Tutorial has two brand-new parts covering custom strategies (still WIP) and the distinction between `Client` and `NumPyClient`. The existing parts one and two have also been improved (many small changes and fixes).
fr: Le tutoriel sur l'apprentissage fédéré des fleurs a deux toutes nouvelles parties couvrant les stratégies personnalisées (encore WIP) et la distinction entre `Client` et `NumPyClient`. Les parties un et deux existantes ont également été améliorées (beaucoup de petits changements et de corrections).
zh_hans: Flower 联邦学习教程有两个全新的部分，涉及自定义策略（仍处于 WIP 阶段）和 `Client` 与 `NumPyClient` 之间的区别。现有的第一和第二部分也得到了改进（许多小改动和修正）。

source: Highlights
fr: Points forts
zh_hans: 亮点

source: Stable **Virtual Client Engine** (accessible via `start_simulation`)
fr: Moteur de client virtuel stable** (accessible via `start_simulation`)
zh_hans: 稳定的**虚拟客户端引擎**（可通过`start_simulation`访问）

source: All `Client`/`NumPyClient` methods are now optional
fr: Toutes les méthodes `Client`/`NumPyClient` sont maintenant optionnelles
zh_hans: 所有 `Client`/`NumPyClient` 方法现在都是可选的了

source: Configurable `get_parameters`
fr: `get_parameters` configurable
zh_hans: 可配置的`get_parameters`

source: Tons of small API cleanups resulting in a more coherent developer experience
fr: Des tonnes de petits nettoyages d'API résultant en une expérience plus cohérente pour les développeurs
zh_hans: 对大量小型应用程序接口进行了清理，使开发人员的体验更加一致

source: We would like to give our **special thanks** to all the contributors who made Flower 1.0 possible (in reverse [GitHub Contributors](https://github.com/adap/flower/graphs/contributors) order):
fr: Nous tenons à remercier **particulièrement** tous les contributeurs qui ont rendu Flower 1.0 possible (dans l'ordre inverse de [GitHub Contributors](https://github.com/adap/flower/graphs/contributors)) :
zh_hans: 在此，我们谨向所有促成 Flower 1.0 的贡献者致以**特别的谢意（按[GitHub 贡献者](https://github.com/adap/flower/graphs/contributors) 倒序排列）：

source: **All arguments must be passed as keyword arguments** ([#1338](https://github.com/adap/flower/pull/1338))
fr: **Tous les arguments doivent être passés comme des arguments de mot-clé** ([#1338](https://github.com/adap/flower/pull/1338))
zh_hans: ** 所有参数必须作为关键字参数传递** ([#1338](https://github.com/adap/flower/pull/1338))

source: Pass all arguments as keyword arguments, positional arguments are not longer supported. Code that uses positional arguments (e.g., `start_client("127.0.0.1:8080", FlowerClient())`) must add the keyword for each positional argument (e.g., `start_client(server_address="127.0.0.1:8080", client=FlowerClient())`).
zh_hans: 以关键字参数传递所有参数，不再支持位置参数。使用位置参数的代码（例如，`start_client("127.0.0.1:8080", FlowerClient())`）必须为每个位置参数添加关键字（例如，`start_client(server_address="127.0.0.1:8080", client=FlowerClient())`）。

source: **Introduce configuration object** `ServerConfig` **in** `start_server` **and** `start_simulation` ([#1317](https://github.com/adap/flower/pull/1317))
fr: **Introduire l'objet de configuration** `ServerConfig` **dans** `start_server` **et** `start_simulation` ([#1317](https://github.com/adap/flower/pull/1317))
zh_hans: **在*** `start_server` ***和*** `start_simulation` 中引入配置对象*** `ServerConfig` ([#1317](https://github.com/adap/flower/pull/1317))

source: Instead of a config dictionary `{"num_rounds": 3, "round_timeout": 600.0}`, `start_server` and `start_simulation` now expect a configuration object of type `flwr.server.ServerConfig`. `ServerConfig` takes the same arguments that as the previous config dict, but it makes writing type-safe code easier and the default parameters values more transparent.
fr: Au lieu d'un dictionnaire de configuration `{"num_rounds" : 3, "round_timeout" : 600.0}`, `start_server` et `start_simulation` attendent maintenant un objet de configuration de type `flwr.server.ServerConfig`. `ServerConfig` prend les mêmes arguments que le dict de configuration précédent, mais il rend l'écriture de code sécurisé plus facile et les valeurs des paramètres par défaut plus transparentes.
zh_hans: 并非配置字典`{"num_rounds"： 3, "round_timeout"： 600.0}`, `start_server`和 `start_simulation`现在用一个类型为 `flwr.server.ServerConfig`的配置对象。`ServerConfig`接收的参数与之前的 config dict 相同，但它使编写类型安全代码变得更容易，默认参数值也更加透明。

source: **Rename built-in strategy parameters for clarity** ([#1334](https://github.com/adap/flower/pull/1334))
fr: **Renommer les paramètres de la stratégie intégrée pour plus de clarté** ([#1334](https://github.com/adap/flower/pull/1334))
zh_hans: **重新命名内置策略参数，使其更加清晰** ([#1334](https://github.com/adap/flower/pull/1334))

source: The following built-in strategy parameters were renamed to improve readability and consistency with other API's:
fr: Les paramètres de stratégie intégrés suivants ont été renommés pour améliorer la lisibilité et la cohérence avec d'autres API :
zh_hans: 以下内置策略参数已重新命名，以提高可读性并与其他 API 保持一致：

source: **Update default arguments of built-in strategies** ([#1278](https://github.com/adap/flower/pull/1278))
fr: **Mettre à jour les arguments par défaut des stratégies intégrées** ([#1278](https://github.com/adap/flower/pull/1278))
zh_hans: **更新内置策略的默认参数** ([#1278](https://github.com/adap/flower/pull/1278))

source: All built-in strategies now use `fraction_fit=1.0` and `fraction_evaluate=1.0`, which means they select *all* currently available clients for training and evaluation. Projects that relied on the previous default values can get the previous behaviour by initializing the strategy in the following way:
fr: Toutes les stratégies intégrées utilisent désormais `fraction_fit=1.0` et `fraction_evaluate=1.0`, ce qui signifie qu'elles sélectionnent *tous* les clients actuellement disponibles pour l'entraînement et l'évaluation. Les projets qui s'appuyaient sur les valeurs par défaut précédentes peuvent retrouver le comportement antérieur en initialisant la stratégie de la manière suivante :
zh_hans: 所有内置策略现在都使用 "fraction_fit=1.0 "和 "fraction_evaluate=1.0"，这意味着它们会选择*所有*当前可用的客户端进行训练和评估。依赖以前默认值的项目可以通过以下方式初始化策略，获得以前的行为：

source: **Add** `server_round` **to** `Strategy.evaluate` ([#1334](https://github.com/adap/flower/pull/1334))
fr: **Ajouter** `server_round` **à** `Strategy.evaluate` ([#1334](https://github.com/adap/flower/pull/1334))
zh_hans: **添加*** `server_round` ***到*** `Strategy.evaluate` ([#1334](https://github.com/adap/flower/pull/1334))

source: The `Strategy` method `evaluate` now receives the current round of federated learning/evaluation as the first parameter.
fr: La méthode `Stratégie` `évaluer` reçoit maintenant le cycle actuel d'apprentissage/évaluation fédéré comme premier paramètre.
zh_hans: `Strategy`的`evaluate` 方法现在会接收当前一轮联邦学习/评估作为第一个参数。

source: **Add** `server_round` **and** `config` **parameters to** `evaluate_fn` ([#1334](https://github.com/adap/flower/pull/1334))
fr: **Ajouter** `server_round` **et** `config` **paramètres à** `evaluate_fn` ([#1334](https://github.com/adap/flower/pull/1334))
zh_hans: **将*** `server_round` **和*** `config` **参数添加到*** `evaluate_fn` ([#1334](https://github.com/adap/flower/pull/1334))

source: The `evaluate_fn` passed to built-in strategies like `FedAvg` now takes three parameters: (1) The current round of federated learning/evaluation (`server_round`), (2) the model parameters to evaluate (`parameters`), and (3) a config dictionary (`config`).
fr: Le `evaluate_fn` passé aux stratégies intégrées comme `FedAvg` prend maintenant trois paramètres : (1) le cycle actuel d'apprentissage/évaluation fédéré (`server_round`), (2) les paramètres du modèle à évaluer (`parameters`), et (3) un dictionnaire de configuration (`config`).
zh_hans: 传递给内置策略（如 `FedAvg`）的 `evaluate_fn` 现在需要三个参数：(1) 当前一轮联邦学习/评估 (`server_round`)，(2) 要评估的模型参数 (`parameters`)，(3) 配置字典 (`config`)。

source: **Rename** `rnd` **to** `server_round` ([#1321](https://github.com/adap/flower/pull/1321))
zh_hans: **重新命名** `rnd` ** to** `server_round` ([#1321](https://github.com/adap/flower/pull/1321))

source: Several Flower methods and functions (`evaluate_fn`, `configure_fit`, `aggregate_fit`, `configure_evaluate`, `aggregate_evaluate`) receive the current round of federated learning/evaluation as their first parameter. To improve reaability and avoid confusion with *random*, this parameter has been renamed from `rnd` to `server_round`.
fr: Plusieurs méthodes et fonctions de Flower (`evaluate_fn`, `configure_fit`, `aggregate_fit`, `configure_evaluate`, `aggregate_evaluate`) reçoivent le cycle actuel d'apprentissage/évaluation fédéré comme premier paramètre. Pour améliorer la fiabilité et éviter la confusion avec *random*, ce paramètre a été renommé de `rnd` à `server_round`.
zh_hans: 几个 Flower 方法和函数（`evaluate_fn`、`configure_fit`、`aggregate_fit`、`configure_evaluate`、`aggregate_evaluate`）的第一个参数是当前一轮的联邦学习/评估。为提高可重复性并避免与 *random* 混淆，该参数已从 `rnd` 更名为 `server_round`。

source: **Move** `flwr.dataset` **to** `flwr_baselines` ([#1273](https://github.com/adap/flower/pull/1273))
fr: **Déplacer** `flwr.dataset` **vers** `flwr_baselines` ([#1273](https://github.com/adap/flower/pull/1273))
zh_hans: **移动*** `flwr.dataset` **到*** `flwr_baselines` ([#1273](https://github.com/adap/flower/pull/1273))

source: The experimental package `flwr.dataset` was migrated to Flower Baselines.
fr: Le paquet expérimental `flwr.dataset` a été migré vers Flower Baselines.
zh_hans: 实验软件包 `flwr.dataset` 已迁移至 Flower Baselines。

source: **Remove experimental strategies** ([#1280](https://github.com/adap/flower/pull/1280))
fr: **Supprimer les stratégies expérimentales** ([#1280](https://github.com/adap/flower/pull/1280))
zh_hans: **删除实验策略** ([#1280](https://github.com/adap/flower/pull/1280))

source: Remove unmaintained experimental strategies (`FastAndSlow`, `FedFSv0`, `FedFSv1`).
fr: Supprimer les stratégies expérimentales non maintenues (`FastAndSlow`, `FedFSv0`, `FedFSv1`).
zh_hans: 移除未维护的试验性策略（`FastAndSlow`、`FedFSv0`、`FedFSv1`）。

source: **Rename** `Weights` **to** `NDArrays` ([#1258](https://github.com/adap/flower/pull/1258), [#1259](https://github.com/adap/flower/pull/1259))
zh_hans: **重新命名** `Weights` **到** `NDArrays` ([#1258](https://github.com/adap/flower/pull/1258), [#1259](https://github.com/adap/flower/pull/1259))

source: `flwr.common.Weights` was renamed to `flwr.common.NDArrays` to better capture what this type is all about.
fr: `flwr.common.Weights` a été renommé en `flwr.common.NDArys` pour mieux rendre compte de la nature de ce type.
zh_hans: flwr.common.Weights "更名为 "flwr.common.NDArrays"，以更好地反映该类型的含义。

source: **Remove antiquated** `force_final_distributed_eval` **from** `start_server` ([#1258](https://github.com/adap/flower/pull/1258), [#1259](https://github.com/adap/flower/pull/1259))
fr: **Supprimez l'ancien** `force_final_distributed_eval` **de** `start_server` ([#1258](https://github.com/adap/flower/pull/1258), [#1259](https://github.com/adap/flower/pull/1259))
zh_hans: **从** `start_server` 中移除过时的** `force_final_distributed_eval` ([#1258](https://github.com/adap/flower/pull/1258), [#1259](https://github.com/adap/flower/pull/1259))

source: The `start_server` parameter `force_final_distributed_eval` has long been a historic artefact, in this release it is finally gone for good.
fr: Le paramètre `start_server` `force_final_distributed_eval` a longtemps été un artefact historique, dans cette version il a finalement disparu pour de bon.
zh_hans: start_server "参数 "force_final_distributed_eval "长期以来一直是个历史遗留问题，在此版本中终于永远消失了。
