Repository: lucacorbucci/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: fr, zh_hans

source: The idea behind the generic Git and GitHub workflow boils down to this: you download code from a remote repository on GitHub, make changes locally and keep track of them using Git and then you upload your new history back to GitHub.
fr: L'idée derrière le flux de travail générique de Git et GitHub se résume à ceci : tu télécharges le code d'un dépôt distant sur GitHub, tu apportes des modifications localement et tu en gardes une trace à l'aide de Git, puis tu télécharges ton nouvel historique à nouveau sur GitHub.
zh_hans: 通用的 Git 和 GitHub 工作流程背后的理念可以归结为：从 GitHub 上的远程仓库下载代码，在本地进行修改并使用 Git 进行跟踪，然后将新的历史记录上传回 GitHub。

source: **Forking the Flower repository**
fr: **Fourche le dépôt de Flower**
zh_hans: **叉花仓库**

source: A fork is a personal copy of a GitHub repository. To create one for Flower, you must navigate to https://github.com/adap/flower (while connected to your GitHub account) and click the ``Fork`` button situated on the top right of the page.
fr: Un fork est une copie personnelle d'un dépôt GitHub. Pour en créer un pour Flower, tu dois naviguer sur https://github.com/adap/flower (en étant connecté à ton compte GitHub) et cliquer sur le bouton ``Fork`` situé en haut à droite de la page.
zh_hans: fork 是 GitHub 仓库的个人副本。要为 Flower 创建一个 fork，您必须导航到 https://github.com/adap/flower（同时连接到您的 GitHub 账户），然后点击页面右上方的 ``Fork`` 按钮。

source: You can change the name if you want, but this is not necessary as this version of Flower will be yours and will sit inside your own account (i.e., in your own list of repositories). Once created, you should see on the top left corner that you are looking at your own version of Flower.
fr: Tu peux changer le nom si tu le souhaites, mais ce n'est pas nécessaire car cette version de Flower sera la tienne et se trouvera dans ton propre compte (c'est-à-dire dans ta propre liste de dépôts). Une fois créée, tu devrais voir dans le coin supérieur gauche que tu es en train de regarder ta propre version de Flower.
zh_hans: 您可以更改名称，但没有必要，因为这个版本的 Flower 将是您自己的，并位于您自己的账户中（即，在您自己的版本库列表中）。创建完成后，您会在左上角看到自己的 Flower 版本。

source: **Cloning your forked repository**
fr: **Clonage de ton dépôt forké**
zh_hans: **克隆你的分叉仓库**

source: The next step is to download the forked repository on your machine to be able to make changes to it. On your forked repository page, you should first click on the ``Code`` button on the right, this will give you the ability to copy the HTTPS link of the repository.
fr: L'étape suivante consiste à télécharger le dépôt forké sur ta machine pour pouvoir y apporter des modifications. Sur la page de ton dépôt forké, tu dois d'abord cliquer sur le bouton ``Code`` à droite, ce qui te permettra de copier le lien HTTPS du dépôt.
zh_hans: 下一步是在你的机器上下载分叉版本库，以便对其进行修改。在分叉版本库页面上，首先点击右侧的 "代码 "按钮，这样就能复制版本库的 HTTPS 链接。

source: Once you copied the \<URL\>, you can open a terminal on your machine, navigate to the place you want to download the repository to and type:
fr: Une fois que tu as copié le \<URL\>, tu peux ouvrir un terminal sur ta machine, naviguer jusqu'à l'endroit où tu veux télécharger le référentiel et taper :
zh_hans: 一旦复制了 （<URL\>），你就可以在你的机器上打开一个终端，导航到你想下载软件源的地方，然后键入：

source: This will create a `flower/` (or the name of your fork if you renamed it) folder in the current working directory.
fr: Cela créera un dossier `flower/` (ou le nom de ta fourche si tu l'as renommée) dans le répertoire de travail actuel.
zh_hans: 这将在当前工作目录下创建一个 `flower/`（如果重命名了，则使用 fork 的名称）文件夹。

source: **Add origin**
fr: **Ajouter l'origine**
zh_hans: **添加原产地**

source: You can then go into the repository folder:
fr: Tu peux ensuite aller dans le dossier du référentiel :
zh_hans: 然后，您就可以进入存储库文件夹：

source: And here we will need to add an origin to our repository. The origin is the \<URL\> of the remote fork repository. To obtain it, we can do as previously mentioned by going to our fork repository on our GitHub account and copying the link.
fr: Et ici, nous devrons ajouter une origine à notre dépôt.L'origine est le \<URL\> du dépôt fork distant.Pour l'obtenir, nous pouvons faire comme indiqué précédemment en allant sur notre dépôt fork sur notre compte GitHub et en copiant le lien.
zh_hans: 在这里，我们需要为我们的版本库添加一个 origin。origin 是远程 fork 仓库的 \<URL/>。要获得它，我们可以像前面提到的那样，访问 GitHub 账户上的分叉仓库并复制链接。

source: Once the \<URL\> is copied, we can type the following command in our terminal:
fr: Une fois que le \<URL\> est copié, nous pouvons taper la commande suivante dans notre terminal :
zh_hans: 一旦复制了 \<URL\> ，我们就可以在终端中键入以下命令：

source: **Add upstream**
fr: **Ajouter en amont**
zh_hans: **增加上游**

source: Now we will add an upstream address to our repository. Still in the same directroy, we must run the following command:
fr: Nous allons maintenant ajouter une adresse en amont à notre dépôt. Toujours dans le même directroy, nous devons exécuter la commande suivante :
zh_hans: 现在，我们要为版本库添加一个上游地址。还是在同一目录下，我们必须运行以下命令：

source: The following diagram visually explains what we did in the previous steps:
fr: Le schéma suivant explique visuellement ce que nous avons fait dans les étapes précédentes :
zh_hans: 下图直观地解释了我们在前面步骤中的操作：

source: The upstream is the GitHub remote address of the parent repository (in this case Flower), i.e. the one we eventually want to contribute to and therefore need an up-to-date history of. The origin is just the GitHub remote address of the forked repository we created, i.e. the copy (fork) in our own account.
fr: L'amont est l'adresse distante GitHub du dépôt parent (dans ce cas Flower), c'est-à-dire celui auquel nous voulons éventuellement contribuer et dont nous avons donc besoin d'un historique à jour. L'origine est simplement l'adresse distante GitHub du dépôt forké que nous avons créé, c'est-à-dire la copie (fork) dans notre propre compte.
zh_hans: 上游是父版本库（这里是 Flower）的 GitHub 远程地址，即我们最终要贡献的版本库，因此需要最新的历史记录。origin 只是我们创建的分叉仓库的 GitHub 远程地址，即我们自己账户中的副本（分叉）。

source: To make sure our local version of the fork is up-to-date with the latest changes from the Flower repository, we can execute the following command:
fr: Pour nous assurer que notre version locale du fork est à jour avec les dernières modifications du dépôt Flower, nous pouvons exécuter la commande suivante :
zh_hans: 为了确保本地版本的分叉程序与 Flower 代码库的最新更改保持一致，我们可以执行以下命令：

source: Setting up the coding environment
fr: Mise en place de l'environnement de codage
zh_hans: 设置编码环境

source: This can be achieved by following this `getting started guide for contributors`_ (note that you won't need to clone the repository). Once you are able to write code and test it, you can finally start making changes!
fr: Pour ce faire, tu peux suivre ce `guide de démarrage pour les contributeurs`_ (note que tu n'auras pas besoin de cloner le dépôt). Une fois que tu es capable d'écrire du code et de le tester, tu peux enfin commencer à faire des changements !
zh_hans: 您可以按照这份 "贡献者入门指南"__（注意，您不需要克隆版本库）来实现这一点。一旦您能够编写代码并进行测试，您就可以开始修改了！

source: Making changes
fr: Apporter des changements
zh_hans: 做出改变

source: Before making any changes make sure you are up-to-date with your repository:
fr: Avant de faire des changements, assure-toi que tu es à jour avec ton référentiel :
zh_hans: 在进行任何更改之前，请确保您的版本库是最新的：

source: And with Flower's repository:
fr: Et avec le référentiel de Flower :
zh_hans: 还有Flower的存储库：

source: **Create a new branch**
fr: **Créer une nouvelle branche**
zh_hans: **创建一个新分支**

source: To make the history cleaner and easier to work with, it is good practice to create a new branch for each feature/project that needs to be implemented.
fr: Pour rendre l'historique plus propre et plus facile à travailler, c'est une bonne pratique de créer une nouvelle branche pour chaque fonctionnalité/projet qui doit être mis en œuvre.
zh_hans: 为了使历史记录更简洁、更易于操作，为每个需要实现的功能/项目创建一个新分支是个不错的做法。

source: To do so, just run the following command inside the repository's directory:
fr: Pour ce faire, il suffit d'exécuter la commande suivante dans le répertoire du référentiel :
zh_hans: 为此，只需在版本库目录下运行以下命令即可：

source: **Make changes**
fr: **Apporter des modifications**
zh_hans: **进行修改**

source: Write great code and create wonderful changes using your favorite editor!
fr: Écris du bon code et crée de merveilleuses modifications à l'aide de ton éditeur préféré !
zh_hans: 使用您最喜欢的编辑器编写优秀的代码并创建精彩的更改！

source: **Test and format your code**
fr: **Teste et mets en forme ton code**
zh_hans: **测试并格式化您的代码**

source: Don't forget to test and format your code! Otherwise your code won't be able to be merged into the Flower repository. This is done so the codebase stays consistent and easy to understand.
fr: N'oublie pas de tester et de formater ton code ! Sinon, ton code ne pourra pas être fusionné dans le dépôt Flower, et ce, afin que la base de code reste cohérente et facile à comprendre.
zh_hans: 不要忘记测试和格式化您的代码！否则您的代码将无法并入 Flower 代码库。这样做是为了使代码库保持一致并易于理解。

source: To do so, we have written a few scripts that you can execute:
fr: Pour ce faire, nous avons écrit quelques scripts que tu peux exécuter :
zh_hans: 为此，我们编写了一些脚本供您执行：

source: **Stage changes**
fr: **Changements de scène**
zh_hans: **舞台变化**

source: Before creating a commit that will update your history, you must specify to Git which files it needs to take into account.
fr: Avant de créer un commit qui mettra à jour ton historique, tu dois spécifier à Git les fichiers qu'il doit prendre en compte.
zh_hans: 在创建更新历史记录的提交之前，必须向 Git 说明需要考虑哪些文件。

source: This can be done with:
fr: Cela peut se faire avec :
zh_hans: 这可以通过：

source: To check which files have been modified compared to the last version (last commit) and to see which files are staged for commit, you can use the :code:`git status` command.
fr: Pour vérifier quels fichiers ont été modifiés par rapport à la dernière version (last commit) et pour voir quels fichiers sont mis à disposition pour le commit, tu peux utiliser la commande :code:`git status`.
zh_hans: 要查看与上一版本（上次提交）相比哪些文件已被修改，以及哪些文件处于提交阶段，可以使用 :code:`git status` 命令。

source: **Commit changes**
zh_hans: **提交更改**

source: Once you have added all the files you wanted to commit using :code:`git add`, you can finally create your commit using this command:
fr: Une fois que tu as ajouté tous les fichiers que tu voulais livrer à l'aide de :code:`git add`, tu peux enfin créer ta livraison à l'aide de cette commande :
zh_hans: 使用 :code:`git add` 添加完所有要提交的文件后，就可以使用此命令创建提交了：

source: The \<commit_message\> is there to explain to others what the commit does. It should be written in an imperative style and be concise. An example would be :code:`git commit -m "Add images to README"`.
fr: Le ``commit_message`` est là pour expliquer aux autres ce que fait le commit. Il doit être écrit dans un style impératif et être concis. Un exemple serait :code:`git commit -m "Ajouter des images au README"`.
zh_hans: <commit_message\> 用于向他人解释提交的作用。它应该以命令式风格书写，并且简明扼要。例如 :code:`git commit -m "Add images to README"`。

source: **Push the changes to the fork**
fr: **Pousser les changements vers la fourche**
zh_hans: **将更改推送到分叉**

source: Once we have committed our changes, we have effectively updated our local history, but GitHub has no way of knowing this unless we push our changes to our origin's remote address:
fr: Une fois que nous avons validé nos modifications, nous avons effectivement mis à jour notre historique local, mais GitHub n'a aucun moyen de le savoir à moins que nous ne poussions nos modifications vers l'adresse distante de notre origine :
zh_hans: 一旦提交了修改，我们就有效地更新了本地历史记录，但除非我们将修改推送到原点的远程地址，否则 GitHub 无法得知：

source: Once this is done, you will see on the GitHub that your forked repo was updated with the changes you have made.
fr: Une fois que c'est fait, tu verras sur GitHub que ton repo forké a été mis à jour avec les modifications que tu as apportées.
zh_hans: 完成此操作后，您将在 GitHub 上看到您的分叉仓库已根据您所做的更改进行了更新。

source: Creating and merging a pull request (PR)
fr: Créer et fusionner une pull request (PR)
zh_hans: 创建和合并拉取请求 (PR)

source: **Create the PR**
fr: **Créer le PR**
zh_hans: **创建 PR**

source: Once you have pushed changes, on the GitHub webpage of your repository you should see the following message:
fr: Une fois que tu as poussé les modifications, sur la page web GitHub de ton dépôt, tu devrais voir le message suivant :
zh_hans: 推送更改后，在仓库的 GitHub 网页上应该会看到以下信息：

source: Otherwise you can always find this option in the `Branches` page.
fr: Sinon, tu peux toujours trouver cette option dans la page `Branches`.
zh_hans: 否则，您可以在 "分支 "页面找到该选项。

source: Once you click the `Compare & pull request` button, you should see something similar to this:
fr: Une fois que tu as cliqué sur le bouton `Compare & pull request`, tu devrais voir quelque chose de similaire à ceci :
zh_hans: 点击 "比较和拉取请求 "按钮后，您应该会看到类似下面的内容：

source: At the top you have an explanation of which branch will be merged where:
fr: En haut, tu as une explication de quelle branche sera fusionnée à quel endroit :
zh_hans: 在顶部，你可以看到关于哪个分支将被合并的说明：

source: In this example you can see that the request is to merge the branch ``doc-fixes`` from my forked repository to branch ``main`` from the Flower repository.
fr: Dans cet exemple, tu peux voir que la demande consiste à fusionner la branche ``doc-fixes`` de mon dépôt forké à la branche ``main`` du dépôt Flower.
zh_hans: 在这个例子中，你可以看到请求将我分叉的版本库中的分支 ``doc-fixes`` 合并到 Flower 版本库中的分支 ``main``。

source: The input box in the middle is there for you to describe what your PR does and to link it to existing issues. We have placed comments (that won't be rendered once the PR is opened) to guide you through the process.
fr: La zone de saisie au milieu est là pour que tu décrives ce que fait ton PR et que tu le relies aux questions existantes. Nous avons placé des commentaires (qui ne seront pas rendus une fois le PR ouvert) pour te guider tout au long du processus.
zh_hans: 中间的输入框供您描述 PR 的作用，并将其与现有问题联系起来。我们在此放置了注释（一旦 PR 打开，注释将不会显示），以指导您完成整个过程。

source: At the bottom you will find the button to open the PR. This will notify reviewers that a new PR has been opened and that they should look over it to merge or to request changes.
fr: En bas de l'écran, tu trouveras le bouton permettant d'ouvrir le PR, ce qui informera les réviseurs qu'un nouveau PR a été ouvert et qu'ils doivent le consulter pour le fusionner ou demander des modifications.
zh_hans: 在底部，您可以找到打开 PR 的按钮。这将通知审核人员新的 PR 已经打开，他们应该查看该 PR 以进行合并或要求修改。

source: If your PR is not yet ready for review, and you don't want to notify anyone, you have the option to create a draft pull request:
fr: Si ton RP n'est pas encore prêt à être examiné, et que tu ne veux avertir personne, tu as la possibilité de créer un brouillon de demande de traction :
zh_hans: 如果您的 PR 尚未准备好接受审核，而且您不想通知任何人，您可以选择创建一个草案拉取请求：

source: **Making new changes**
fr: **Faire de nouveaux changements**
zh_hans: **作出新的改变**

source: Once the PR has been opened (as draft or not), you can still push new commits to it the same way we did before, by making changes to the branch associated with the PR.
fr: Une fois que le PR a été ouvert (en tant que brouillon ou non), tu peux toujours y pousser de nouveaux commits de la même manière qu'auparavant, en apportant des modifications à la branche associée au PR.
zh_hans: 一旦 PR 被打开（无论是否作为草案），你仍然可以像以前一样，通过修改与 PR 关联的分支来推送新的提交。

source: **Review the PR**
zh_hans: **审查 PR**

source: Once the PR has been opened or once the draft PR has been marked as ready, a review from code owners will be automatically requested:
fr: Une fois que le PR a été ouvert ou que le projet de PR a été marqué comme étant prêt, une révision des propriétaires de code sera automatiquement demandée :
zh_hans: 一旦 PR 被打开或 PR 草案被标记为就绪，就会自动要求代码所有者进行审核：

source: Code owners will then look into the code, ask questions, request changes or validate the PR.
fr: Les propriétaires du code vont alors se pencher sur le code, poser des questions, demander des modifications ou valider le RP.
zh_hans: 然后，代码所有者会查看代码、提出问题、要求修改或验证 PR。

source: Merging will be blocked if there are ongoing requested changes.
fr: La fusion sera bloquée s'il y a des changements demandés en cours.
zh_hans: 如果有正在进行的更改请求，合并将被阻止。

source: To resolve them, just push the necessary changes to the branch associated with the PR:
fr: Pour les résoudre, il suffit de pousser les changements nécessaires vers la branche associée au PR :
zh_hans: 要解决这些问题，只需将必要的更改推送到与 PR 关联的分支即可：

source: And resolve the conversation:
fr: Et résous la conversation :
zh_hans: 并解决对话：

source: Once all the conversations have been resolved, you can re-request a review.
fr: Une fois que toutes les conversations ont été résolues, tu peux redemander un examen.
zh_hans: 一旦所有对话都得到解决，您就可以重新申请审核。

source: **Once the PR is merged**
fr: **Une fois que le PR est fusionné**
zh_hans: **一旦 PR 被合并**

source: If all the automatic tests have passed and reviewers have no more changes to request, they can approve the PR and merge it.
fr: Si tous les tests automatiques ont réussi et que les réviseurs n'ont plus de modifications à demander, ils peuvent approuver le PR et le fusionner.
zh_hans: 如果所有自动测试都已通过，且审核员不再需要修改，他们就可以批准 PR 并将其合并。

source: Once it is merged, you can delete the branch on GitHub (a button should appear to do so) and also delete it locally by doing:
fr: Une fois qu'elle est fusionnée, tu peux supprimer la branche sur GitHub (un bouton devrait apparaître pour le faire) et aussi la supprimer localement en faisant :
zh_hans: 合并后，您可以在 GitHub 上删除该分支（会出现一个删除按钮），也可以在本地删除该分支：

source: Then you should update your forked repository by doing:
fr: Ensuite, tu dois mettre à jour ton dépôt forké en faisant :
zh_hans: 然后，你应该更新你的分叉仓库：

source: Example of first contribution
fr: Exemple de première contribution
zh_hans: 首次捐款实例

source: Problem
fr: Problème
zh_hans: 问题

source: For our documentation, we’ve started to use the `Diàtaxis framework <https://diataxis.fr/>`_.
fr: Pour notre documentation, nous avons commencé à utiliser le cadre `Diàtaxis <https://diataxis.fr/>`_.
zh_hans: 对于我们的文档，我们已经开始使用 "Diàtaxis 框架 <https://diataxis.fr/>`_"。

source: Our “How to” guides should have titles that continue the sencence “How to …”, for example, “How to upgrade to Flower 1.0”.
fr: Nos guides "Comment faire" devraient avoir des titres qui poursuivent la phrase "Comment faire pour...", par exemple, "Comment passer à Flower 1.0".
zh_hans: 我们的 "如何 "指南的标题应延续 "如何...... "的句式，例如 "如何升级到 Flower 1.0"。

source: Most of our guides do not follow this new format yet, and changing their title is (unfortunately) more involved than one might think.
fr: La plupart de nos guides ne suivent pas encore ce nouveau format, et changer leur titre est (malheureusement) plus compliqué qu'on ne le pense.
zh_hans: 我们的大多数指南还没有采用这种新格式，而更改其标题（不幸的是）比人们想象的要复杂得多。

source: This issue is about changing the title of a doc from present continious to present simple.
fr: Cette question porte sur le changement du titre d'un document du présent continu au présent simple.
zh_hans: 这个问题是关于将文档标题从现在进行时改为现在进行时。

source: Let's take the example of “Saving Progress” which we changed to “Save Progress”. Does this pass our check?
fr: Prenons l'exemple de "Sauvegarder la progression" que nous avons remplacé par "Sauvegarder la progression". Est-ce que cela passe notre contrôle ?
zh_hans: 以 "保存进度 "为例，我们将其改为 "保存进度"。这是否通过了我们的检查？

source: Before: ”How to saving progress” ❌
fr: Avant : "Comment sauvegarder les progrès" ❌
zh_hans: 之前： "如何保存进度" ❌

source: After: ”How to save progress” ✅
fr: Après : "Comment sauvegarder la progression" ✅
zh_hans: 之后： "如何保存进度"✅

source: Solution
zh_hans: 解决方案

source: This is a tiny change, but it’ll allow us to test your end-to-end setup. After cloning and setting up the Flower repo, here’s what you should do:
fr: C'est un tout petit changement, mais il nous permettra de tester ta configuration de bout en bout. Après avoir cloné et configuré le repo Flower, voici ce que tu dois faire :
zh_hans: 这只是一个很小的改动，但可以让我们测试你的端到端设置。克隆并设置好 Flower repo 后，你应该这样做：

source: Find the source file in `doc/source`
fr: Trouve le fichier source dans `doc/source`
zh_hans: 在 `doc/source` 中查找源文件

source: Make the change in the `.rst` file (beware, the dashes under the title should be the same length as the title itself)
fr: Effectue la modification dans le fichier `.rst` (attention, les tirets sous le titre doivent être de la même longueur que le titre lui-même)
zh_hans: 在 `.rst` 文件中进行修改（注意，标题下的破折号应与标题本身的长度相同）

source: Build the docs and check the result: `<https://flower.dev/docs/writing-documentation.html#edit-an-existing-page>`_
fr: Construis les documents et vérifie le résultat : `<https://flower.dev/docs/writing-documentation.html#edit-an-existing-page>`_
zh_hans: 构建文档并检查结果： `<https://flower.dev/docs/writing-documentation.html#edit-an-existing-page>`_

source: Rename file
fr: Renommer le fichier
zh_hans: 重命名文件

source: You might have noticed that the file name still reflects the old wording. If we just change the file, then we break all existing links to it - it is **very important** to avoid that, breaking links can harm our search engine ranking.
fr: Tu as peut-être remarqué que le nom du fichier reflète toujours l'ancienne formulation. Si nous changeons simplement le fichier, nous brisons tous les liens existants vers celui-ci - il est **très important** d'éviter cela, car briser des liens peut nuire à notre classement dans les moteurs de recherche.
zh_hans: 您可能已经注意到，文件名仍然反映了旧的措辞。如果我们只是更改文件，那么就会破坏与该文件的所有现有链接--避免这种情况是***重要的，破坏链接会损害我们的搜索引擎排名。

source: Here’s how to change the file name:
fr: Voici comment changer le nom du fichier :
zh_hans: 下面是更改文件名的方法：

source: Change the file name to `save-progress.rst`
fr: Change le nom du fichier en `save-progress.rst`
zh_hans: 将文件名改为`save-progress.rst`

source: Add a redirect rule to `doc/source/conf.py`
fr: Ajouter une règle de redirection à `doc/source/conf.py`
zh_hans: 在 `doc/source/conf.py` 中添加重定向规则

source: This will cause a redirect from `saving-progress.html` to `save-progress.html`, old links will continue to work.
fr: Cela entraînera une redirection de `saving-progress.html` vers `save-progress.html`, les anciens liens continueront à fonctionner.
zh_hans: 这将导致从 `saving-progress.html` 重定向到 `save-progress.html`，旧链接将继续工作。

source: Apply changes in the index file
fr: Applique les changements dans le fichier d'index
zh_hans: 应用索引文件中的更改

source: For the lateral navigation bar to work properly, it is very important to update the `index.rst` file as well. This is where we define the whole arborescence of the navbar.
fr: Pour que la barre de navigation latérale fonctionne correctement, il est très important de mettre également à jour le fichier `index.rst`. C'est là que nous définissons toute l'arborescence de la barre de navigation.
zh_hans: 要使横向导航栏正常工作，更新 `index.rst` 文件也非常重要。我们就是在这里定义整个导航栏的结构。

source: Find and modify the file name in `index.rst`
fr: Trouve et modifie le nom du fichier dans `index.rst`
zh_hans: 查找并修改 `index.rst` 中的文件名

source: Open PR
zh_hans: 开放式 PR

source: Commit the changes (commit messages are always imperative: “Do something”, in this case “Change …”)
fr: Valide les modifications (les messages de validation sont toujours impératifs : "Fais quelque chose", dans ce cas "Modifie...")
zh_hans: 提交更改（提交信息总是命令式的："做某事"，这里是 "更改......"）

source: Push the changes to your fork
fr: Transmets les changements à ta fourchette
zh_hans: 将更改推送到分叉

source: Open a PR (as shown above)
fr: Ouvre un RP (comme indiqué ci-dessus)
zh_hans: 打开 PR（如上图所示）

source: Wait for it to be approved!
fr: Attends qu'elle soit approuvée !
zh_hans: 等待审批！

source: Congrats! 🥳 You're now officially a Flower contributor!
fr: Félicitations 🥳 Tu es désormais officiellement une contributrice de Flower !
zh_hans: 祝贺你 🥳 您现在正式成为 "Flower "贡献者！

source: How to write a good PR title
fr: Comment écrire un bon titre de PR
zh_hans: 如何撰写好的公关标题
