Repository: lucacorbucci/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: fr, zh_hans

source: We now have all the basic building blocks we need: a dataset, a model, a training function, and a test function. Let's put them together to train the model on the dataset of one of our organizations (``trainloaders[0]``). This simulates the reality of most machine learning projects today: each organization has their own data and trains models only on this internal data:
fr: Nous avons maintenant tous les éléments de base dont nous avons besoin : un ensemble de données, un modèle, une fonction d'entraînement et une fonction de test. Assemblons-les pour entraîner le modèle sur l'ensemble de données de l'une de nos organisations (``trainloaders[0]``). Cela simule la réalité de la plupart des projets d'apprentissage automatique aujourd'hui : chaque organisation possède ses propres données et entraîne les modèles uniquement sur ces données internes :
zh_hans: 现在我们拥有了所需的所有基本构件：数据集、模型、训练函数和测试函数。让我们把它们放在一起，在我们其中一个组织的数据集（``trainloaders[0]``）上训练模型。这模拟了当今大多数机器学习项目的实际情况：每个组织都有自己的数据，并且只在这些内部数据上训练模型：

source: Training the simple CNN on our CIFAR-10 split for 5 epochs should result in a test set accuracy of about 41%, which is not good, but at the same time, it doesn't really matter for the purposes of this tutorial. The intent was just to show a simplistic centralized training pipeline that sets the stage for what comes next - federated learning!
fr: L'entraînement du CNN simple sur notre fractionnement CIFAR-10 pendant 5 époques devrait se traduire par une précision de l'ensemble de test d'environ 41 %, ce qui n'est pas bon, mais en même temps, cela n'a pas vraiment d'importance pour les besoins de ce tutoriel. L'intention était juste de montrer un pipeline d'entraînement centralisé simpliste qui prépare le terrain pour ce qui vient ensuite - l'apprentissage fédéré !
zh_hans: 在我们的 CIFAR-10 分片上对简单 CNN 进行 5 个遍历的训练后，测试集的准确率应为 41%，这并不理想，但同时对本教程而言也并不重要。我们只是想展示一个简单的集中式训练流程，为接下来的联邦学习做好铺垫！

source: Step 2: Federated Learning with Flower
fr: Étape 2 : Apprentissage fédéré avec Flower
zh_hans: 步骤 2：使用 Flower 联邦学习

source: Step 1 demonstrated a simple centralized training pipeline. All data was in one place (i.e., a single ``trainloader`` and a single ``valloader``). Next, we'll simulate a situation where we have multiple datasets in multiple organizations and where we train a model over these organizations using federated learning.
fr: L'étape 1 a montré un simple pipeline de formation centralisé. Toutes les données étaient au même endroit (c'est-à-dire un seul ``trainloader`` et un seul ``valloader``). Ensuite, nous allons simuler une situation où nous avons plusieurs ensembles de données dans plusieurs organisations et où nous formons un modèle sur ces organisations à l'aide de l'apprentissage fédéré.
zh_hans: 步骤 1 演示了一个简单的集中式训练流程。所有数据都在一个地方（即一个 "trainloader "和一个 "valloader"）。接下来，我们将模拟在多个组织中拥有多个数据集的情况，并使用联邦学习在这些组织中训练一个模型。

source: Updating model parameters
fr: Mise à jour des paramètres du modèle
zh_hans: 更新模型参数

source: In federated learning, the server sends the global model parameters to the client, and the client updates the local model with the parameters received from the server. It then trains the model on the local data (which changes the model parameters locally) and sends the updated/changed model parameters back to the server (or, alternatively, it sends just the gradients back to the server, not the full model parameters).
fr: Dans l'apprentissage fédéré, le serveur envoie les paramètres du modèle global au client, et le client met à jour le modèle local avec les paramètres reçus du serveur. Il entraîne ensuite le modèle sur les données locales (ce qui modifie les paramètres du modèle localement) et renvoie les paramètres du modèle mis à jour/changés au serveur (ou, alternativement, il renvoie seulement les gradients au serveur, et non pas les paramètres complets du modèle).
zh_hans: 在联邦学习中，服务器将全局模型参数发送给客户端，客户端根据从服务器接收到的参数更新本地模型。然后，客户端根据本地数据对模型进行训练（在本地更改模型参数），并将更新/更改后的模型参数发回服务器（或者，客户端只将梯度参数发回服务器，而不是全部模型参数）。

source: We need two helper functions to update the local model with parameters received from the server and to get the updated model parameters from the local model: ``set_parameters`` and ``get_parameters``. The following two functions do just that for the PyTorch model above.
fr: Nous avons besoin de deux fonctions d'aide pour mettre à jour le modèle local avec les paramètres reçus du serveur et pour obtenir les paramètres mis à jour du modèle local : ``set_parameters`` et ``get_parameters``. Les deux fonctions suivantes font exactement cela pour le modèle PyTorch ci-dessus.
zh_hans: 我们需要两个辅助函数，用从服务器接收到的参数更新本地模型，并从本地模型获取更新后的模型参数：`` set_parameters```和`get_parameters``。下面两个函数就是为上面的 PyTorch 模型做这些工作的。

source: The details of how this works are not really important here (feel free to consult the PyTorch documentation if you want to learn more). In essence, we use ``state_dict`` to access PyTorch model parameter tensors. The parameter tensors are then converted to/from a list of NumPy ndarray's (which Flower knows how to serialize/deserialize):
fr: Les détails de ce fonctionnement ne sont pas vraiment importants ici (n'hésite pas à consulter la documentation PyTorch si tu veux en savoir plus). En substance, nous utilisons ``state_dict`` pour accéder aux tenseurs de paramètres du modèle PyTorch. Les tenseurs de paramètres sont ensuite convertis en/depuis une liste de ndarray NumPy (que Flower sait sérialiser/désérialiser) :
zh_hans: 在这里，如何工作的细节并不重要（如果你想了解更多，请随时查阅 PyTorch 文档）。本质上，我们使用 ``state_dict`` 访问 PyTorch 模型参数张量。然后，参数张量会被转换成/转换成 NumPy ndarray 列表（Flower 知道如何序列化/反序列化）：

source: Implementing a Flower client
fr: Mise en place d'un client Flower
zh_hans: 实现 Flower 客户端

source: With that out of the way, let's move on to the interesting part. Federated learning systems consist of a server and multiple clients. In Flower, we create clients by implementing subclasses of ``flwr.client.Client`` or ``flwr.client.NumPyClient``. We use ``NumPyClient`` in this tutorial because it is easier to implement and requires us to write less boilerplate.
fr: Ceci étant dit, passons à la partie intéressante. Les systèmes d'apprentissage fédérés se composent d'un serveur et de plusieurs clients. Dans Flower, nous créons des clients en mettant en œuvre des sous-classes de ``flwr.client.Client`` ou de ``flwr.client.NumPyClient``. Nous utilisons ``NumPyClient`` dans ce tutoriel parce qu'il est plus facile à mettre en œuvre et qu'il nous oblige à rédiger moins de modèles de chaudière.
zh_hans: 说完这些，让我们进入有趣的部分。联邦学习系统由一个服务器和多个客户端组成。在 Flower 中，我们通过实现 ``flwr.client.Client`` 或 ``flwr.client.NumPyClient`` 的子类来创建客户端。在本教程中，我们使用``NumPyClient``，因为它更容易实现，需要我们编写的模板也更少。

source: To implement the Flower client, we create a subclass of ``flwr.client.NumPyClient`` and implement the three methods ``get_parameters``, ``fit``, and ``evaluate``:
fr: Pour mettre en œuvre le client Flower, nous créons une sous-classe de ``flwr.client.NumPyClient`` et mettons en œuvre les trois méthodes ``get_parameters``, ``fit`` et ``evaluate`` :
zh_hans: 为实现 Flower 客户端，我们创建了 ``flwr.client.NumPyClient`` 的子类，并实现了 ``get_parameters``、``fit`` 和``evaluate`` 三个方法：

source: ``get_parameters``: Return the current local model parameters
fr: ``get_parameters`` : renvoie les paramètres du modèle local actuel
zh_hans: ``get_parameters``： 返回当前本地模型参数

source: ``fit``: Receive model parameters from the server, train the model parameters on the local data, and return the (updated) model parameters to the server
fr: ``fit`` : reçoit les paramètres du modèle du serveur, entraîne les paramètres du modèle sur les données locales et renvoie les paramètres du modèle (mis à jour) au serveur
zh_hans: ``fit``： 从服务器接收模型参数，在本地数据上训练模型参数，并将（更新的）模型参数返回服务器

source: ``evaluate``: Receive model parameters from the server, evaluate the model parameters on the local data, and return the evaluation result to the server
fr: ``evaluate`` : reçoit les paramètres du modèle du serveur, évalue les paramètres du modèle sur les données locales et renvoie le résultat de l'évaluation au serveur
zh_hans: ``evaluate ``： 从服务器接收模型参数，在本地数据上评估模型参数，并将评估结果返回服务器

source: We mentioned that our clients will use the previously defined PyTorch components for model training and evaluation. Let's see a simple Flower client implementation that brings everything together:
fr: Nous avons mentionné que nos clients utiliseront les composants PyTorch définis précédemment pour la formation et l'évaluation des modèles. Voyons une simple mise en œuvre du client Flower qui réunit tout cela :
zh_hans: 我们提到，我们的客户端将使用之前定义的 PyTorch 组件进行模型训练和评估。让我们来看看一个简单的 Flower 客户端实现，它将一切都整合在一起：

source: Our class ``FlowerClient`` defines how local training/evaluation will be performed and allows Flower to call the local training/evaluation through ``fit`` and ``evaluate``. Each instance of ``FlowerClient`` represents a *single client* in our federated learning system. Federated learning systems have multiple clients (otherwise, there's not much to federate), so each client will be represented by its own instance of ``FlowerClient``. If we have, for example, three clients in our workload, then we'd have three instances of ``FlowerClient``. Flower calls ``FlowerClient.fit`` on the respective instance when the server selects a particular client for training (and ``FlowerClient.evaluate`` for evaluation).
zh_hans: 我们的类 ``FlowerClient`` 定义了本地训练/评估的执行方式，并允许 Flower 通过 ``fit`` 和 ``evaluate`` 调用本地训练/评估。每个 ``FlowerClient`` 实例都代表联邦学习系统中的*单个客户端*。联邦学习系统有多个客户端（否则就没有什么可联邦的），因此每个客户端都将由自己的 ``FlowerClient`` 实例来代表。例如，如果我们的工作负载中有三个客户端，那么我们就会有三个 ``FlowerClient`` 实例。当服务器选择特定客户端进行训练时，Flower 会调用相应实例上的 ``FlowerClient.fit`` （评估时调用 ``FlowerClient.evaluate``）。

source: Using the Virtual Client Engine
fr: Utilisation du moteur du client virtuel
zh_hans: 使用虚拟客户端引擎

source: In this notebook, we want to simulate a federated learning system with 10 clients on a single machine. This means that the server and all 10 clients will live on a single machine and share resources such as CPU, GPU, and memory. Having 10 clients would mean having 10 instances of ``FlowerClient`` in memory. Doing this on a single machine can quickly exhaust the available memory resources, even if only a subset of these clients participates in a single round of federated learning.
fr: Dans ce carnet, nous voulons simuler un système d'apprentissage fédéré avec 10 clients sur une seule machine. Cela signifie que le serveur et les 10 clients vivront sur une seule machine et partageront des ressources telles que le CPU, le GPU et la mémoire. Avoir 10 clients signifierait avoir 10 instances de ``FlowerClient`` en mémoire. Faire cela sur une seule machine peut rapidement épuiser les ressources mémoire disponibles, même si seulement un sous-ensemble de ces clients participe à un seul tour d'apprentissage fédéré.
zh_hans: 在本笔记中，我们要模拟一个联邦学习系统，在一台机器上有 10 个客户端。这意味着服务器和所有 10 个客户端都将位于一台机器上，并共享 CPU、GPU 和内存等资源。有 10 个客户端就意味着内存中有 10 个 ``FlowerClient`` 实例。在单台机器上这样做会很快耗尽可用的内存资源，即使这些客户端中只有一个子集参与了一轮联邦学习。

source: In addition to the regular capabilities where server and clients run on multiple machines, Flower, therefore, provides special simulation capabilities that create ``FlowerClient`` instances only when they are actually necessary for training or evaluation. To enable the Flower framework to create clients when necessary, we need to implement a function called ``client_fn`` that creates a ``FlowerClient`` instance on demand. Flower calls ``client_fn`` whenever it needs an instance of one particular client to call ``fit`` or ``evaluate`` (those instances are usually discarded after use, so they should not keep any local state). Clients are identified by a client ID, or short ``cid``. The ``cid`` can be used, for example, to load different local data partitions for different clients, as can be seen below:
zh_hans: 除了服务器和客户端在多台机器上运行的常规功能外，Flower 还提供了特殊的模拟功能，即只有在训练或评估实际需要时才创建 ``FlowerClient`` 实例。为了让 Flower 框架能在必要时创建客户端，我们需要实现一个名为 ``client_fn`` 的函数，它能按需创建一个 ``FlowerClient`` 实例。每当 Flower 需要一个特定的客户端实例来调用 ``fit`` 或 ``evaluate`` 时，它就会调用 ``client_fn``（这些实例在使用后通常会被丢弃，因此它们不应保留任何本地状态）。客户端由一个客户端 ID 或简短的 ``cid`` 标识。例如，可以使用 ``cid`` 为不同的客户端加载不同的本地数据分区，如下所示：

source: Starting the training
fr: Commencer la formation
zh_hans: 开始训练

source: We now have the class ``FlowerClient`` which defines client-side training/evaluation and ``client_fn`` which allows Flower to create ``FlowerClient`` instances whenever it needs to call ``fit`` or ``evaluate`` on one particular client. The last step is to start the actual simulation using ``flwr.simulation.start_simulation``.
fr: Nous avons maintenant la classe ``FlowerClient`` qui définit l'entraînement/évaluation côté client et ``client_fn`` qui permet à Flower de créer des instances de ``FlowerClient`` chaque fois qu'il a besoin d'appeler ``fit`` ou ``evaluate`` sur un client particulier. La dernière étape consiste à démarrer la simulation réelle en utilisant ``flwr.simulation.start_simulation``.
zh_hans: 现在我们有了定义客户端训练/评估的类 ``FlowerClient`` 和允许 Flower 在需要调用某个客户端的 ``fit` 或 ``evaluate` 时创建 ``FlowerClient`` 实例的 ``client_fn` 类。最后一步是使用 ``flwr.simulation.start_simulation`` 启动实际模拟。

source: The function ``start_simulation`` accepts a number of arguments, amongst them the ``client_fn`` used to create ``FlowerClient`` instances, the number of clients to simulate (``num_clients``), the number of federated learning rounds (``num_rounds``), and the strategy. The strategy encapsulates the federated learning approach/algorithm, for example, *Federated Averaging* (FedAvg).
fr: La fonction ``start_simulation`` accepte un certain nombre d'arguments, parmi lesquels le ``client_fn`` utilisé pour créer les instances ``FlowerClient``, le nombre de clients à simuler (``num_clients``), le nombre de tours d'apprentissage fédéré (``num_rounds``), et la stratégie. La stratégie encapsule l'approche/algorithme d'apprentissage fédéré, par exemple, *Federated Averaging* (FedAvg).
zh_hans: 函数 ``start_simulation`` 接受许多参数，其中包括用于创建 ``FlowerClient`` 实例的 ``client_fn``、要模拟的客户端数量（``num_clients``）、联邦学习轮数（``num_rounds``）和策略。策略封装了联邦学习方法/算法，例如*联邦平均* (FedAvg)。

source: Flower has a number of built-in strategies, but we can also use our own strategy implementations to customize nearly all aspects of the federated learning approach. For this example, we use the built-in ``FedAvg`` implementation and customize it using a few basic parameters. The last step is the actual call to ``start_simulation`` which - you guessed it - starts the simulation:
fr: Flower dispose d'un certain nombre de stratégies intégrées, mais nous pouvons également utiliser nos propres implémentations de stratégies pour personnaliser presque tous les aspects de l'approche de l'apprentissage fédéré. Pour cet exemple, nous utilisons l'implémentation intégrée ``FedAvg`` et nous la personnalisons en utilisant quelques paramètres de base. La dernière étape est l'appel à ``start_simulation`` qui - tu l'as deviné - démarre la simulation :
zh_hans: Flower 有许多内置策略，但我们也可以使用自己的策略实现来定制联邦学习方法的几乎所有方面。在本例中，我们使用内置的 ``FedAvg`` 实现，并使用一些基本参数对其进行定制。最后一步是实际调用 ``start_simulation``开始模拟：

source: Behind the scenes
fr: Dans les coulisses
zh_hans: 幕后

source: So how does this work? How does Flower execute this simulation?
fr: Alors, comment cela fonctionne-t-il ? Comment Flower exécute-t-il cette simulation ?
zh_hans: 那么它是如何工作的呢？Flower 如何进行模拟？

source: When we call ``start_simulation``, we tell Flower that there are 10 clients (``num_clients=10``). Flower then goes ahead an asks the ``FedAvg`` strategy to select clients. ``FedAvg`` knows that it should select 100% of the available clients (``fraction_fit=1.0``), so it goes ahead and selects 10 random clients (i.e., 100% of 10).
fr: Lorsque nous appelons ``start_simulation``, nous disons à Flower qu'il y a 10 clients (``num_clients=10``). Flower demande alors à la stratégie ``FedAvg`` de sélectionner des clients. ``FedAvg` sait qu'il doit sélectionner 100% des clients disponibles (``fraction_fit=1.0``), alors il choisit 10 clients au hasard (c'est à dire 100% de 10).
zh_hans: 当我们调用 ``start_simulation`` 时，我们会告诉 Flower 有 10 个客户（`num_clients=10``）。然后，Flower 会要求 ``FedAvg`` 策略选择客户。``FedAvg`` 知道它应该选择 100%的可用客户（``fraction_fit=1.0``），所以它会随机选择 10 个客户（即 10 的 100%）。

source: Flower then asks the selected 10 clients to train the model. When the server receives the model parameter updates from the clients, it hands those updates over to the strategy (*FedAvg*) for aggregation. The strategy aggregates those updates and returns the new global model, which then gets used in the next round of federated learning.
fr: Flower demande ensuite aux 10 clients sélectionnés d'entraîner le modèle. Lorsque le serveur reçoit les mises à jour des paramètres du modèle de la part des clients, il les transmet à la stratégie (*FedAvg*) pour qu'elle les agrège. La stratégie agrège ces mises à jour et renvoie le nouveau modèle global, qui est ensuite utilisé dans le prochain cycle d'apprentissage fédéré.
zh_hans: 然后，Flower 会要求选定的 10 个客户端对模型进行训练。服务器收到客户端的模型参数更新后，会将这些更新交给策略（*FedAvg*）进行聚合。策略会聚合这些更新并返回新的全局模型，然后将其用于下一轮联邦学习。

source: Where's the accuracy?
fr: Où est la précision ?
zh_hans: 准确度在哪里找？

source: You may have noticed that all metrics except for ``losses_distributed`` are empty. Where did the ``{"accuracy": float(accuracy)}`` go?
fr: Tu as peut-être remarqué que toutes les mesures, à l'exception de ``pertes_distribuées``, sont vides. Où est passée la ``{"précision" : float(précision)}`` ?
zh_hans: 您可能已经注意到，除了 ``losses_distributed`` 以外，所有指标都是空的。{"准确度": float(准确度)}``去哪儿了？

source: Flower can automatically aggregate losses returned by individual clients, but it cannot do the same for metrics in the generic metrics dictionary (the one with the ``accuracy`` key). Metrics dictionaries can contain very different kinds of metrics and even key/value pairs that are not metrics at all, so the framework does not (and can not) know how to handle these automatically.
fr: Flower peut automatiquement agréger les pertes renvoyées par les clients individuels, mais il ne peut pas faire la même chose pour les mesures dans le dictionnaire de mesures générique (celui avec la clé ``accuracy``). Les dictionnaires de mesures peuvent contenir des types de mesures très différents et même des paires clé/valeur qui ne sont pas des mesures du tout, donc le cadre ne sait pas (et ne peut pas) savoir comment les gérer automatiquement.
zh_hans: Flower 可以自动汇总单个客户端返回的损失值，但无法对通用度量字典中的度量进行同样的处理（即带有 "准确度 "键的度量字典）。度量值字典可以包含非常不同种类的度量值，甚至包含根本不是度量值的键/值对，因此框架不知道（也无法知道）如何自动处理这些度量值。

source: As users, we need to tell the framework how to handle/aggregate these custom metrics, and we do so by passing metric aggregation functions to the strategy. The strategy will then call these functions whenever it receives fit or evaluate metrics from clients. The two possible functions are ``fit_metrics_aggregation_fn`` and ``evaluate_metrics_aggregation_fn``.
fr: En tant qu'utilisateurs, nous devons indiquer au framework comment gérer/agréger ces métriques personnalisées, et nous le faisons en passant des fonctions d'agrégation de métriques à la stratégie. La stratégie appellera alors ces fonctions chaque fois qu'elle recevra des métriques d'ajustement ou d'évaluation de la part des clients. Les deux fonctions possibles sont ``fit_metrics_aggregation_fn`` et ``evaluate_metrics_aggregation_fn``.
zh_hans: 作为用户，我们需要告诉框架如何处理/聚合这些自定义指标，为此，我们将指标聚合函数传递给策略。然后，只要从客户端接收到拟合或评估指标，策略就会调用这些函数。两个可能的函数是 ``fit_metrics_aggregation_fn`` 和 ``evaluate_metrics_aggregation_fn``。

source: Let's create a simple weighted averaging function to aggregate the ``accuracy`` metric we return from ``evaluate``:
fr: Créons une simple fonction de calcul de la moyenne pondérée pour agréger la mesure de "précision" que nous renvoie ``evaluate`` :
zh_hans: 让我们创建一个简单的加权平均函数来汇总从 ``evaluate`` 返回的 ``accuracy`` 指标：

source: The only thing left to do is to tell the strategy to call this function whenever it receives evaluation metric dictionaries from the clients:
fr: La seule chose qui reste à faire est d'indiquer à la stratégie d'appeler cette fonction chaque fois qu'elle reçoit des dictionnaires de métriques d'évaluation de la part des clients :
zh_hans: 剩下要做的就是告诉策略，每当它从客户端接收到评估度量字典时，都要调用这个函数：

source: We now have a full system that performs federated training and federated evaluation. It uses the ``weighted_average`` function to aggregate custom evaluation metrics and calculates a single ``accuracy`` metric across all clients on the server side.
fr: Nous avons maintenant un système complet qui effectue la formation fédérée et l'évaluation fédérée. Il utilise la fonction ``moyenne pondérée`` pour agréger les mesures d'évaluation personnalisées et calcule une seule mesure de ``précision`` pour tous les clients du côté du serveur.
zh_hans: 我们现在有了一个完整的系统，可以执行联邦训练和联邦评估。它使用 ``weighted_average`` 函数汇总自定义评估指标，并在服务器端计算所有客户端的单一 ``accuracy`` 指标。

source: The other two categories of metrics (``losses_centralized`` and ``metrics_centralized``) are still empty because they only apply when centralized evaluation is being used. Part two of the Flower tutorial will cover centralized evaluation.
fr: Les deux autres catégories de mesures (``pertes_centralisées`` et ``métriques_centralisées``) sont toujours vides car elles ne s'appliquent que lorsque l'évaluation centralisée est utilisée. La deuxième partie du tutoriel sur les fleurs couvrira l'évaluation centralisée.
zh_hans: 其他两类指标（`losses_centralized`` 和 `metrics_centralized`）仍然是空的，因为它们只适用于集中评估。Flower 教程的第二部分将介绍集中式评估。

source: Final remarks
fr: Remarques finales
zh_hans: 结束语

source: Congratulations, you just trained a convolutional neural network, federated over 10 clients! With that, you understand the basics of federated learning with Flower. The same approach you've seen can be used with other machine learning frameworks (not just PyTorch) and tasks (not just CIFAR-10 images classification), for example NLP with Hugging Face Transformers or speech with SpeechBrain.
fr: Félicitations, tu viens d'entraîner un réseau neuronal convolutif, fédéré sur 10 clients ! Avec ça, tu comprends les bases de l'apprentissage fédéré avec Flower. La même approche que tu as vue peut être utilisée avec d'autres cadres d'apprentissage automatique (pas seulement PyTorch) et d'autres tâches (pas seulement la classification des images CIFAR-10), par exemple le NLP avec Hugging Face Transformers ou la parole avec SpeechBrain.
zh_hans: 恭喜您，你刚刚训练了一个由 10 个客户端组成的卷积神经网络！这样，你就了解了使用 Flower 进行联邦学习的基础知识。你所看到的方法同样适用于其他机器学习框架（不只是 PyTorch）和任务（不只是 CIFAR-10 图像分类），例如使用 Hugging Face Transformers 的 NLP 或使用 SpeechBrain 的语音。

source: In the next notebook, we're going to cover some more advanced concepts. Want to customize your strategy? Initialize parameters on the server side? Or evaluate the aggregated model on the server side? We'll cover all this and more in the next tutorial.
fr: Dans le prochain cahier, nous allons aborder des concepts plus avancés. Tu veux personnaliser ta stratégie ? Initialiser des paramètres côté serveur ? Ou évaluer le modèle agrégé côté serveur ? Nous aborderons tout cela et bien plus encore dans le prochain tutoriel.
zh_hans: 在下一个笔记中，我们将介绍一些更先进的概念。想定制你的策略吗？在服务器端初始化参数？或者在服务器端评估聚合模型？我们将在下一个教程中介绍所有这些内容以及更多。

source: The `Flower Federated Learning Tutorial - Part 2 <https://flower.dev/docs/framework/tutorial-use-a-federated-learning-strategy-pytorch.html>`__ goes into more depth about strategies and all the advanced things you can build with them.
zh_hans: `Flower 联邦学习教程 - 第 2 部分 <https://flower.dev/docs/framework/tutorial-use-a-federated-learning-strategy-pytorch.html>`__ 更深入地介绍了策略以及可以使用策略构建的所有高级功能。

source: Use a federated learning strategy
zh_hans: 使用联邦学习策略
