Repository: lucacorbucci/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: fr, zh_hans

source: The first thing to notice is that :code:`PytorchMNISTClient` instantiates a CNN model inside its constructor
fr: La première chose à remarquer est que :code:`PytorchMNISTClient` instancie un modèle CNN dans son constructeur
zh_hans: 首先要注意的是 :code:`PytorchMNISTClient` 在其构造函数中实例化了一个 CNN 模型

source: The code for the CNN is available under :code:`quickstart-pytorch.mnist` and it is reproduced below. It is the same network found in `Basic MNIST Example <https://github.com/pytorch/examples/tree/master/mnist>`_.
zh_hans: CNN 的代码可在 :code:`quickstart-pytorch.mnist` 下找到，现复制如下。它与 `Basic MNIST Example <https://github.com/pytorch/examples/tree/master/mnist>`_中的网络相同。

source: The second thing to notice is that :code:`PytorchMNISTClient` class inherits from the :code:`fl.client.Client`, and hence it must implement the following methods:
fr: La deuxième chose à noter est que la classe :code:`PytorchMNISTClient` hérite de :code:`fl.client.Client`, et qu'elle doit donc implémenter les méthodes suivantes :
zh_hans: 第二件要注意的事是 :code:`PytorchMNISTClient` 类继承自 :code:`fl.client.Client`，因此它必须实现以下方法：

source: When comparing the abstract class to its derived class :code:`PytorchMNISTClient` you will notice that :code:`fit` calls a :code:`train` function and that :code:`evaluate` calls a :code:`test`: function.
fr: En comparant la classe abstraite à sa classe dérivée :code:`PytorchMNISTClient`, tu remarqueras que :code:`fit` appelle une fonction :code:`train` et que :code:`evaluate` appelle une fonction :code:`test` :.
zh_hans: 将抽象类与其派生类 :code:`PytorchMNISTClient` 进行比较时，您会发现 :code:`fit` 调用了一个 :code:`train` 函数，而 :code:`evaluate` 则调用了一个 :code:`test`: 函数。

source: These functions can both be found inside the same :code:`quickstart-pytorch.mnist` module:
zh_hans: 这些函数都可以在同一个 :code:`quickstart-pytorch.mnist` 模块中找到：

source: Observe that these functions encapsulate regular training and test loops and provide :code:`fit` and :code:`evaluate` with final statistics for each round. You could substitute them with your custom train and test loops and change the network architecture, and the entire example would still work flawlessly. As a matter of fact, why not try and modify the code to an example of your liking?
fr: Observe que ces fonctions encapsulent les boucles d'entraînement et de test habituelles et fournissent à :code:`fit` et :code:`evaluate` les statistiques finales pour chaque tour. Tu pourrais les remplacer par tes boucles d'entraînement et de test personnalisées et changer l'architecture du réseau, et l'ensemble de l'exemple fonctionnerait toujours parfaitement. En fait, pourquoi ne pas essayer de modifier le code pour en faire un exemple qui te plairait ?
zh_hans: 请注意，这些函数封装了常规的训练和测试循环，并为 :code:`fit` 和 :code:`evaluate` 提供了每轮的最终统计数据。您可以用自定义的训练和测试循环来替代它们，并改变网络结构，整个示例仍然可以完美运行。事实上，为什么不按照自己的喜好修改代码呢？

source: Give It a Try
fr: Fais un essai
zh_hans: 试试看

source: Looking through the quickstart code description above will have given a good understanding of how *clients* and *servers* work in Flower, how to run a simple experiment, and the internals of a client wrapper. Here are a few things you could try on your own and get more experience with Flower:
fr: En parcourant la description du code de démarrage rapide ci-dessus, tu auras acquis une bonne compréhension du fonctionnement des *clients* et des *serveurs* dans Flower, de l'exécution d'une expérience simple et de la structure interne d'un wrapper client. Voici quelques exemples que tu peux essayer par toi-même pour acquérir plus d'expérience avec Flower :
zh_hans: 通过上面的快速入门代码描述，你将对 Flower 中*客户端*和*服务器*的工作方式、如何运行一个简单的实验以及客户端封装器的内部结构有一个很好的了解。您可以自己尝试以下内容，以获得更多使用 Flower 的经验：

source: Try and change :code:`PytorchMNISTClient` so it can accept different architectures.
fr: Essaie de modifier :code:`PytorchMNISTClient` pour qu'il puisse accepter différentes architectures.
zh_hans: 尝试修改 :code:`PytorchMNISTClient`，使其可以接受不同的架构。

source: Modify the :code:`train` function so that it accepts different optimizers
fr: Modifie la fonction :code:`train` pour qu'elle accepte différents optimiseurs
zh_hans: 修改 :code:`train` 函数，使其接受不同的优化器

source: Modify the :code:`test` function so that it proves not only the top-1 (regular accuracy) but also the top-5 accuracy?
fr: Modifie la fonction :code:`test` pour qu'elle prouve non seulement le top-1 (précision normale) mais aussi le top-5 ?
zh_hans: 修改 :code:`test` 函数，使其不仅能输出前 1 名（常规精确度），还能证明前 5 名的精确度？

source: Go larger! Try to adapt the code to larger images and datasets. Why not try training on ImageNet with a ResNet-50?
fr: Essaie d'adapter le code à des images et à des ensembles de données plus grands. Pourquoi ne pas essayer de s'entraîner sur ImageNet avec un ResNet-50 ?
zh_hans: 让我们尝试让代码适应更大的图像和数据集。为什么不尝试使用 ResNet-50 在 ImageNet 上进行训练呢？

source: You are ready now. Enjoy learning in a federated way!
fr: Tu es prêt maintenant. Profite de l'apprentissage de manière fédérée !
zh_hans: 您现在已经准备就绪。尽情享受联邦学习的乐趣吧！

source: Differential privacy
zh_hans: 差别隐私

source: Flower provides differential privacy (DP) wrapper classes for the easy integration of the central DP guarantees provided by DP-FedAvg into training pipelines defined in any of the various ML frameworks that Flower is compatible with.
fr: Flower fournit des classes d'enveloppe de confidentialité différentielle (DP) pour l'intégration facile des garanties centrales de DP fournies par DP-FedAvg dans les pipelines de formation définis dans n'importe lequel des divers cadres de ML avec lesquels Flower est compatible.
zh_hans: Flower 提供了差分隐私 (DP) 封装类，可将 DP-FedAvg 提供的核心 DP 轻松集成到 Flower 兼容的各种 ML 框架中定义的训练模式中。

source: Please note that these components are still experimental, the correct configuration of DP for a specific task is still an unsolved problem.
fr: Note que ces composants sont encore expérimentaux, la configuration correcte du DP pour une tâche spécifique est encore un problème non résolu.
zh_hans: 请注意，这些组件仍处于试验阶段，如何为特定任务正确配置 DP 仍是一个尚未解决的问题。

source: The name DP-FedAvg is misleading since it can be applied on top of any FL algorithm that conforms to the general structure prescribed by the FedOpt family of algorithms.
fr: Le nom DP-FedAvg est trompeur car il peut être appliqué à n'importe quel algorithme FL qui se conforme à la structure générale prescrite par la famille d'algorithmes FedOpt.
zh_hans: DP-FedAvg 这个名称容易引起误解，因为它可以应用于任何符合 FedOpt 系列算法规定的一般结构的 FL 算法之上。

source: DP-FedAvg, originally proposed by McMahan et al. [mcmahan]_ and extended by Andrew et al. [andrew]_, is essentially FedAvg with the following modifications.
fr: DP-FedAvg, proposé à l'origine par McMahan et al. [mcmahan]_ et étendu par Andrew et al. [andrew]_, est essentiellement FedAvg avec les modifications suivantes.
zh_hans: DP-FedAvg 最初由McMahan等人提出，并由Andrew等人加以扩展。

source: **Clipping** : The influence of each client's update is bounded by clipping it. This is achieved by enforcing a cap on the L2 norm of the update, scaling it down if needed.
fr: **Clipping** : L'influence de la mise à jour de chaque client est limitée en l'écrêtant. Ceci est réalisé en imposant un plafond à la norme L2 de la mise à jour, en la réduisant si nécessaire.
zh_hans: **裁剪** ： 裁剪会影响到每个客户端的模型参数。具体做法是对参数的 L2 准则设置上限，必要时将其缩减。

source: **Noising** : Gaussian noise, calibrated to the clipping threshold, is added to the average computed at the server.
fr: **Bruit** : un bruit gaussien, calibré sur le seuil d'écrêtage, est ajouté à la moyenne calculée au niveau du serveur.
zh_hans: **噪声** ： 在服务器计算出的平均值中加入高斯噪声，该噪声根据剪切阈值进行校准。

source: The distribution of the update norm has been shown to vary from task-to-task and to evolve as training progresses. Therefore, we use an adaptive approach [andrew]_ that continuously adjusts the clipping threshold to track a prespecified quantile of the update norm distribution.
fr: Il a été démontré que la distribution de la norme de mise à jour varie d'une tâche à l'autre et évolue au fur et à mesure de la formation. C'est pourquoi nous utilisons une approche adaptative [andrew]_ qui ajuste continuellement le seuil d'écrêtage pour suivre un quantile prédéfini de la distribution de la norme de mise à jour.
zh_hans: 事实证明，参数更新准则的分布会随着任务的不同而变化，并随着训练的进展而演变。因此，我们采用了一种自适应方法，该方法会不断调整剪切阈值，以跟踪参数更新准则分布的预设量化值。

source: Simplifying Assumptions
fr: Simplifier les hypothèses
zh_hans: 简化假设

source: We make (and attempt to enforce) a number of assumptions that must be satisfied to ensure that the training process actually realises the :math:`(\epsilon, \delta)` guarantees the user has in mind when configuring the setup.
fr: Nous formulons (et tentons d'appliquer) un certain nombre d'hypothèses qui doivent être satisfaites pour que le processus de formation réalise réellement les garanties :math:`(\epsilon, \delta)` que l'utilisateur a à l'esprit lorsqu'il configure l'installation.
zh_hans: 我们提出（并试图执行）了一系列必须满足的假设，以确保训练过程真正实现用户在配置设置时所定的 :math:`(\epsilon,\delta)` 。

source: **Fixed-size subsampling** :Fixed-size subsamples of the clients must be taken at each round, as opposed to variable-sized Poisson subsamples.
fr: **Sous-échantillonnage de taille fixe** :Des sous-échantillons de taille fixe des clients doivent être prélevés à chaque tour, par opposition aux sous-échantillons de Poisson de taille variable.
zh_hans: ** 固定大小的子样本** :与可变大小的泊松分布子样本相比，每轮必须抽取固定大小的客户端子样本。

source: **Unweighted averaging** : The contributions from all the clients must weighted equally in the aggregate to eliminate the requirement for the server to know in advance the sum of the weights of all clients available for selection.
fr: **Moyenne non pondérée** : Les contributions de tous les clients doivent être pondérées de façon égale dans l'ensemble afin que le serveur n'ait pas à connaître à l'avance la somme des poids de tous les clients disponibles pour la sélection.
zh_hans: **非加权平均**： 所有客户端的贡献必须加权相等，这样服务器就不需要事先知道所有客户的权重总和。

source: **No client failures** : The set of available clients must stay constant across all rounds of training. In other words, clients cannot drop out or fail.
fr: **Aucune défaillance de client** : L'ensemble des clients disponibles doit rester constant pendant toutes les séries de formation. En d'autres termes, les clients ne peuvent pas abandonner ou échouer.
zh_hans: **没有失败的客户端** ： 在各轮训练中，可用客户端的数量必须保持不变。换句话说，客户端不能退出或失败。

source: The first two are useful for eliminating a multitude of complications associated with calibrating the noise to the clipping threshold while the third one is required to comply with the assumptions of the privacy analysis.
fr: Les deux premiers sont utiles pour éliminer une multitude de complications liées au calibrage du bruit en fonction du seuil d'écrêtage, tandis que le troisième est nécessaire pour se conformer aux hypothèses de l'analyse de la vie privée.
zh_hans: 前两种方法有助于消除将噪声校准为削波阈值所带来的诸多复杂问题，而第三种方法则需要符合隐私分析的假设。

source: These restrictions are in line with constraints imposed by Andrew et al. [andrew]_.
fr: Ces restrictions sont conformes aux contraintes imposées par Andrew et al. [andrew]_.
zh_hans: 这些限制与 Andrew 等人所施加的限制一致。

source: Customizable Responsibility for Noise injection
fr: Responsabilité personnalisable pour l'injection de bruit
zh_hans: 可定制的噪声注入

source: In contrast to other implementations where the addition of noise is performed at the server, you can configure the site of noise injection to better match your threat model. We provide users with the flexibility to set up the training such that each client independently adds a small amount of noise to the clipped update, with the result that simply aggregating the noisy updates is equivalent to the explicit addition of noise to the non-noisy aggregate at the server.
fr: Contrairement à d'autres implémentations où l'ajout de bruit est effectué au niveau du serveur, tu peux configurer le site d'injection de bruit pour qu'il corresponde mieux à ton modèle de menace. Nous offrons aux utilisateurs la possibilité de configurer l'entraînement de telle sorte que chaque client ajoute indépendamment une petite quantité de bruit à la mise à jour écrêtée, ce qui fait que le simple fait d'agréger les mises à jour bruyantes équivaut à l'ajout explicite de bruit à l'agrégat non bruyant au niveau du serveur.
zh_hans: 与其他在服务器上添加噪声的实现方法不同，您可以配置噪声注入的位置，以便更好地匹配您的威胁模型。我们为用户提供了设置训练的灵活性，使每个客户端都能独立地为剪切参数更新添加少量噪声，这样，只需聚合噪声更新，就相当于在服务器上为非噪声聚合添加噪声了。

source: To be precise, if we let :math:`m` be the number of clients sampled each round and :math:`\sigma_\Delta` be the scale of the total Gaussian noise that needs to be added to the sum of the model updates, we can use simple maths to show that this is equivalent to each client adding noise with scale :math:`\sigma_\Delta/\sqrt{m}`.
fr: Pour être précis, si nous laissons :math:`m` être le nombre de clients échantillonnés à chaque tour et :math:\sigma_\Delta` être l'échelle du bruit gaussien total qui doit être ajouté à la somme des mises à jour du modèle, nous pouvons utiliser des mathématiques simples pour montrer que cela équivaut à ce que chaque client ajoute du bruit avec l'échelle :math:\sigma_\Delta/\sqrt{m}`.
zh_hans: 准确地说，我们假设每轮采样的客户端数量为:math:`m`，:math:`\sigma_\Delta` 为需要添加到模型更新总和中的总高斯噪声的规模，我们就可以用简单的数学方法证明了，这相当于每个客户端都添加了规模为 :math:`\sigma_\Delta/\sqrt{m}` 的噪声。

source: Wrapper-based approach
fr: Approche basée sur l'enveloppe
zh_hans: 基于封装的方法

source: Introducing DP to an existing workload can be thought of as adding an extra layer of security around it. This inspired us to provide the additional server and client-side logic needed to make the training process differentially private as wrappers for instances of the :code:`Strategy` and :code:`NumPyClient` abstract classes respectively. This wrapper-based approach has the advantage of being easily composable with other wrappers that someone might contribute to the Flower library in the future, e.g., for secure aggregation. Using Inheritance instead can be tedious because that would require the creation of new sub- classes every time a new class implementing :code:`Strategy` or :code:`NumPyClient` is defined.
fr: L'introduction du DP dans une charge de travail existante peut être considérée comme l'ajout d'une couche de sécurité supplémentaire autour d'elle. Cela nous a incités à fournir la logique supplémentaire côté serveur et côté client nécessaire pour rendre le processus de formation différentiellement privé en tant qu'enveloppes pour les instances des classes abstraites :code:`Strategy` et :code:`NumPyClient` respectivement. Cette approche basée sur l'enveloppe a l'avantage d'être facilement composable avec d'autres enveloppes que quelqu'un pourrait contribuer à la bibliothèque Flower à l'avenir, par exemple, pour l'agrégation sécurisée. L'utilisation de l'héritage à la place peut être fastidieuse car cela nécessiterait la création de nouvelles sous-classes chaque fois qu'une nouvelle classe mettant en œuvre :code:`Strategy` ou :code:`NumPyClient` est définie.
zh_hans: 在现有工作负载中引入 DP 可以被认为是在其周围增加了一层额外的安全性。受此启发，我们提供了额外的服务器端和客户端逻辑，分别作为 :code:`Strategy` 和 :code:`NumPyClient` 抽象类实例的封装器，使训练过程具有不同的隐私性。这种基于封装器的方法的优点是可以很容易地与将来有人贡献给 Flower 的其他封装器（例如用于安全聚合的封装器）进行组合。使用继承可能会比较繁琐，因为每次定义实现 :code:`Strategy` 或 :code:`NumPyClient` 的新类时，都需要创建新的子类。

source: Server-side logic
fr: Logique côté serveur
zh_hans: 服务器端逻辑

source: The first version of our solution was to define a decorator whose constructor accepted, among other things, a boolean valued variable indicating whether adaptive clipping was to be enabled or not. We quickly realized that this would clutter its :code:`__init__()` function with variables corresponding to hyperparameters of adaptive clipping that would remain unused when it was disabled. A cleaner implementation could be achieved by splitting the functionality into two decorators, :code:`DPFedAvgFixed` and :code:`DPFedAvgAdaptive`, with the latter sub- classing the former. The constructors for both classes accept a boolean parameter :code:`server_side_noising`, which, as the name suggests, determines where noising is to be performed.
fr: La première version de notre solution consistait à définir un décorateur dont le constructeur acceptait, entre autres, une variable à valeur booléenne indiquant si l'écrêtage adaptatif devait être activé ou non. Nous nous sommes rapidement rendu compte que cela encombrerait sa fonction :code:`__init__()` avec des variables correspondant aux hyperparamètres de l'écrêtage adaptatif qui resteraient inutilisées lorsque celui-ci était désactivé. Une implémentation plus propre pourrait être obtenue en divisant la fonctionnalité en deux décorateurs, :code:`DPFedAvgFixed` et :code:`DPFedAvgAdaptive`, le second sous-classant le premier. Les constructeurs des deux classes acceptent un paramètre booléen :code:`server_side_noising` qui, comme son nom l'indique, détermine l'endroit où le noising doit être effectué.
zh_hans: 我们的第一版解决方案是定义一个装饰器，其构造函数接受一个布尔值变量，表示是否启用自适应剪裁。我们很快意识到，这样会使其 :code:`__init__()` 函数中与自适应裁剪超参数相对应的变量变得杂乱无章，而这些变量在自适应裁剪被禁用时将保持未使用状态。要实现更简洁的功能，可以将该功能拆分为两个装饰器，即 :code:`DPFedAvgFixed` 和 :code:`DPFedAvgAdaptive`，后者是前者的子类。这两个类的构造函数都接受一个布尔参数 :code:`server_side_noising`，顾名思义，它决定了在哪里加噪声。

source: The server-side capabilities required for the original version of DP-FedAvg, i.e., the one which performed fixed clipping, can be completely captured with the help of wrapper logic for just the following two methods of the :code:`Strategy` abstract class.
fr: Les capacités côté serveur requises pour la version originale de DP-FedAvg, c'est-à-dire celle qui effectue un écrêtage fixe, peuvent être entièrement capturées à l'aide d'une logique d'enveloppement pour les deux méthodes suivantes de la classe abstraite :code:`Strategy`.
zh_hans: 只需对 :code:`Strategy` 抽象类的以下两个方法进行封装，就能完全捕获 DP-FedAvg 原始版本（即执行固定剪裁的版本）所需的服务器端功能。

source: :code:`configure_fit()` : The config dictionary being sent by the wrapped :code:`Strategy` to each client needs to be augmented with an additional value equal to the clipping threshold (keyed under :code:`dpfedavg_clip_norm`) and, if :code:`server_side_noising=true`, another one equal to the scale of the Gaussian noise that needs to be added at the client (keyed under :code:`dpfedavg_noise_stddev`). This entails *post*-processing of the results returned by the wrappee's implementation of :code:`configure_fit()`.
fr: :code:`configure_fit()` : Le dictionnaire de configuration envoyé par la :code:`Strategy` enveloppée à chaque client doit être augmenté d'une valeur supplémentaire égale au seuil d'écrêtage (indiqué sous :code:`dpfedavg_clip_norm`) et, si :code:`server_side_noising=true`, d'une autre égale à l'échelle du bruit gaussien qui doit être ajouté au client (indiqué sous :code:`dpfedavg_noise_stddev`).
zh_hans: :code:`configure_fit()` ：由封装的 :code:`Strategy` 发送到每个客户端的配置字典需要使用等于裁剪阈值的附加值（在 :code:`dpfedavg_clip_norm` 下键入）进行扩充。并且，如果 server_side_noising=true，则另一个值等于需要在客户端添加的高斯噪声的大小（在 dpfedavg_noise_stddev 下键入）。这需要对封装后的configure_fit() 所返回的结果进行后处理。

source: :code:`aggregate_fit()`: We check whether any of the sampled clients dropped out or failed to upload an update before the round timed out. In that case, we need to abort the current round, discarding any successful updates that were received, and move on to the next one. On the other hand, if all clients responded successfully, we must force the averaging of the updates to happen in an unweighted manner by intercepting the :code:`parameters` field of :code:`FitRes` for each received update and setting it to 1. Furthermore, if :code:`server_side_noising=true`, each update is perturbed with an amount of noise equal to what it would have been subjected to had client-side noising being enabled. This entails *pre*-processing of the arguments to this method before passing them on to the wrappee's implementation of :code:`aggregate_fit()`.
zh_hans: :code:`aggregate_fit()`： 我们会检查是否有任何客户端在本轮超时前退出或未能上传参数更新。在这种情况下，我们需要中止当前一轮，丢弃已收到的所有参数更新，然后继续下一轮。另一方面，如果所有客户端都成功响应，我们就必须通过拦截 :code:`FitRes` 的 :code:`parameters` 字段并将其设置为 1，强制以不加权的方式平均更新。此外，如果 :code:`server_side_noising=true`，每次更新都会受到一定量的噪声扰动，其扰动量相当于启用客户端噪声时的扰动量。 这就需要在将本方法的参数传递给封装的 :code:`aggregate_fit()` 之前，对参数进行*预*处理。

source: We can't directly change the aggregation function of the wrapped strategy to force it to add noise to the aggregate, hence we simulate client-side noising to implement server-side noising.
fr: Nous ne pouvons pas modifier directement la fonction d'agrégation de la stratégie enveloppée pour la forcer à ajouter du bruit à l'agrégat, c'est pourquoi nous simulons le bruit côté client pour mettre en œuvre le bruit côté serveur.
zh_hans: 我们无法直接改变封装策略的聚合函数，迫使它在聚合中添加噪声，因此我们模拟客户端噪声来实现服务器端噪声。

source: These changes have been put together into a class called :code:`DPFedAvgFixed`, whose constructor accepts the strategy being decorated, the clipping threshold and the number of clients sampled every round as compulsory arguments. The user is expected to specify the clipping threshold since the order of magnitude of the update norms is highly dependent on the model being trained and providing a default value would be misleading. The number of clients sampled at every round is required to calculate the amount of noise that must be added to each individual update, either by the server or the clients.
fr: Ces modifications ont été regroupées dans une classe appelée :code:`DPFedAvgFixed`, dont le constructeur accepte la stratégie décorée, le seuil d'écrêtage et le nombre de clients échantillonnés à chaque tour comme arguments obligatoires. L'utilisateur est censé spécifier le seuil d'écrêtage car l'ordre de grandeur des normes de mise à jour dépend fortement du modèle formé et fournir une valeur par défaut serait trompeur. Le nombre de clients échantillonnés à chaque tour est nécessaire pour calculer la quantité de bruit qui doit être ajoutée à chaque mise à jour individuelle, que ce soit par le serveur ou par les clients.
zh_hans: 这些变化被整合到一个名为 :code:`DPFedAvgFixed` 的类中，其构造函数接受被装饰的策略、剪切阈值和每轮采样的客户数作为必选参数。用户需要指定剪切阈值，因为参数更新规范的数量级在很大程度上取决于正在训练的模型，提供默认值会产生误导。每轮采样的客户端数量是计算服务器或客户在每次参数更新时添加的噪音量所必需的。

source: The additional functionality required to facilitate adaptive clipping has been provided in :code:`DPFedAvgAdaptive`, a subclass of :code:`DPFedAvgFixed`. It overrides the above-mentioned methods to do the following.
fr: La fonctionnalité supplémentaire nécessaire pour faciliter l'écrêtage adaptatif a été fournie dans :code:`DPFedAvgAdaptive`, une sous-classe de :code:`DPFedAvgFixed`. Elle remplace les méthodes mentionnées ci-dessus pour effectuer les opérations suivantes.
zh_hans: 自适应剪裁所需的附加功能在 :code:`DPFedAvgAdaptive` 中提供，其是 :code:`DPFedAvgFixed` 的子类。它重写了上述方法，以实现以下功能。

source: :code:`configure_fit()` : It intercepts the config dict returned by :code:`super.configure_fit()` to add the key-value pair :code:`dpfedavg_adaptive_clip_enabled:True` to it, which the client interprets as an instruction to include an indicator bit (1 if update norm <= clipping threshold, 0 otherwise) in the results returned by it.
fr: :code:`configure_fit()` : Il intercepte le dict de configuration renvoyé par :code:`super.configure_fit()` pour y ajouter la paire clé-valeur :code:`dpfedavg_adaptive_clip_enabled:True`, que le client interprète comme une instruction d'inclure un bit indicateur (1 si la norme de mise à jour <= seuil d'écrêtage, 0 sinon) dans les résultats qu'il renvoie.
zh_hans: :code:`configure_fit()`：它截取由 :code:`super.configure_fit()` 返回的 config 字典，并在其中添加键-值对 :code:`dpfedavg_adaptive_clip_enabled:True"，客户端将其解释为在返回结果中包含一个指示位（如果参数更新范式 <= 剪裁阈值，则为 1，否则为 0）的指令。
