Repository: lucacorbucci/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: fr, zh_hans

source: :code:`aggregate_fit()` : It follows a call to :code:`super.aggregate_fit()` with one to :code:`__update_clip_norm__()`, a procedure which adjusts the clipping threshold on the basis of the indicator bits received from the sampled clients.
fr: :code:`aggregate_fit()` : Il fait suivre un appel à :code:`super.aggregate_fit()` d'un appel à :code:`__update_clip_norm__()`, une procédure qui ajuste le seuil d'écrêtage sur la base des bits indicateurs reçus des clients échantillonnés.
zh_hans: :code:`aggregate_fit()`：在调用:code:`super.aggregate_fit()`后，再调用:code:`__update_clip_norm__()`，该过程根据从采样客户端接收到的指示位调整裁剪阈值。

source: Client-side logic
fr: Logique côté client
zh_hans: 客户端逻辑

source: The client-side capabilities required can be completely captured through wrapper logic for just the :code:`fit()` method of the :code:`NumPyClient` abstract class. To be precise, we need to *post-process* the update computed by the wrapped client to clip it, if necessary, to the threshold value supplied by the server as part of the config dictionary. In addition to this, it may need to perform some extra work if either (or both) of the following keys are also present in the dict.
fr: Les capacités requises côté client peuvent être entièrement capturées par une logique de wrapper pour la seule méthode :code:`fit()` de la classe abstraite :code:`NumPyClient`. Pour être précis, nous devons *post-traiter* la mise à jour calculée par le client wrapped pour l'écrêter, si nécessaire, à la valeur seuil fournie par le serveur dans le cadre du dictionnaire de configuration. En plus de cela, il peut avoir besoin d'effectuer un travail supplémentaire si l'une des clés suivantes (ou les deux) est également présente dans le dict.
zh_hans: 客户端所需的功能完全可以通过 :code:`NumPyClient` 抽象类的 :code:`fit()` 方法的封装逻辑来实现。准确地说，我们需要对封装客户端计算的参数更新进行处理，以便在必要时将其剪切到服务器作为配置字典的一部分提供的阈值。除此之外，如果配置字典中还存在以下任一（或两个）键，客户端可能还需要执行一些额外的工作。

source: :code:`dpfedavg_noise_stddev` : Generate and add the specified amount of noise to the clipped update.
fr: :code:`dpfedavg_noise_stddev` : Génère et ajoute la quantité de bruit spécifiée à la mise à jour de l'écrêtage.
zh_hans: code:`dpfedavg_noise_stddev`：生成并在剪切参数更新中添加指定数量的噪声。

source: :code:`dpfedavg_adaptive_clip_enabled` : Augment the metrics dict in the :code:`FitRes` object being returned to the server with an indicator bit, calculated as described earlier.
fr: :code:`dpfedavg_adaptive_clip_enabled` : Complète les métriques dict dans l'objet :code:`FitRes` renvoyé au serveur avec un bit indicateur, calculé comme décrit précédemment.
zh_hans: :code:`dpfedavg_adaptive_clip_enabled`：在返回给服务器的 :code:`FitRes` 对象中的度量值字典中增加一个指标位，计算方法如前所述。

source: Performing the :math:`(\epsilon, \delta)` analysis
fr: Effectuer l'analyse :math:`(\epsilon, \delta)`
zh_hans: 进行 :math:`(epsilon, \delta)` 分析

source: Assume you have trained for :math:`n` rounds with sampling fraction :math:`q` and noise multiplier :math:`z`. In order to calculate the :math:`\epsilon` value this would result in for a particular :math:`\delta`, the following script may be used.
fr: Supposons que tu te sois entraîné pendant :math:`n` tours avec la fraction d'échantillonnage :math:`q` et le multiplicateur de bruit :math:`z`. Afin de calculer la valeur :math:`epsilon` qui en résulterait pour un :math:`\delta` particulier, le script suivant peut être utilisé.
zh_hans: 假设您已经训练了 :math:`n` 轮，采样比例为 :math:`q`，噪声乘数为 :math:`z`。为了计算特定 :math:`\delta` 的 :math:`epsilon` 值，可以使用下面的脚本。

source: McMahan, H. Brendan, et al. "Learning differentially private recurrent language models." arXiv preprint arXiv:1710.06963 (2017).
zh_hans: McMahan, H. Brendan等. "Learning differentially private recurrent language models." arXiv preprint arXiv:1710.06963 (2017).

source: Andrew, Galen, et al. "Differentially private learning with adaptive clipping." Advances in Neural Information Processing Systems 34 (2021): 17455-17466.
zh_hans: Andrew, Galen等. "Differentially private learning with adaptive clipping." Advances in Neural Information Processing Systems 34 (2021): 17455-17466.

source: Federated evaluation
fr: Évaluation fédérée
zh_hans: 联邦学习评估

source: There are two main approaches to evaluating models in federated learning systems: centralized (or server-side) evaluation and federated (or client-side) evaluation.
fr: Il existe deux approches principales pour évaluer les modèles dans les systèmes d'apprentissage fédérés : l'évaluation centralisée (ou côté serveur) et l'évaluation fédérée (ou côté client).
zh_hans: 评估联合学习系统中的模型主要有两种方法：集中（或服务器端）评估和联邦（或客户端）评估。

source: Centralized Evaluation
fr: Évaluation centralisée
zh_hans: 集中评估

source: Built-In Strategies
fr: Stratégies intégrées
zh_hans: 内置策略

source: All built-in strategies support centralized evaluation by providing an evaluation function during initialization. An evaluation function is any function that can take the current global model parameters as input and return evaluation results:
fr: Toutes les stratégies intégrées prennent en charge l'évaluation centralisée en fournissant une fonction d'évaluation lors de l'initialisation. Une fonction d'évaluation est une fonction qui peut prendre les paramètres du modèle global actuel comme entrée et renvoyer les résultats de l'évaluation :
zh_hans: 所有内置策略都通过在初始化过程中提供一个评估函数来支持集中评估。评估函数是任何可以将当前全局模型参数作为输入并返回评估结果的函数：

source: Custom Strategies
fr: Stratégies personnalisées
zh_hans: 定制策略

source: The :code:`Strategy` abstraction provides a method called :code:`evaluate` that can directly be used to evaluate the current global model parameters. The current server implementation calls :code:`evaluate` after parameter aggregation and before federated evaluation (see next paragraph).
fr: L'abstraction :code:`Strategy` fournit une méthode appelée :code:`evaluate` qui peut être directement utilisée pour évaluer les paramètres du modèle global actuel. L'implémentation actuelle du serveur appelle :code:`evaluate` après l'agrégation des paramètres et avant l'évaluation fédérée (voir le paragraphe suivant).
zh_hans: :code:`Strategy` 抽象提供了一个名为 :code:`evaluate` 的方法，可直接用于评估当前的全局模型参数。服务器会在参数聚合后和联邦评估前调用 :code:`evaluate`（见下段）。

source: Federated Evaluation
fr: Évaluation fédérée
zh_hans: 联邦评估

source: Implementing Federated Evaluation
fr: Mise en œuvre de l'évaluation fédérée
zh_hans: 实现联邦评估

source: Client-side evaluation happens in the :code:`Client.evaluate` method and can be configured from the server side.
fr: L'évaluation côté client se fait dans la méthode :code:`Client.evaluate` et peut être configurée côté serveur.
zh_hans: 客户端评估在 :code:`Client.evaluate` 方法中进行，并可从服务器端进行配置。

source: Configuring Federated Evaluation
fr: Configuration de l'évaluation fédérée
zh_hans: 配置联邦评估

source: Federated evaluation can be configured from the server side. Built-in strategies support the following arguments:
fr: L'évaluation fédérée peut être configurée du côté du serveur. Les stratégies intégrées prennent en charge les arguments suivants :
zh_hans: 联邦评估可从服务器端进行配置。内置策略支持以下参数：

source: :code:`fraction_evaluate`: a :code:`float` defining the fraction of clients that will be selected for evaluation. If :code:`fraction_evaluate` is set to :code:`0.1` and :code:`100` clients are connected to the server, then :code:`10` will be randomly selected for evaluation. If :code:`fraction_evaluate` is set to :code:`0.0`, federated evaluation will be disabled.
fr: :code:`fraction_evaluate` : un :code:`float` définissant la fraction de clients qui sera sélectionnée pour l'évaluation. Si :code:`fraction_evaluate` est défini à :code:`0.1` et que :code:`100` clients sont connectés au serveur, alors :code:`10` sera sélectionné aléatoirement pour l'évaluation. Si :code:`fraction_evaluate` est défini à :code:`0.0`, l'évaluation fédérée sera désactivée.
zh_hans: :code:`fraction_evaluate`： :code:`float`，定义了被选中进行评估的客户端的比例。如果 :code:`fraction_evaluate` 设置为 :code:`0.1`，并且 :code:`100` 个客户端连接到服务器，那么 :code:`10` 个客户端将被随机选中进行评估。如果 :code:`fraction_evaluate` 设置为 :code:`0.0`，联邦评估将被禁用。

source: :code:`min_evaluate_clients`: an :code:`int`: the minimum number of clients to be selected for evaluation. If :code:`fraction_evaluate` is set to :code:`0.1`, :code:`min_evaluate_clients` is set to 20, and :code:`100` clients are connected to the server, then :code:`20` clients will be selected for evaluation.
fr: si :code:`fraction_evaluate` est réglé sur :code:`0.1`, :code:`min_evaluate_clients` est réglé sur 20, et que :code:`100` clients sont connectés au serveur, alors :code:`20` clients seront sélectionnés pour l'évaluation.
zh_hans: :code:`min_evaluate_clients`：一个 :code:`int`，需要评估的客户的最小数量。如果 :code:`fraction_evaluate` 设置为 :code:`0.1`，:code:`min_evaluate_clients` 设置为 20，并且有 :code:`100` 个客户端已连接到服务器，那么 :code:`20` 个客户端将被选中进行评估。

source: :code:`min_available_clients`: an :code:`int` that defines the minimum number of clients which need to be connected to the server before a round of federated evaluation can start. If fewer than :code:`min_available_clients` are connected to the server, the server will wait until more clients are connected before it continues to sample clients for evaluation.
fr: :code:`min_available_clients` : un :code:`int` qui définit le nombre minimum de clients qui doivent être connectés au serveur avant qu'un cycle d'évaluation fédérée puisse commencer. Si moins de :code:`min_available_clients` sont connectés au serveur, le serveur attendra que d'autres clients soient connectés avant de continuer à échantillonner des clients pour l'évaluation.
zh_hans: :code:`min_available_clients`： :code:`int`，定义了在一轮联邦评估开始之前，需要连接到服务器的最小客户端数量。如果连接到服务器的客户端数量少于 :code:`min_available_clients`，服务器将等待更多客户端连接后，才继续采样客户端进行评估。

source: :code:`on_evaluate_config_fn`: a function that returns a configuration dictionary which will be sent to the selected clients. The function will be called during each round and provides a convenient way to customize client-side evaluation from the server side, for example, to configure the number of validation steps performed.
fr: :code:`on_evaluate_config_fn` : une fonction qui renvoie un dictionnaire de configuration qui sera envoyé aux clients sélectionnés. Cette fonction sera appelée à chaque tour et offre un moyen pratique de personnaliser l'évaluation côté client depuis le côté serveur, par exemple pour configurer le nombre d'étapes de validation effectuées.
zh_hans: code:`on_evaluate_config_fn`：返回配置字典的函数，该字典将发送给选定的客户端。该函数将在每一轮中被调用，并提供了一种方便的方法来从服务器端自定义客户端评估，例如，配置执行的验证步骤数。

source: Evaluating Local Model Updates During Training
fr: Évaluer les mises à jour du modèle local pendant la formation
zh_hans: 评估训练期间的本地模型更新

source: Model parameters can also be evaluated during training. :code:`Client.fit` can return arbitrary evaluation results as a dictionary:
fr: Les paramètres du modèle peuvent également être évalués pendant la formation. :code:`Client.fit` peut renvoyer des résultats d'évaluation arbitraires sous forme de dictionnaire :
zh_hans: 模型参数也可在训练过程中进行评估。 :code:`Client.fit`可以字典形式返回任意评估结果：

source: Full Code Example
fr: Exemple de code complet
zh_hans: 完整代码示例

source: For a full code example that uses both centralized and federated evaluation, see the *Advanced TensorFlow Example* (the same approach can be applied to workloads implemented in any other framework): https://github.com/adap/flower/tree/main/examples/advanced-tensorflow
zh_hans: 有关同时使用集中评估和联邦评估的完整代码示例，请参阅 *Advanced TensorFlow Example*（同样的方法也可应用于任何其他框架中）： https://github.com/adap/flower/tree/main/examples/advanced-tensorflow

source: FED Template
fr: Modèle FED
zh_hans: FED 模板

source: Table of Contents
fr: Table des matières
zh_hans: 目录

source: [Table of Contents](#table-of-contents)
fr: [Table des matières](#table-of-contents)
zh_hans: [目录]（#table-of-contents）

source: [Summary](#summary)
fr: [Résumé](#résumé)
zh_hans: [总结](#summary)

source: [Motivation](#motivation)
zh_hans: [动机](#motivation)

source: [Goals](#goals)
fr: [Buts](#buts)
zh_hans: [目标](#goals)

source: [Non-Goals](#non-goals)
fr: [Non-objectifs](#non-objectifs)
zh_hans: [非目标](#non-goals)

source: [Proposal](#proposal)
fr: [Proposition](#proposition)
zh_hans: [计划](#proposal)

source: [Drawbacks](#drawbacks)
fr: [Inconvénients](#inconvénients)
zh_hans: [缺点](#drawbacks)

source: [Alternatives Considered](#alternatives-considered)
fr: [Alternatives envisagées](#alternatives-considered)
zh_hans: [备选方案](#alternatives-considered)

source: [Appendix](#appendix)
fr: [Annexe](#appendix)
zh_hans: [附录](#appendix)

source: Summary
fr: Résumé
zh_hans: 总结

source: \[TODO - sentence 1: summary of the problem\]
zh_hans: \[TODO - 句子 1: 问题概括\]

source: \[TODO - sentence 2: summary of the solution\]
zh_hans: \[TODO - 句子 2: 解决方案概括\]

source: Motivation
zh_hans: 动机

source: Goals
fr: Objectifs
zh_hans: 目标

source: Non-Goals
fr: Non-objectifs
zh_hans: 非目标

source: Proposal
fr: Proposition
zh_hans: 提案

source: Drawbacks
fr: Inconvénients
zh_hans: 缺点

source: Alternatives Considered
fr: Alternatives envisagées
zh_hans: 备选方案

source: \[Alternative 1\]
zh_hans: \[备选 1\]

source: \[Alternative 2\]
zh_hans: \[备选 2\]

source: Appendix
fr: Annexe
zh_hans: 附录

source: Flower Enhancement Doc
fr: Doc sur l'amélioration des fleurs
zh_hans: Flower 改善文档

source: [Enhancement Doc Template](#enhancement-doc-template)
fr: [Modèle de document d'amélioration](#enhancement-doc-template)
zh_hans: [增强文档模版](#enhancement-doc-template)

source: [Metadata](#metadata)
fr: [Métadonnées](#métadonnées)
zh_hans: [描述数据](#metadata)

source: [Workflow](#workflow)
zh_hans: [工作流程](#workflow)

source: [GitHub Issues](#github-issues)
zh_hans: [GitHub 问题](#github-issues)

source: [Google Docs](#google-docs)
zh_hans: [谷歌文档](#google-docs)

source: A Flower Enhancement is a standardized development process to
fr: Une amélioration de la fleur est un processus de développement standardisé pour
zh_hans: 改善 Flower 功能是一个标准化的开发流程，目的是

source: provide a common structure for proposing larger changes
fr: fournir une structure commune pour proposer des changements plus importants
zh_hans: 为提出更大规模的改动提供一个共同的结构

source: ensure that the motivation for a change is clear
fr: s'assurer que la motivation du changement est claire
zh_hans: 确保改动的动机明确

source: persist project information in a version control system
fr: conserver les informations sur le projet dans un système de contrôle des versions
zh_hans: 将项目信息保存在版本控制系统中

source: document the motivation for impactful user-facing changes
fr: documenter la motivation des changements qui ont un impact sur l'utilisateur
zh_hans: 记录面向用户的具有影响力的改动的动机

source: reserve GitHub issues for tracking work in flight
fr: réserve les problèmes GitHub pour le suivi du travail en vol
zh_hans: 保留 GitHub 问题，用于跟踪进行中的工作

source: ensure community participants can successfully drive changes to completion across one or more releases while stakeholders are adequately represented throughout the process
fr: s'assurer que les participants de la communauté peuvent mener à bien les changements dans le cadre d'une ou plusieurs versions et que les parties prenantes sont représentées de manière adéquate tout au long du processus
zh_hans: 确保社区参与者能够成功推动改动，完成一个或多个版本，同时利益相关者在整个过程中得到充分展现

source: Hence, an Enhancement Doc combines aspects of
fr: Par conséquent, un document d'amélioration combine des aspects de
zh_hans: 因此，"增强文件"将以下方面结合起来

source: a feature, and effort-tracking document
fr: une caractéristique, et un document de suivi des efforts
zh_hans: 一个功能和效力跟踪文档

source: a product requirements document
fr: un document sur les exigences du produit
zh_hans: 一个产品需要文档

source: a design document
fr: un document de conception
zh_hans: 一个设计文档

source: into one file, which is created incrementally in collaboration with the community.
fr: en un seul fichier, qui est créé progressivement en collaboration avec la communauté.
zh_hans: 该文件是与社区合作逐步创建的。

source: For far-fetching changes or features proposed to Flower, an abstraction beyond a single GitHub issue or pull request is required to understand and communicate upcoming changes to the project.
fr: Pour les changements lointains ou les fonctionnalités proposées à Flower, une abstraction au-delà d'une simple question GitHub ou d'une demande de tirage est nécessaire pour comprendre et communiquer les changements à venir dans le projet.
zh_hans: 对于向 Flower 提出的远期变更或功能，需要一个超越单个 GitHub 问题或拉取请求（pull request）的抽象概念，以了解和沟通项目即将发生的变更。

source: The purpose of this process is to reduce the amount of "tribal knowledge" in our community. By moving decisions from Slack threads, video calls, and hallway conversations into a well-tracked artifact, this process aims to enhance communication and discoverability.
fr: L'objectif de ce processus est de réduire la quantité de "connaissances tribales" dans notre communauté. En déplaçant les décisions des fils de discussion Slack, des appels vidéo et des conversations de couloir vers un artefact bien suivi, ce processus vise à améliorer la communication et la découvrabilité.
zh_hans: 这一流程的目的是减少我们社区中 "部落知识 "的数量。通过将决策从 Slack 线程、视频通话和走廊对话转移到一个跟踪良好的工作环境中，该流程旨在加强沟通和可发现性。

source: Roughly any larger, user-facing enhancement should follow the Enhancement process. If an enhancement would be described in either written or verbal communication to anyone besides the author or developer, then consider creating an Enhancement Doc.
fr: Si une amélioration doit être décrite par écrit ou verbalement à quelqu'un d'autre que l'auteur ou le développeur, il faut envisager de créer un document d'amélioration.
zh_hans: 任何较大的、面向用户的增强都应遵循增强流程。如果要以书面或口头形式向作者或开发人员以外的任何人描述增强功能，则应考虑创建改善文档。

source: Similarly, any technical effort (refactoring, major architectural change) that will impact a large section of the development community should also be communicated widely. The Enhancement process is suited for this even if it will have zero impact on the typical user or operator.
fr: De même, tout effort technique (refactorisation, changement architectural majeur) qui aura un impact sur une grande partie de la communauté de développement doit également être communiqué à grande échelle. Le processus d'amélioration est adapté à cela, même s'il n'aura aucun impact sur l'utilisateur ou l'opérateur type.
zh_hans: 同样，任何会对开发社区的大部分人产生影响的技术工作（重构、重大架构变更）也应广泛传播。即使对典型用户或操作员的影响为零，改进流程也适用于这种情况。

source: For small changes and additions, going through the Enhancement process would be time-consuming and unnecessary. This includes, for example, adding new Federated Learning algorithms, as these only add features without changing how Flower works or is used.
fr: Pour les petits changements et ajouts, passer par le processus d'amélioration prendrait beaucoup de temps et serait inutile. Cela inclut, par exemple, l'ajout de nouveaux algorithmes d'apprentissage fédéré, car ceux-ci ne font qu'ajouter des fonctionnalités sans changer le fonctionnement ou l'utilisation de Flower.
zh_hans: 对于小的改动和添加，通过 "改善"程序既耗时又没有必要。例如，这包括添加新的联邦学习算法，因为这只会增加功能，而不会改变 "Flower "的工作或使用方式。

source: Enhancements are different from feature requests, as they are already providing a laid-out path for implementation and are championed by members of the community.
fr: Les améliorations sont différentes des demandes de fonctionnalités, car elles fournissent déjà un chemin tracé pour la mise en œuvre et sont défendues par les membres de la communauté.
zh_hans: 增强功能与功能请求不同，因为它们已经提供了实施路径，并得到了社区成员的支持。

source: An Enhancement is captured in a Markdown file that follows a defined template and a workflow to review and store enhancement docs for reference — the Enhancement Doc.
fr: Une amélioration est capturée dans un fichier Markdown qui suit un modèle défini et un flux de travail pour examiner et stocker les documents d'amélioration pour référence - le Doc d'amélioration.
zh_hans: 增强功能被记录在一个 Markdown 文件中，该文件遵循已定义的模板和工作流程，用于审查和存储增强功能文档（即增强功能文档）以供参考。

source: Enhancement Doc Template
fr: Modèle de document d'amélioration
zh_hans: 增强文档模板

source: Each enhancement doc is provided as a Markdown file having the following structure
fr: Chaque document d'amélioration est fourni sous la forme d'un fichier Markdown ayant la structure suivante
zh_hans: 每个增强文档都以 Markdown 文件的形式提供，其结构如下

source: Metadata (as [described below](#metadata) in form of a YAML preamble)
fr: Métadonnées (comme [décrit ci-dessous](#metadata) sous la forme d'un préambule YAML)
zh_hans: 描述数据（[如下所述](#metadata) 以 YAML 前言的形式出现）

source: Title (same as in metadata)
fr: Titre (le même que dans les métadonnées)
zh_hans: 标题（与描述数据中的标题相同）

source: Table of Contents (if needed)
fr: Table des matières (si nécessaire)
zh_hans: 目录（如有需要）

source: Notes/Constraints/Caveats (optional)
fr: Notes/Contraintes/Cavats (facultatif)
zh_hans: 注意事项/限制/警告（可选）

source: Design Details (optional)
fr: Détails de la conception (facultatif)
zh_hans: 设计细节（可选）

source: Graduation Criteria
fr: Critères d'obtention du diplôme
zh_hans: 毕业标准

source: Upgrade/Downgrade Strategy (if applicable)
fr: Stratégie de mise à niveau/rétrogradation (le cas échéant)
zh_hans: 升级/降级策略（如适用）

source: As a reference, this document follows the above structure.
fr: À titre de référence, ce document suit la structure ci-dessus.
zh_hans: 作为参考，本文件采用上述结构。

source: Metadata
fr: Métadonnées
zh_hans: 描述数据

source: **fed-number** (Required) The `fed-number` of the last Flower Enhancement Doc + 1. With this number, it becomes easy to reference other proposals.
fr: **numérofed** (Obligatoire) Le `numérofed` du dernier document d'amélioration de la fleur + 1. Avec ce numéro, il devient facile de faire référence à d'autres propositions.
zh_hans: **fed-number**（必填）上一个Flower增强文件的 "fed-number "+1。有了这个编号，就很容易参考其他提案。

source: **title** (Required) The title of the proposal in plain language.
fr: **titre** (obligatoire) Le titre de la proposition en langage clair.
zh_hans: **标题** （必填）用简明语言写出提案的标题。

source: **status** (Required) The current status of the proposal. See [workflow](#workflow) for the possible states.
fr: **status** (obligatoire) L'état actuel de la proposition. Voir [workflow](#workflow) pour les états possibles.
zh_hans: **status** （必填）提案的当前状态。有关可能的状态，请参阅 [工作流程](#workflow)。

source: **authors** (Required) A list of authors of the proposal. This is simply the GitHub ID.
fr: **authors** (Obligatoire) Une liste des auteurs de la proposition, il s'agit simplement de l'identifiant GitHub.
zh_hans: **作者**（必填） 提案的作者列表。这只是 GitHub ID。

source: **creation-date** (Required) The date that the proposal was first submitted in a PR.
fr: **creation-date** (Obligatoire) Date à laquelle la proposition a été soumise pour la première fois dans un RP.
zh_hans: **创建日期**（必填） 建议书在 PR 中首次提交的日期。

source: **last-updated** (Optional) The date that the proposal was last changed significantly.
fr: **dernière mise à jour** (Facultatif) La date à laquelle la proposition a été modifiée de manière significative pour la dernière fois.
zh_hans: **最后更新** （可选）提案最后一次重大修改的日期。

source: **see-also** (Optional) A list of other proposals that are relevant to this one.
fr: **see-also** (Facultatif) Une liste d'autres propositions qui sont pertinentes par rapport à celle-ci.
zh_hans: **另见** （可选）与本提案相关的其他提案清单。

source: **replaces** (Optional) A list of proposals that this one replaces.
fr: **replaces** (Facultatif) Une liste de propositions que celle-ci remplace.
zh_hans: **取代**（可选） 这份提案所取代的提案列表。

source: **superseded-by** (Optional) A list of proposals that this one supersedes.
fr: **superseded-by** (Facultatif) Une liste de propositions que celle-ci remplace.
zh_hans: **被取代者** （可选） 此提案取代的提案列表。

source: Workflow
fr: Flux de travail
zh_hans: 工作流程
