Repository: lucacorbucci/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: fr, zh_hans

source: **Make** `get_parameters` **configurable** ([#1242](https://github.com/adap/flower/pull/1242))
zh_hans: **使** `get_parameters` **可配置** ([#1242](https://github.com/adap/flower/pull/1242))

source: The `get_parameters` method now accepts a configuration dictionary, just like `get_properties`, `fit`, and `evaluate`.
fr: La méthode `get_parameters` accepte maintenant un dictionnaire de configuration, tout comme `get_properties`, `fit`, et `evaluate`.
zh_hans: 现在，"get_parameters "方法与 "get_properties"、"fit "和 "evaluate "一样，都接受配置字典。

source: **Replace** `num_rounds` **in** `start_simulation` **with new** `config` **parameter** ([#1281](https://github.com/adap/flower/pull/1281))
fr: **Remplace** `num_rounds` **dans** `start_simulation` **avec le nouveau** `config` **paramètre** ([#1281](https://github.com/adap/flower/pull/1281))
zh_hans: **用新的** `config` 参数** 替换** `num_rounds` ** in** `start_simulation` ** ([#1281](https://github.com/adap/flower/pull/1281))

source: The `start_simulation` function now accepts a configuration dictionary `config` instead of the `num_rounds` integer. This improves the consistency between `start_simulation` and `start_server` and makes transitioning between the two easier.
fr: La fonction `start_simulation` accepte maintenant un dictionnaire de configuration `config` au lieu de l'entier `num_rounds`. Cela améliore la cohérence entre `start_simulation` et `start_server` et facilite la transition entre les deux.
zh_hans: 现在，`start_simulation`（开始模拟）` 函数接受配置字典 `config` 而不是 `num_rounds` 整数。这改进了 `start_simulation` 和 `start_server` 之间的一致性，并使两者之间的转换更容易。

source: **Support Python 3.10** ([#1320](https://github.com/adap/flower/pull/1320))
zh_hans: ** 支持 Python 3.10** ([#1320](https://github.com/adap/flower/pull/1320))

source: The previous Flower release introduced experimental support for Python 3.10, this release declares Python 3.10 support as stable.
fr: La version précédente de Flower a introduit la prise en charge expérimentale de Python 3.10, cette version déclare la prise en charge de Python 3.10 comme stable.
zh_hans: 上一个 Flower 版本引入了对 Python 3.10 的实验支持，而本版本则宣布对 Python 3.10 的支持为稳定支持。

source: **Make all** `Client` **and** `NumPyClient` **methods optional** ([#1260](https://github.com/adap/flower/pull/1260), [#1277](https://github.com/adap/flower/pull/1277))
fr: **Rendre toutes les **méthodes `Client` **et** `NumPyClient` **facultatives** ([#1260](https://github.com/adap/flower/pull/1260), [#1277](https://github.com/adap/flower/pull/1277))
zh_hans: **使所有** `Client` **和** `NumPyClient` **方法成为可选** ([#1260](https://github.com/adap/flower/pull/1260), [#1277](https://github.com/adap/flower/pull/1277))

source: The `Client`/`NumPyClient` methods `get_properties`, `get_parameters`, `fit`, and `evaluate` are all optional. This enables writing clients that implement, for example, only `fit`, but no other method. No need to implement `evaluate` when using centralized evaluation!
fr: Les méthodes `Client`/`NumPyClient` `get_properties`, `get_parameters`, `fit`, et `evaluate` sont toutes optionnelles. Cela permet d'écrire des clients qui n'implémentent, par exemple, que `fit`, mais aucune autre méthode. Pas besoin d'implémenter `evaluate` quand on utilise l'évaluation centralisée !
zh_hans: `Client`/`NumPyClient`的 "get_properties"、"get_parameters"、"fit "和 "evaluate "方法都是可选的。这样就可以编写只实现 `fit` 而不实现其他方法的客户端。使用集中评估时，无需实现 `evaluate`！

source: **Enable passing a** `Server` **instance to** `start_simulation` ([#1281](https://github.com/adap/flower/pull/1281))
fr: **Autoriser le passage d'une **instance `Server` à** `start_simulation` ([#1281](https://github.com/adap/flower/pull/1281))
zh_hans: **启用向** `start_simulation` 传递** `Server` 实例 ([#1281](https://github.com/adap/flower/pull/1281))

source: Similar to `start_server`, `start_simulation` now accepts a full `Server` instance. This enables users to heavily customize the execution of eperiments and opens the door to running, for example, async FL using the Virtual Client Engine.
fr: Comme pour `start_server`, `start_simulation` accepte maintenant une instance complète de `Server`. Cela permet aux utilisateurs de personnaliser fortement l'exécution des expériences et ouvre la porte à l'exécution, par exemple, de FL asynchrones à l'aide du moteur de client virtuel.
zh_hans: 与 `start_server` 类似，`start_simulation` 现在也接受一个完整的 `Server` 实例。这使得用户可以对实验的执行进行大量自定义，并为使用虚拟客户端引擎运行异步 FL 等打开了大门。

source: **Update code examples** ([#1291](https://github.com/adap/flower/pull/1291), [#1286](https://github.com/adap/flower/pull/1286), [#1282](https://github.com/adap/flower/pull/1282))
fr: **Mettre à jour les exemples de code** ([#1291](https://github.com/adap/flower/pull/1291), [#1286](https://github.com/adap/flower/pull/1286), [#1282](https://github.com/adap/flower/pull/1282))
zh_hans: **更新代码示例** ([#1291](https://github.com/adap/flower/pull/1291), [#1286](https://github.com/adap/flower/pull/1286), [#1282](https://github.com/adap/flower/pull/1282))

source: Many code examples received small or even large maintenance updates, among them are
fr: De nombreux exemples de code ont reçu de petites ou même de grandes mises à jour de maintenance
zh_hans: 许多代码示例都进行了小规模甚至大规模的维护更新，其中包括

source: **Remove the obsolete simulation example** ([#1328](https://github.com/adap/flower/pull/1328))
fr: **Supprime l'exemple de simulation obsolète** ([#1328](https://github.com/adap/flower/pull/1328))
zh_hans: **删除过时的模拟示例** ([#1328](https://github.com/adap/flower/pull/1328))

source: Removes the obsolete `simulation` example and renames `quickstart_simulation` to `simulation_tensorflow` so it fits withs the naming of `simulation_pytorch`
fr: Supprime l'exemple obsolète `simulation` et renomme `quickstart_simulation` en `simulation_tensorflow` pour qu'il corresponde au nom de `simulation_pytorch`
zh_hans: 删除过时的 "simulation "示例，并将 "quickstart_simulation "重命名为 "simulation_tensorflow"，使其与 "simulation_pytorch "的命名一致

source: **Update documentation** ([#1223](https://github.com/adap/flower/pull/1223), [#1209](https://github.com/adap/flower/pull/1209), [#1251](https://github.com/adap/flower/pull/1251), [#1257](https://github.com/adap/flower/pull/1257), [#1267](https://github.com/adap/flower/pull/1267), [#1268](https://github.com/adap/flower/pull/1268), [#1300](https://github.com/adap/flower/pull/1300), [#1304](https://github.com/adap/flower/pull/1304), [#1305](https://github.com/adap/flower/pull/1305), [#1307](https://github.com/adap/flower/pull/1307))
fr: **Mise à jour de la documentation** ([#1223](https://github.com/adap/flower/pull/1223), [#1209](https://github.com/adap/flower/pull/1209), [#1251](https://github.com/adap/flower/pull/1251), [#1257](https://github.com/adap/flower/pull/1257), [#1267](https://github.com/adap/flower/pull/1267), [#1268](https://github.com/adap/flower/pull/1268), [#1300](https://github.com/adap/flower/pull/1300), [#1304](https://github.com/adap/flower/pull/1304), [#1305](https://github.com/adap/flower/pull/1305), [#1307](https://github.com/adap/flower/pull/1307))
zh_hans: **更新文档** ([#1223](https://github.com/adap/flower/pull/1223), [#1209](https://github.com/adap/flower/pull/1209), [#1251](https://github.com/adap/flower/pull/1251), [#1257](https://github.com/adap/flower/pull/1257), [#1267](https://github.com/adap/flower/pull/1267), [#1268](https://github.com/adap/flower/pull/1268), [#1300](https://github.com/adap/flower/pull/1300), [#1304](https://github.com/adap/flower/pull/1304), [#1305](https://github.com/adap/flower/pull/1305), [#1307](https://github.com/adap/flower/pull/1307))

source: One substantial documentation update fixes multiple smaller rendering issues, makes titles more succinct to improve navigation, removes a deprecated library, updates documentation dependencies, includes the `flwr.common` module in the API reference, includes support for markdown-based documentation, migrates the changelog from `.rst` to `.md`, and fixes a number of smaller details!
fr: Une mise à jour substantielle de la documentation corrige plusieurs petits problèmes de rendu, rend les titres plus succincts pour améliorer la navigation, supprime une bibliothèque obsolète, met à jour les dépendances de la documentation, inclut le module `flwr.common` dans la référence de l'API, inclut le support de la documentation basée sur le markdown, migre le changelog de `.rst` vers `.md`, et corrige un certain nombre de détails plus petits !
zh_hans: 其中一个实质性的文档更新修复了多个较小的渲染问题，使标题更加简洁以改善导航，删除了一个已废弃的库，更新了文档依赖关系，在 API 参考中包含了 `flwr.common` 模块，包含了对基于 markdown 的文档的支持，将更新日志从 `.rst` 移植到了 `.md`，并修复了一些较小的细节！

source: **Minor updates**
fr: **Mises à jour mineures**
zh_hans: **小规模更新**

source: Add round number to fit and evaluate log messages ([#1266](https://github.com/adap/flower/pull/1266))
fr: Ajoute un chiffre rond pour ajuster et évaluer les messages du journal ([#1266](https://github.com/adap/flower/pull/1266))
zh_hans: 添加四舍五入数字，以适应和评估日志信息（[#1266](https://github.com/adap/flower/pull/1266)）

source: Add secure gRPC connection to the `advanced_tensorflow` code example ([#847](https://github.com/adap/flower/pull/847))
fr: Ajouter une connexion gRPC sécurisée à l'exemple de code `advanced_tensorflow` ([#847](https://github.com/adap/flower/pull/847))
zh_hans: 为 `advanced_tensorflow` 代码示例添加安全 gRPC 连接 ([#847](https://github.com/adap/flower/pull/847))

source: Update developer tooling ([#1231](https://github.com/adap/flower/pull/1231), [#1276](https://github.com/adap/flower/pull/1276), [#1301](https://github.com/adap/flower/pull/1301), [#1310](https://github.com/adap/flower/pull/1310))
fr: Mettre à jour les outils de développement ([#1231](https://github.com/adap/flower/pull/1231), [#1276](https://github.com/adap/flower/pull/1276), [#1301](https://github.com/adap/flower/pull/1301), [#1310](https://github.com/adap/flower/pull/1310))
zh_hans: 更新开发人员工具（[#1231](https://github.com/adap/flower/pull/1231), [#1276](https://github.com/adap/flower/pull/1276), [#1301](https://github.com/adap/flower/pull/1301), [#1310](https://github.com/adap/flower/pull/1310)

source: Rename ProtoBuf messages to improve consistency ([#1214](https://github.com/adap/flower/pull/1214), [#1258](https://github.com/adap/flower/pull/1258), [#1259](https://github.com/adap/flower/pull/1259))
fr: Renomme les messages ProtoBuf pour améliorer la cohérence ([#1214](https://github.com/adap/flower/pull/1214), [#1258](https://github.com/adap/flower/pull/1258), [#1259](https://github.com/adap/flower/pull/1259))
zh_hans: 重命名 ProtoBuf 消息以提高一致性（[#1214](https://github.com/adap/flower/pull/1214), [#1258](https://github.com/adap/flower/pull/1258), [#1259](https://github.com/adap/flower/pull/1259)

source: **Flower Baselines (preview): FedOpt, FedBN, FedAvgM** ([#919](https://github.com/adap/flower/pull/919), [#1127](https://github.com/adap/flower/pull/1127), [#914](https://github.com/adap/flower/pull/914))
zh_hans: **Flower Baselines（预览）： FedOpt、FedBN、FedAvgM** ([#919](https://github.com/adap/flower/pull/919), [#1127](https://github.com/adap/flower/pull/1127), [#914](https://github.com/adap/flower/pull/914))

source: The first preview release of Flower Baselines has arrived! We're kickstarting Flower Baselines with implementations of FedOpt (FedYogi, FedAdam, FedAdagrad), FedBN, and FedAvgM. Check the documentation on how to use [Flower Baselines](https://flower.dev/docs/using-baselines.html). With this first preview release we're also inviting the community to [contribute their own baselines](https://flower.dev/docs/contributing-baselines.html).
fr: La première version préliminaire de Flower Baselines est arrivée ! Nous démarrons Flower Baselines avec des implémentations de FedOpt (FedYogi, FedAdam, FedAdagrad), FedBN, et FedAvgM. Consultez la documentation sur l'utilisation de [Flower Baselines](https://flower.dev/docs/using-baselines.html). Avec cette première version préliminaire, nous invitons également la communauté à [contribuer à leurs propres lignes de base](https://flower.dev/docs/contributing-baselines.html).
zh_hans: Flower Baselines 的第一个预览版已经发布！我们通过实现 FedOpt（FedYogi、FedAdam、FedAdagrad）、FedBN 和 FedAvgM 来启动 Flower Baselines。请查阅文档了解如何使用 [Flower Baselines](https://flower.dev/docs/using-baselines.html)。在首次发布预览版时，我们还邀请社区成员[贡献自己的Baselines](https://flower.dev/docs/contributing-baselines.html)。

source: **C++ client SDK (preview) and code example** ([#1111](https://github.com/adap/flower/pull/1111))
fr: **SDK client C++ (aperçu) et exemple de code** ([#1111](https://github.com/adap/flower/pull/1111))
zh_hans: **C++客户端SDK（预览版）和代码示例**（[#1111](https://github.com/adap/flower/pull/1111)）

source: Preview support for Flower clients written in C++. The C++ preview includes a Flower client SDK and a quickstart code example that demonstrates a simple C++ client using the SDK.
fr: L'aperçu C++ comprend un SDK pour les clients Flower et un exemple de code de démarrage rapide qui démontre un client C++ simple utilisant le SDK.
zh_hans: 预览版支持用 C++ 编写的 Flower 客户端。C++ 预览版包括一个 Flower 客户端 SDK 和一个快速入门代码示例，使用 SDK 演示了一个简单的 C++ 客户端。

source: **Add experimental support for Python 3.10 and Python 3.11** ([#1135](https://github.com/adap/flower/pull/1135))
fr: **Ajouter la prise en charge expérimentale de Python 3.10 et Python 3.11** ([#1135](https://github.com/adap/flower/pull/1135))
zh_hans: ** 增加对 Python 3.10 和 Python 3.11 的实验支持** ([#1135](https://github.com/adap/flower/pull/1135))

source: Python 3.10 is the latest stable release of Python and Python 3.11 is due to be released in October. This Flower release adds experimental support for both Python versions.
fr: Python 3.10 est la dernière version stable de Python et Python 3.11 devrait sortir en octobre. Cette version de Flower ajoute une prise en charge expérimentale pour les deux versions de Python.
zh_hans: Python 3.10 是 Python 的最新稳定版本，Python 3.11 将于 10 月份发布。Flower 版本增加了对这两个 Python 版本的实验支持。

source: **Aggregate custom metrics through user-provided functions** ([#1144](https://github.com/adap/flower/pull/1144))
fr: **Agréger des mesures personnalisées grâce à des fonctions fournies par l'utilisateur** ([#1144](https://github.com/adap/flower/pull/1144))
zh_hans: **通过用户提供的函数聚合自定义指标**（[#1144](https://github.com/adap/flower/pull/1144)）

source: Custom metrics (e.g., `accuracy`) can now be aggregated without having to customize the strategy. Built-in strategies support two new arguments, `fit_metrics_aggregation_fn` and `evaluate_metrics_aggregation_fn`, that allow passing custom metric aggregation functions.
fr: Les stratégies intégrées prennent en charge deux nouveaux arguments, `fit_metrics_aggregation_fn` et `evaluate_metrics_aggregation_fn`, qui permettent de passer des fonctions d'agrégation de métriques personnalisées.
zh_hans: 现在无需定制策略即可聚合自定义度量（如`准确度`）。内置策略支持两个新参数：`fit_metrics_aggregation_fn` 和`evaluate_metrics_aggregation_fn`，允许传递自定义度量聚合函数。

source: **User-configurable round timeout** ([#1162](https://github.com/adap/flower/pull/1162))
fr: **Temps d'attente configurable par l'utilisateur** ([#1162](https://github.com/adap/flower/pull/1162))
zh_hans: **用户可配置的回合超时**（[#1162](https://github.com/adap/flower/pull/1162)）

source: A new configuration value allows the round timeout to be set for `start_server` and `start_simulation`. If the `config` dictionary contains a `round_timeout` key (with a `float` value in seconds), the server will wait *at least* `round_timeout` seconds before it closes the connection.
fr: Si le dictionnaire `config` contient une clé `round_timeout` (avec une valeur `float` en secondes), le serveur attendra *au moins* `round_timeout` secondes avant de fermer la connexion.
zh_hans: 新的配置值允许为 `start_server` 和 `start_simulation` 设置回合超时。如果 `config` 字典中包含一个 `round_timeout` 键（以秒为单位的 `float`值），服务器将至少等待 ** `round_timeout` 秒后才关闭连接。

source: **Enable both federated evaluation and centralized evaluation to be used at the same time in all built-in strategies** ([#1091](https://github.com/adap/flower/pull/1091))
fr: **Permettre l'utilisation simultanée de l'évaluation fédérée et de l'évaluation centralisée dans toutes les stratégies intégrées** ([#1091](https://github.com/adap/flower/pull/1091))
zh_hans: **允许在所有内置策略中同时使用联邦评价和集中评估** ([#1091](https://github.com/adap/flower/pull/1091))

source: Built-in strategies can now perform both federated evaluation (i.e., client-side) and centralized evaluation (i.e., server-side) in the same round. Federated evaluation can be disabled by setting `fraction_eval` to `0.0`.
fr: Les stratégies intégrées peuvent maintenant effectuer une évaluation fédérée (c'est-à-dire côté client) et une évaluation centralisée (c'est-à-dire côté serveur) dans le même tour. L'évaluation fédérée peut être désactivée en réglant `fraction_eval` sur `0.0`.
zh_hans: 内置策略现在可以在同一轮中同时执行联邦评估（即客户端）和集中评估（即服务器端）。可以通过将 `fraction_eval` 设置为 `0.0`来禁用联邦评估。

source: **Two new Jupyter Notebook tutorials** ([#1141](https://github.com/adap/flower/pull/1141))
fr: **Deux nouveaux tutoriels Jupyter Notebook** ([#1141](https://github.com/adap/flower/pull/1141))
zh_hans: **两本新的 Jupyter Notebook 教程** ([#1141](https://github.com/adap/flower/pull/1141))

source: Two Jupyter Notebook tutorials (compatible with Google Colab) explain basic and intermediate Flower features:
fr: Deux tutoriels Jupyter Notebook (compatibles avec Google Colab) expliquent les fonctionnalités de base et intermédiaires de Flower :
zh_hans: 两本 Jupyter Notebook 教程（与 Google Colab 兼容）介绍了 Flower 的基本和中级功能：

source: *An Introduction to Federated Learning*: [Open in Colab](https://colab.research.google.com/github/adap/flower/blob/main/tutorials/Flower-1-Intro-to-FL-PyTorch.ipynb)
fr: *Introduction à l'apprentissage fédéré* : [Open in Colab](https://colab.research.google.com/github/adap/flower/blob/main/tutorials/Flower-1-Intro-to-FL-PyTorch.ipynb)
zh_hans: *联邦学习简介*： [在 Colab 中打开](https://colab.research.google.com/github/adap/flower/blob/main/tutorials/Flower-1-Intro-to-FL-PyTorch.ipynb)

source: *Using Strategies in Federated Learning*: [Open in Colab](https://colab.research.google.com/github/adap/flower/blob/main/tutorials/Flower-2-Strategies-in-FL-PyTorch.ipynb)
fr: *Utiliser des stratégies dans l'apprentissage fédéré* : [Open in Colab](https://colab.research.google.com/github/adap/flower/blob/main/tutorials/Flower-2-Strategies-in-FL-PyTorch.ipynb)
zh_hans: *在联邦学习中使用策略*： [在 Colab 中打开](https://colab.research.google.com/github/adap/flower/blob/main/tutorials/Flower-2-Strategies-in-FL-PyTorch.ipynb)

source: **New FedAvgM strategy (Federated Averaging with Server Momentum)** ([#1076](https://github.com/adap/flower/pull/1076))
fr: **Nouvelle stratégie FedAvgM (Federated Averaging with Server Momentum)** ([#1076](https://github.com/adap/flower/pull/1076))
zh_hans: **新的 FedAvgM 策略（带服务器动量的联邦平均）** ([#1076](https://github.com/adap/flower/pull/1076))

source: The new `FedAvgM` strategy implements Federated Averaging with Server Momentum \[Hsu et al., 2019\].
zh_hans: 新的 "FedAvgM "策略实现了带服务器动量的联邦平均[Hsu et al., 2019\].

source: **New advanced PyTorch code example** ([#1007](https://github.com/adap/flower/pull/1007))
fr: **Nouvel exemple de code PyTorch avancé** ([#1007](https://github.com/adap/flower/pull/1007))
zh_hans: **新的 PyTorch 高级代码示例** ([#1007](https://github.com/adap/flower/pull/1007))

source: A new code example (`advanced_pytorch`) demonstrates advanced Flower concepts with PyTorch.
fr: Un nouvel exemple de code (`advanced_pytorch`) démontre des concepts de fleur avancés avec PyTorch.
zh_hans: 新代码示例 (`advanced_pytorch`) 演示了 PyTorch 的高级 Flower 概念。

source: **New JAX code example** ([#906](https://github.com/adap/flower/pull/906), [#1143](https://github.com/adap/flower/pull/1143))
fr: **Nouvel exemple de code JAX** ([#906](https://github.com/adap/flower/pull/906), [#1143](https://github.com/adap/flower/pull/1143))
zh_hans: **新的 JAX 代码示例**（[#906](https://github.com/adap/flower/pull/906), [#1143](https://github.com/adap/flower/pull/1143)

source: A new code example (`jax_from_centralized_to_federated`) shows federated learning with JAX and Flower.
fr: Un nouvel exemple de code (`jax_from_centralized_to_federated`) montre l'apprentissage fédéré avec JAX et Flower.
zh_hans: 新代码示例（`jax_from_centralized_to_federated`）展示了使用 JAX 和 Flower 的联邦学习。

source: New option to keep Ray running if Ray was already initialized in `start_simulation` ([#1177](https://github.com/adap/flower/pull/1177))
fr: Nouvelle option pour continuer à faire fonctionner Ray si Ray a déjà été initialisé dans `start_simulation` ([#1177](https://github.com/adap/flower/pull/1177))
zh_hans: 新增选项，用于在 "start_simulation"（开始模拟）中已初始化 Ray 的情况下保持 Ray 运行（[#1177](https://github.com/adap/flower/pull/1177)）

source: Add support for custom `ClientManager` as a `start_simulation` parameter ([#1171](https://github.com/adap/flower/pull/1171))
fr: Ajout de la prise en charge d'un `ClientManager` personnalisé comme paramètre de `start_simulation` ([#1171](https://github.com/adap/flower/pull/1171))
zh_hans: 添加对自定义 "客户端管理器 "作为 "start_simulation "参数的支持（[#1171](https://github.com/adap/flower/pull/1171)）

source: New documentation for [implementing strategies](https://flower.dev/docs/framework/how-to-implement-strategies.html) ([#1097](https://github.com/adap/flower/pull/1097), [#1175](https://github.com/adap/flower/pull/1175))
zh_hans: [实施战略](https://flower.dev/docs/framework/how-to-implement-strategies.html) 的新文件（[#1097](https://github.com/adap/flower/pull/1097), [#1175](https://github.com/adap/flower/pull/1175)

source: New mobile-friendly documentation theme ([#1174](https://github.com/adap/flower/pull/1174))
fr: Nouveau thème de documentation adapté aux mobiles ([#1174](https://github.com/adap/flower/pull/1174))
zh_hans: 新的移动友好型文档主题 ([#1174](https://github.com/adap/flower/pull/1174))

source: Limit version range for (optional) `ray` dependency to include only compatible releases (`>=1.9.2,<1.12.0`) ([#1205](https://github.com/adap/flower/pull/1205))
fr: Limite la plage de versions pour la dépendance (optionnelle) `ray` pour n'inclure que les versions compatibles (`>=1.9.2,<1.12.0`) ([#1205](https://github.com/adap/flower/pull/1205))
zh_hans: 限制（可选）`ray`依赖的版本范围，使其仅包含兼容版本（`>=1.9.2,<1.12.0`） ([#1205](https://github.com/adap/flower/pull/1205))

source: **Remove deprecated support for Python 3.6** ([#871](https://github.com/adap/flower/pull/871))
fr: **Supprime la prise en charge obsolète de Python 3.6** ([#871](https://github.com/adap/flower/pull/871))
zh_hans: **删除对 Python 3.6 的过时支持** ([#871](https://github.com/adap/flower/pull/871))

source: **Remove deprecated KerasClient** ([#857](https://github.com/adap/flower/pull/857))
fr: **Supprimez KerasClient** ([#857](https://github.com/adap/flower/pull/857))
zh_hans: **移除过时的 KerasClient**（[#857](https://github.com/adap/flower/pull/857)）

source: **Remove deprecated no-op extra installs** ([#973](https://github.com/adap/flower/pull/973))
fr: **Supprimer les installations supplémentaires no-op dépréciées** ([#973](https://github.com/adap/flower/pull/973))
zh_hans: **移除过时的不操作额外安装** ([#973](https://github.com/adap/flower/pull/973))

source: **Remove deprecated proto fields from** `FitRes` **and** `EvaluateRes` ([#869](https://github.com/adap/flower/pull/869))
fr: **Supprimez les champs proto obsolètes de** `FitRes` **et** `EvaluateRes` ([#869](https://github.com/adap/flower/pull/869))
zh_hans: **从** `FitRes` **和** `EvaluateRes` 中移除已废弃的 proto 字段 ([#869](https://github.com/adap/flower/pull/869))

source: **Remove deprecated QffedAvg strategy (replaced by QFedAvg)** ([#1107](https://github.com/adap/flower/pull/1107))
fr: **Supprime la stratégie QffedAvg (remplacée par QFedAvg)** ([#1107](https://github.com/adap/flower/pull/1107))
zh_hans: **移除过时的 QffedAvg 策略（由 QFedAvg 取代）** ([#1107](https://github.com/adap/flower/pull/1107))
