Repository: lucacorbucci/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: fr, zh_hans

source: The Flower tutorial now has a new section that covers custom serialization: [Open in Colab](https://colab.research.google.com/github/adap/flower/blob/main/doc/source/tutorial-customize-the-client-pytorch.ipynb)
zh_hans: Flower 教程现在新增了一个章节，介绍自定义序列化： [在 Colab 中打开](https://colab.research.google.com/github/adap/flower/blob/main/doc/source/tutorial-customize-the-client-pytorch.ipynb)

source: **General improvements** ([#1638](https://github.com/adap/flower/pull/1638), [#1634](https://github.com/adap/flower/pull/1634), [#1636](https://github.com/adap/flower/pull/1636), [#1635](https://github.com/adap/flower/pull/1635), [#1633](https://github.com/adap/flower/pull/1633), [#1632](https://github.com/adap/flower/pull/1632), [#1631](https://github.com/adap/flower/pull/1631), [#1630](https://github.com/adap/flower/pull/1630), [#1627](https://github.com/adap/flower/pull/1627), [#1593](https://github.com/adap/flower/pull/1593), [#1616](https://github.com/adap/flower/pull/1616), [#1615](https://github.com/adap/flower/pull/1615), [#1607](https://github.com/adap/flower/pull/1607), [#1609](https://github.com/adap/flower/pull/1609), [#1608](https://github.com/adap/flower/pull/1608), [#1603](https://github.com/adap/flower/pull/1603), [#1590](https://github.com/adap/flower/pull/1590), [#1580](https://github.com/adap/flower/pull/1580), [#1599](https://github.com/adap/flower/pull/1599), [#1600](https://github.com/adap/flower/pull/1600), [#1601](https://github.com/adap/flower/pull/1601), [#1597](https://github.com/adap/flower/pull/1597), [#1595](https://github.com/adap/flower/pull/1595), [#1591](https://github.com/adap/flower/pull/1591), [#1588](https://github.com/adap/flower/pull/1588), [#1589](https://github.com/adap/flower/pull/1589), [#1587](https://github.com/adap/flower/pull/1587), [#1573](https://github.com/adap/flower/pull/1573), [#1581](https://github.com/adap/flower/pull/1581), [#1578](https://github.com/adap/flower/pull/1578), [#1574](https://github.com/adap/flower/pull/1574), [#1572](https://github.com/adap/flower/pull/1572), [#1586](https://github.com/adap/flower/pull/1586))
fr: **General improvements** ([#1638](https://github.com/adap/flower/pull/1638), [#1634](https://github.com/adap/flower/pull/1634), [#1636](https://github.com/adap/flower/pull/1636), [#1635](https://github.com/adap/flower/pull/1635), [#1633](https://github.com/adap/flower/pull/1633), [#1632](https://github.com/adap/flower/pull/1632), [#1631](https://github.com/adap/flower/pull/1631), [#1630](https://github.com/adap/flower/pull/1630), [#1627](https://github.com/adap/flower/pull/1627), [#1593](https://github.com/adap/flower/pull/1593), [#1616](https://github.com/adap/flower/pull/1616), [#1615](https://github.com/adap/flower/pull/1615), [#1607](https://github.com/adap/flower/pull/1607), [#1609](https://github.com/adap/flower/pull/1609), [#1608](https://github.com/adap/flower/pull/1608), [#1603](https://github.com/adap/flower/pull/1603), [#1590](https://github.com/adap/flower/pull/1590), [#1580](https://github.com/adap/flower/pull/1580), [#1599](https://github.com/adap/flower/pull/1599), [#1600](https://github.com/ada
zh_hans: **普通改进** ([#1638](https://github.com/adap/flower/pull/1638), [#1634](https://github.com/adap/flower/pull/1634), [#1636](https://github.com/adap/flower/pull/1636), [#1635](https://github.com/adap/flower/pull/1635), [#1633](https://github.com/adap/flower/pull/1633), [#1632](https://github.com/adap/flower/pull/1632), [#1631](https://github.com/adap/flower/pull/1631), [#1630](https://github.com/adap/flower/pull/1630), [#1627](https://github. com/adap/flower/pull/1627), [#1593](https://github.com/adap/flower/pull/1593), [#1616](https://github.com/adap/flower/pull/1616), [#1615](https://github.com/adap/flower/pull/1615), [#1607](https://github.com/adap/flower/pull/1607), [#1609](https://github.com/adap/flower/pull/1609), [#1608](https://github.com/adap/flower/pull/1608), [#1603](https://github.com/adap/flower/pull/1603), [#1590](https://github. com/adap/flower/pull/1590), [#1580](https://github.com/adap/flower/pull/1580), [#1599](https://github.com/adap/flower/pull/1599), [#1600](https://github.com/adap/flower/pull/1600), [#1601](https://github.com/adap/flower/pull/1601), [#1597](https://github.com/adap/flower/pull/1597), [#1595](https://github.com/adap/flower/pull/1595), [#1591](https://github.com/adap/flower/pull/1591), [#1588](https://github. com/adap/flower/pull/1588), [#1589](https://github.com/adap/flower/pull/1589), [#1587](https://github.com/adap/flower/pull/1587), [#1573](https://github.com/adap/flower/pull/1573), [#1581](https://github.com/adap/flower/pull/1581), [#1578](https://github.com/adap/flower/pull/1578), [#1574](https://github.com/adap/flower/pull/1574), [#1572](https://github.com/adap/flower/pull/1572), [#1586](https://github.com/adap/flower/pull/1586))

source: **Updated documentation** ([#1629](https://github.com/adap/flower/pull/1629), [#1628](https://github.com/adap/flower/pull/1628), [#1620](https://github.com/adap/flower/pull/1620), [#1618](https://github.com/adap/flower/pull/1618), [#1617](https://github.com/adap/flower/pull/1617), [#1613](https://github.com/adap/flower/pull/1613), [#1614](https://github.com/adap/flower/pull/1614))
fr: **Mise à jour de la documentation** ([#1629](https://github.com/adap/flower/pull/1629), [#1628](https://github.com/adap/flower/pull/1628), [#1620](https://github.com/adap/flower/pull/1620), [#1618](https://github.com/adap/flower/pull/1618), [#1617](https://github.com/adap/flower/pull/1617), [#1613](https://github.com/adap/flower/pull/1613), [#1614](https://github.com/adap/flower/pull/1614))
zh_hans: ** 更新文档** ([#1629](https://github.com/adap/flower/pull/1629), [#1628](https://github.com/adap/flower/pull/1628), [#1620](https://github.com/adap/flower/pull/1620), [#1618](https://github.com/adap/flower/pull/1618), [#1617](https://github.com/adap/flower/pull/1617), [#1613](https://github.com/adap/flower/pull/1613), [#1614](https://github.com/adap/flower/pull/1614)))

source: As usual, the documentation has improved quite a bit. It is another step in our effort to make the Flower documentation the best documentation of any project. Stay tuned and as always, feel free to provide feedback!
fr: Comme d'habitude, la documentation s'est beaucoup améliorée. C'est une autre étape dans notre effort pour faire de la documentation de Flower la meilleure documentation de tout projet. Reste à l'écoute et comme toujours, n'hésite pas à nous faire part de tes commentaires !
zh_hans: 和往常一样，我们的文档有了很大的改进。这是我们努力使 Flower 文档成为所有项目中最好文档的又一步骤。请继续关注，并随时提供反馈意见！

source: **Introduce new Flower Baseline: FedAvg MNIST** ([#1497](https://github.com/adap/flower/pull/1497), [#1552](https://github.com/adap/flower/pull/1552))
fr: **Introduire une nouvelle fleur Référence : FedAvg MNIST** ([#1497](https://github.com/adap/flower/pull/1497), [#1552](https://github.com/adap/flower/pull/1552))
zh_hans: **引入新的 Flower Baseline： FedAvg MNIST** ([#1497](https://github.com/adap/flower/pull/1497), [#1552](https://github.com/adap/flower/pull/1552))

source: Over the coming weeks, we will be releasing a number of new reference implementations useful especially to FL newcomers. They will typically revisit well known papers from the literature, and be suitable for integration in your own application or for experimentation, in order to deepen your knowledge of FL in general. Today's release is the first in this series. [Read more.](https://flower.dev/blog/2023-01-12-fl-starter-pack-fedavg-mnist-cnn/)
fr: Au cours des prochaines semaines, nous publierons un certain nombre de nouvelles implémentations de référence utiles en particulier pour les nouveaux venus en FL. Elles revisiteront généralement des articles bien connus de la littérature, et seront adaptées à l'intégration dans votre propre application ou à l'expérimentation, afin d'approfondir votre connaissance de FL en général. La publication d'aujourd'hui est la première de cette série. [Lire la suite.](https://flower.dev/blog/2023-01-12-fl-starter-pack-fedavg-mnist-cnn/)
zh_hans: 在未来几周内，我们将发布一些新的参考，特别是对 FL 新手有用的方法。它们通常会重温文献中的知名论文，适合集成到您自己的应用程序中或用于实验，以加深您对 FL 的总体了解。今天发布的是该系列中的第一篇。[阅读全文](https://flower.dev/blog/2023-01-12-fl-starter-pack-fedavg-mnist-cnn/)

source: **Improve GPU support in simulations** ([#1555](https://github.com/adap/flower/pull/1555))
fr: **Améliorer la prise en charge des GPU dans les simulations** ([#1555](https://github.com/adap/flower/pull/1555))
zh_hans: **改进模拟中的 GPU 支持**（[#1555](https://github.com/adap/flower/pull/1555)）

source: The Ray-based Virtual Client Engine (`start_simulation`) has been updated to improve GPU support. The update includes some of the hard-earned lessons from scaling simulations in GPU cluster environments. New defaults make running GPU-based simulations substantially more robust.
fr: Le moteur client virtuel basé sur Ray (`start_simulation`) a été mis à jour pour améliorer la prise en charge des GPU. La mise à jour inclut certaines des leçons durement apprises lors de la mise à l'échelle des simulations dans des environnements de grappes de GPU. De nouveaux paramètres par défaut rendent l'exécution des simulations basées sur les GPU beaucoup plus robuste.
zh_hans: 基于 Ray 的虚拟客户端引擎 (`start_simulation`)已更新，以改进对 GPU 的支持。此次更新包含了在 GPU 集群环境中扩展模拟的一些经验教训。新的默认设置使基于 GPU 的模拟运行更加稳健。

source: **Improve GPU support in Jupyter Notebook tutorials** ([#1527](https://github.com/adap/flower/pull/1527), [#1558](https://github.com/adap/flower/pull/1558))
fr: **Améliorer la prise en charge du GPU dans les tutoriels Jupyter Notebook** ([#1527](https://github.com/adap/flower/pull/1527), [#1558](https://github.com/adap/flower/pull/1558))
zh_hans: **改进 Jupyter Notebook 教程中的 GPU 支持** ([#1527](https://github.com/adap/flower/pull/1527), [#1558](https://github.com/adap/flower/pull/1558))

source: Some users reported that Jupyter Notebooks have not always been easy to use on GPU instances. We listened and made improvements to all of our Jupyter notebooks! Check out the updated notebooks here:
fr: Certains utilisateurs ont signalé que les carnets Jupyter n'ont pas toujours été faciles à utiliser sur les instances GPU. Nous les avons écoutés et avons apporté des améliorations à tous nos carnets Jupyter ! Découvre les carnets mis à jour ici :
zh_hans: 一些用户报告说，在 GPU 实例上使用 Jupyter 笔记本并不是很方便。我们听取了他们的意见，并对所有 Jupyter 笔记本进行了改进！点击这里查看更新后的笔记本：

source: [An Introduction to Federated Learning](https://flower.dev/docs/framework/tutorial-get-started-with-flower-pytorch.html)
zh_hans: [联邦学习简介](https://flower.dev/docs/framework/tutorial-get-started-with-flower-pytorch.html)

source: [Strategies in Federated Learning](https://flower.dev/docs/framework/tutorial-use-a-federated-learning-strategy-pytorch.html)
zh_hans: [联邦学习策略](https://flower.dev/docs/framework/tutorial-use-a-federated-learning-strategy-pytorch.html)

source: [Building a Strategy](https://flower.dev/docs/framework/tutorial-build-a-strategy-from-scratch-pytorch.html)
zh_hans: [制定策略](https://flower.dev/docs/framework/tutorial-build-a-strategy-from-scratch-pytorch.html)

source: [Client and NumPyClient](https://flower.dev/docs/framework/tutorial-customize-the-client-pytorch.html)
zh_hans: [客户端和 NumPyClient](https://flower.dev/docs/framework/tutorial-customize-the-client-pytorch.html)

source: **Introduce optional telemetry** ([#1533](https://github.com/adap/flower/pull/1533), [#1544](https://github.com/adap/flower/pull/1544), [#1584](https://github.com/adap/flower/pull/1584))
fr: **Introduire la télémétrie optionnelle** ([#1533](https://github.com/adap/flower/pull/1533), [#1544](https://github.com/adap/flower/pull/1544), [#1584](https://github.com/adap/flower/pull/1584))
zh_hans: **引入可选遥测**（[#1533](https://github.com/adap/flower/pull/1533), [#1544](https://github.com/adap/flower/pull/1544), [#1584](https://github.com/adap/flower/pull/1584)

source: After a [request for feedback](https://github.com/adap/flower/issues/1534) from the community, the Flower open-source project introduces optional collection of *anonymous* usage metrics to make well-informed decisions to improve Flower. Doing this enables the Flower team to understand how Flower is used and what challenges users might face.
fr: À la suite d'une [demande de commentaires] (https://github.com/adap/flower/issues/1534) de la part de la communauté, le projet open-source Flower introduit la collecte optionnelle de mesures d'utilisation *anonymes* afin de prendre des décisions éclairées pour améliorer Flower. Cela permet à l'équipe de Flower de comprendre comment Flower est utilisé et quels sont les défis auxquels les utilisateurs peuvent être confrontés.
zh_hans: 在社区发出[反馈请求](https://github.com/adap/flower/issues/1534)之后，Flower 开放源码项目引入了可选的*匿名*使用指标收集，以便在充分知情的情况下做出改进 Flower 的决定。这样做能让 Flower 团队了解 Flower 的使用情况以及用户可能面临的挑战。

source: **Flower is a friendly framework for collaborative AI and data science.** Staying true to this statement, Flower makes it easy to disable telemetry for users who do not want to share anonymous usage metrics. [Read more.](https://flower.dev/docs/telemetry.html).
zh_hans: **Flower 是一个用于协作式人工智能和数据科学的友好框架。** Flower 遵循这一声明，让不想分享匿名使用指标的用户可以轻松禁用遥测技术。[阅读全文](https://flower.dev/docs/telemetry.html)。

source: **Introduce (experimental) Driver API** ([#1520](https://github.com/adap/flower/pull/1520), [#1525](https://github.com/adap/flower/pull/1525), [#1545](https://github.com/adap/flower/pull/1545), [#1546](https://github.com/adap/flower/pull/1546), [#1550](https://github.com/adap/flower/pull/1550), [#1551](https://github.com/adap/flower/pull/1551), [#1567](https://github.com/adap/flower/pull/1567))
fr: **([#1520](https://github.com/adap/flower/pull/1520), [#1525](https://github.com/adap/flower/pull/1525), [#1545](https://github.com/adap/flower/pull/1545), [#1546](https://github.com/adap/flower/pull/1546), [#1550](https://github.com/adap/flower/pull/1550), [#1551](https://github.com/adap/flower/pull/1551), [#1567](https://github.com/adap/flower/pull/1567))
zh_hans: **引入（试验性）Driver API** ([#1520](https://github.com/adap/flower/pull/1520), [#1525](https://github.com/adap/flower/pull/1525), [#1545](https://github.com/adap/flower/pull/1545), [#1546](https://github.com/adap/flower/pull/1546), [#1550](https://github.com/adap/flower/pull/1550), [#1551](https://github.com/adap/flower/pull/1551), [#1567](https://github.com/adap/flower/pull/1567))

source: Flower now has a new (experimental) Driver API which will enable fully programmable, async, and multi-tenant Federated Learning and Federated Analytics applications. Phew, that's a lot! Going forward, the Driver API will be the abstraction that many upcoming features will be built on - and you can start building those things now, too.
fr: Flower dispose désormais d'une nouvelle API de pilote (expérimentale) qui permettra de créer des applications Federated Learning et Federated Analytics entièrement programmables, asynchrones et multi-tenant. Ouf, c'est beaucoup ! À l'avenir, l'API de pilote sera l'abstraction sur laquelle de nombreuses fonctionnalités à venir seront construites - et tu peux commencer à construire ces choses dès maintenant, aussi.
zh_hans: Flower 现在有了一个新的（试验性的）驱动程序应用程序接口（Driver API），它将支持完全可编程、异步和多租户的联邦学习（Federated Learning）和联邦分析（Federated Analytics）应用程序。展望未来，Driver API 将成为许多即将推出的功能的抽象基础，您现在就可以开始构建这些功能。

source: The Driver API also enables a new execution mode in which the server runs indefinitely. Multiple individual workloads can run concurrently and start and stop their execution independent of the server. This is especially useful for users who want to deploy Flower in production.
fr: L'API du pilote permet également un nouveau mode d'exécution dans lequel le serveur s'exécute indéfiniment. Plusieurs charges de travail individuelles peuvent s'exécuter simultanément et démarrer et arrêter leur exécution indépendamment du serveur. Ceci est particulièrement utile pour les utilisateurs qui souhaitent déployer Flower en production.
zh_hans: 驱动程序应用程序接口还支持一种新的执行模式，在这种模式下，服务器可无限期运行。多个单独的工作负载可以同时运行，并独立于服务器启动和停止执行。这对于希望在生产中部署 Flower 的用户来说尤其有用。

source: To learn more, check out the `mt-pytorch` code example. We look forward to you feedback!
fr: Pour en savoir plus, consulte l'exemple de code `mt-pytorch`. Nous attendons tes commentaires avec impatience !
zh_hans: 要了解更多信息，请查看 `mt-pytorch` 代码示例。我们期待您的反馈！

source: Please note: *The Driver API is still experimental and will likely change significantly over time.*
fr: Remarque : *L'API du pilote est encore expérimentale et est susceptible de changer de manière significative au fil du temps.*
zh_hans: 请注意：Driver API仍处于试验阶段，随着时间的推移可能会发生重大变化。*

source: **Add new Federated Analytics with Pandas example** ([#1469](https://github.com/adap/flower/pull/1469), [#1535](https://github.com/adap/flower/pull/1535))
fr: **Ajouter un nouvel exemple de Federated Analytics avec Pandas** ([#1469](https://github.com/adap/flower/pull/1469), [#1535](https://github.com/adap/flower/pull/1535))
zh_hans: ** 添加新的使用 Pandas 的联邦分析示例**（[#1469](https://github.com/adap/flower/pull/1469), [#1535](https://github.com/adap/flower/pull/1535)

source: A new code example (`quickstart_pandas`) demonstrates federated analytics with Pandas and Flower. You can find it here: [quickstart_pandas](https://github.com/adap/flower/tree/main/examples/quickstart_pandas).
fr: Un nouvel exemple de code (`quickstart_pandas`) démontre l'analyse fédérée avec Pandas et Flower. Tu peux le trouver ici : [quickstart_pandas](https://github.com/adap/flower/tree/main/examples/quickstart_pandas).
zh_hans: 新代码示例（`quickstart_pandas`）演示了使用 Pandas 和 Flower 进行联邦分析。您可以在此处找到它： [quickstart_pandas](https://github.com/adap/flower/tree/main/examples/quickstart_pandas)。

source: **Add new strategies: Krum and MultiKrum** ([#1481](https://github.com/adap/flower/pull/1481))
fr: **Ajouter de nouvelles stratégies : Krum et MultiKrum** ([#1481](https://github.com/adap/flower/pull/1481))
zh_hans: **添加新策略： Krum 和 MultiKrum** ([#1481](https://github.com/adap/flower/pull/1481))

source: Edoardo, a computer science student at the Sapienza University of Rome, contributed a new `Krum` strategy that enables users to easily use Krum and MultiKrum in their workloads.
fr: Edoardo, étudiant en informatique à l'Université Sapienza de Rome, a contribué à une nouvelle stratégie `Krum` qui permet aux utilisateurs d'utiliser facilement Krum et MultiKrum dans leurs charges de travail.
zh_hans: 罗马萨皮恩扎大学（Sapienza University）计算机科学专业的学生埃多尔多（Edoardo）提出了一种新的 "Krum "策略，使用户能够在其工作负载中轻松使用 Krum 和 MultiKrum。

source: **Update C++ example to be compatible with Flower v1.2.0** ([#1495](https://github.com/adap/flower/pull/1495))
fr: **Mettre à jour l'exemple C++ pour qu'il soit compatible avec Flower v1.2.0** ([#1495](https://github.com/adap/flower/pull/1495))
zh_hans: ** 更新 C++ 示例，与 Flower v1.2.0 兼容** ([#1495](https://github.com/adap/flower/pull/1495))

source: The C++ code example has received a substantial update to make it compatible with the latest version of Flower.
fr: L'exemple de code C++ a reçu une mise à jour substantielle pour le rendre compatible avec la dernière version de Flower.
zh_hans: 为了与最新版本的 Flower 兼容，C++ 示例代码进行了大幅更新。

source: **General improvements** ([#1491](https://github.com/adap/flower/pull/1491), [#1504](https://github.com/adap/flower/pull/1504), [#1506](https://github.com/adap/flower/pull/1506), [#1514](https://github.com/adap/flower/pull/1514), [#1522](https://github.com/adap/flower/pull/1522), [#1523](https://github.com/adap/flower/pull/1523), [#1526](https://github.com/adap/flower/pull/1526), [#1528](https://github.com/adap/flower/pull/1528), [#1547](https://github.com/adap/flower/pull/1547), [#1549](https://github.com/adap/flower/pull/1549), [#1560](https://github.com/adap/flower/pull/1560), [#1564](https://github.com/adap/flower/pull/1564), [#1566](https://github.com/adap/flower/pull/1566))
fr: **Améliorations générales** ([#1491](https://github.com/adap/flower/pull/1491), [#1504](https://github.com/adap/flower/pull/1504), [#1506](https://github.com/adap/flower/pull/1506), [#1514](https://github.com/adap/flower/pull/1514), [#1522](https://github.com/adap/flower/pull/1522), [#1523](https://github.com/adap/flower/pull/1523), [#1526](https://github.com/adap/flower/pull/1526), [#1528](https://github.com/adap/flower/pull/1528), [#1547](https://github.com/adap/flower/pull/1547), [#1549](https://github.com/adap/flower/pull/1549), [#1560](https://github.com/adap/flower/pull/1560), [#1564](https://github.com/adap/flower/pull/1564), [#1566](https://github.com/adap/flower/pull/1566))
zh_hans: **普通改进** ([#1491](https://github.com/adap/flower/pull/1491), [#1504](https://github.com/adap/flower/pull/1504), [#1506](https://github.com/adap/flower/pull/1506), [#1514](https://github.com/adap/flower/pull/1514), [#1522](https://github.com/adap/flower/pull/1522), [#1523](https://github.com/adap/flower/pull/1523), [#1526](https://github. com/adap/flower/pull/1526), [#1528](https://github.com/adap/flower/pull/1528), [#1547](https://github.com/adap/flower/pull/1547), [#1549](https://github.com/adap/flower/pull/1549), [#1560](https://github.com/adap/flower/pull/1560), [#1564](https://github.com/adap/flower/pull/1564), [#1566](https://github.com/adap/flower/pull/1566))

source: **Updated documentation** ([#1494](https://github.com/adap/flower/pull/1494), [#1496](https://github.com/adap/flower/pull/1496), [#1500](https://github.com/adap/flower/pull/1500), [#1503](https://github.com/adap/flower/pull/1503), [#1505](https://github.com/adap/flower/pull/1505), [#1524](https://github.com/adap/flower/pull/1524), [#1518](https://github.com/adap/flower/pull/1518), [#1519](https://github.com/adap/flower/pull/1519), [#1515](https://github.com/adap/flower/pull/1515))
fr: **Documentation mise à jour** ([#1494](https://github.com/adap/flower/pull/1494), [#1496](https://github.com/adap/flower/pull/1496), [#1500](https://github.com/adap/flower/pull/1500), [#1503](https://github.com/adap/flower/pull/1503), [#1505](https://github.com/adap/flower/pull/1505), [#1524](https://github.com/adap/flower/pull/1524), [#1518](https://github.com/adap/flower/pull/1518), [#1519](https://github.com/adap/flower/pull/1519), [#1515](https://github.com/adap/flower/pull/1515))
zh_hans: ** 更新文档** ([#1494](https://github.com/adap/flower/pull/1494), [#1496](https://github.com/adap/flower/pull/1496), [#1500](https://github.com/adap/flower/pull/1500), [#1503](https://github.com/adap/flower/pull/1503), [#1505](https://github.com/adap/flower/pull/1505), [#1524](https://github.com/adap/flower/pull/1524), [#1518](https://github.com/adap/flower/pull/1518), [#1519](https://github.com/adap/flower/pull/1519), [#1515](https://github.com/adap/flower/pull/1515))

source: One highlight is the new [first time contributor guide](https://flower.dev/docs/first-time-contributors.html): if you've never contributed on GitHub before, this is the perfect place to start!
fr: L'un des points forts est le nouveau [guide du premier contributeur] (https://flower.dev/docs/first-time-contributors.html) : si tu n'as jamais contribué sur GitHub auparavant, c'est l'endroit idéal pour commencer !
zh_hans: 其中一个亮点是新的[首次贡献者指南](https://flower.dev/docs/first-time-contributors.html)：如果你以前从未在 GitHub 上做过贡献，这将是一个完美的开始！

source: We would like to give our **special thanks** to all the contributors who made the new version of Flower possible (in `git shortlog` order):
fr: Nous aimerions **remercier tout particulièrement** tous les contributeurs qui ont rendu possible la nouvelle version de Flower (dans l'ordre `git shortlog`) :
zh_hans: 在此，我们向所有促成 Flower 新版本的贡献者致以**特别的谢意（按 "git shortlog "顺序排列）：
