Repository: lucacorbucci/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: fr, zh_hans

source: Flower Architecture
fr: Architecture florale
zh_hans: Flower的架构

source: Edge Client Engine
fr: Moteur client Edge
zh_hans: 边缘客户端引擎

source: `Flower <https://flower.dev>`_ core framework architecture with Edge Client Engine
fr: `Flower <https://flower.dev>`_ architecture de base avec Edge Client Engine
zh_hans: 具有边缘客户端引擎的`Flower <https://flower.dev>`核心架构

source: Virtual Client Engine
fr: Moteur de client virtuel
zh_hans: 虚拟客户端引擎

source: `Flower <https://flower.dev>`_ core framework architecture with Virtual Client Engine
fr: `Flower <https://flower.dev>`_ architecture de base avec moteur de client virtuel
zh_hans: 具有虚拟客户端引擎的`Flower <https://flower.dev>`核心架构

source: Virtual Client Engine and Edge Client Engine in the same workload
fr: Moteur client virtuel et moteur client Edge dans la même charge de travail
zh_hans: 可同步进行的虚拟客户端引擎和边缘客户端引擎

source: `Flower <https://flower.dev>`_ core framework architecture with both Virtual Client Engine and Edge Client Engine
fr: `Flower <https://flower.dev>`_ architecture de base avec un moteur de client virtuel et un moteur de client périphérique
zh_hans: 具有虚拟客户端引擎和边缘客户端引擎的`Flower <https://flower.dev>`核心架构

source: Creating New Messages
fr: Création de nouveaux messages
zh_hans: 创建新信息

source: This is a simple guide for creating a new type of message between the server and clients in Flower.
fr: Voici un guide simple pour créer un nouveau type de message entre le serveur et les clients dans Flower.
zh_hans: 这是一个如何用Flower在服务器和客户端之间创建新类型的信息的简要指导。

source: Let's suppose we have the following example functions in :code:`server.py` and :code:`numpy_client.py`...
fr: Supposons que nous ayons les fonctions suivantes dans :code:`server.py` et :code:`numpy_client.py`...
zh_hans: 假设我们在脚本code:`server.py`和code:`numpy_client.py`中有以下的示例函数...

source: Server's side:
fr: Côté serveur :
zh_hans: 在服务器端：

source: Client's side:
fr: Côté client :
zh_hans: 在客户端：

source: Let's now see what we need to implement in order to get this simple function between the server and client to work!
fr: Voyons maintenant ce que nous devons mettre en œuvre pour que cette simple fonction entre le serveur et le client fonctionne !
zh_hans: 现在让我们来看看，为了让服务器和客户端之间的这个简单的函数正常工作，我们需要实现哪些功能！

source: Message Types for Protocol Buffers
fr: Types de messages pour les tampons de protocole
zh_hans: 协议缓冲区的信息类型

source: The first thing we need to do is to define a message type for the RPC system in :code:`transport.proto`. Note that we have to do it for both the request and response messages. For more details on the syntax of proto3, please see the `official documentation <https://developers.google.com/protocol-buffers/docs/proto3>`_.
fr: La première chose à faire est de définir un type de message pour le système RPC dans :code:`transport.proto`. Notez que nous devons le faire à la fois pour les messages de demande et de réponse. Pour plus de détails sur la syntaxe de proto3, veuillez consulter la `documentation officielle <https://developers.google.com/protocol-buffers/docs/proto3>`_.
zh_hans: 我们需要做的第一件事是在脚本code:`transport.proto`中定义 RPC 系统的消息类型。请注意，我们必须对请求信息和响应信息都这样做。有关 proto3 语法的更多详情，请参阅官方文档 <https://developers.google.com/protocol-buffers/docs/proto3>`_。

source: Within the :code:`ServerMessage` block:
fr: Dans le bloc :code:`ServerMessage` :
zh_hans: 在 :code:`ServerMessage` 代码块中：

source: Within the ClientMessage block:
fr: Dans le bloc ClientMessage :
zh_hans: 在 ClientMessage 代码块中：

source: Make sure to also add a field of the newly created message type in :code:`oneof msg`.
fr: Veille à ajouter également un champ du type de message nouvellement créé dans :code:`oneof msg`.
zh_hans: 确保在 :code:`oneof msg` 中也添加一个新创建的消息类型字段。

source: Once that is done, we will compile the file with:
fr: Une fois que c'est fait, nous compilerons le fichier avec :
zh_hans: 完成后，我们将使用：

source: If it compiles succesfully, you should see the following message:
fr: S'il se compile avec succès, tu devrais voir le message suivant :
zh_hans: 如果编译成功，你应该会看到以下信息：

source: Serialization and Deserialization Functions
fr: Fonctions de sérialisation et de désérialisation
zh_hans: 序列化和反序列化函数

source: Our next step is to add functions to serialize and deserialize Python datatypes to or from our defined RPC message types. You should add these functions in :code:`serde.py`.
fr: La prochaine étape consiste à ajouter des fonctions pour sérialiser et désérialiser les types de données Python vers ou à partir des types de messages RPC définis. Tu dois ajouter ces fonctions dans :code:`serde.py`.
zh_hans: 下一步是添加函数，以便将 Python 数据类型序列化和反序列化为我们定义的 RPC 消息类型或从我们定义的 RPC 消息类型反序列化和反序列化 Python 数据类型。您应该在 :code:`serde.py` 中添加这些函数。

source: The four functions:
fr: Les quatre fonctions :
zh_hans: 四种函数：

source: Sending the Message from the Server
fr: Envoi du message à partir du serveur
zh_hans: 从服务器发送信息

source: Now write the request function in your Client Proxy class (e.g., :code:`grpc_client_proxy.py`) using the serde functions you just created:
fr: Écris maintenant la fonction de demande dans ta classe Client Proxy (par exemple, :code:`grpc_client_proxy.py`) en utilisant les fonctions serde que tu viens de créer :
zh_hans: 现在，在客户端代理类（例如 :code:`grpc_client_proxy.py`）中使用刚才创建的 serde 函数编写请求函数：

source: Receiving the Message by the Client
fr: Réception du message par le client
zh_hans: 由客户端接收信息

source: Last step! Modify the code in :code:`message_handler.py` to check the field of your message and call the :code:`example_response` function. Remember to use the serde functions!
fr: Dernière étape ! Modifie le code dans :code:`message_handler.py` pour vérifier le champ de ton message et appeler la fonction :code:`example_response`. N'oublie pas d'utiliser les fonctions serde !
zh_hans: 最后一步 修改 :code:`message_handler.py` 中的代码，检查信息的字段并调用 :code:`example_response` 函数。记住使用 serde 函数！

source: Within the handle function:
fr: Dans le cadre de la fonction de poignée :
zh_hans: 在句柄函数内：

source: And add a new function:
fr: Et ajoute une nouvelle fonction :
zh_hans: 并增加一个新函数：

source: Hopefully, when you run your program you will get the intended result!
fr: Avec un peu de chance, lorsque tu exécuteras ton programme, tu obtiendras le résultat escompté !
zh_hans: 希望您在运行程序时能得到预期的结果！

source: Contribute translations
zh_hans: 贡献译文

source: Since `Flower 1.5 <https://flower.dev/docs/framework/ref-changelog.html#v1-5-0-2023-08-31>`_ we have introduced translations to our doc pages, but, as you might have noticed, the translations are often imperfect. If you speak languages other than English, you might be able to help us in our effort to make Federated Learning accessible to as many people as possible by contributing to those translations! This might also be a great opportunity for those wanting to become open source contributors with little prerequistes.
zh_hans: 从 `Flower 1.5 <https://flower.dev/docs/framework/ref-changelog.html#v1-5-0-2023-08-31>`_ 开始，我们在文档页面中引入了翻译，但正如你可能已经注意到的，这些翻译往往并不完美。如果您会说英语以外的语言，也许您可以帮助我们翻译这些文档，让更多的人了解 Federated Learning！对于那些想成为开源贡献者的人来说，这也是一个很好的机会。

source: Our translation project is publicly available over on `Weblate <https://hosted.weblate.org/projects/flower-docs/framework/>`_, this where most of the work will happen.
zh_hans: 我们的翻译项目已在 "Weblate <https://hosted.weblate.org/projects/flower-docs/framework/>`_"上公开，大部分工作都将在这里进行。

source: Contribute to existing languages
zh_hans: 为现有语言作出贡献

source: The first thing you will need to do in order to contribute is to create a free Weblate account on this `page <https://hosted.weblate.org/accounts/register/>`_. More information about profile settings can be found `here <https://docs.weblate.org/en/latest/user/profile.html>`_.
zh_hans: 您需要做的第一件事就是在本`网页<https://hosted.weblate.org/accounts/register/>`_上创建一个免费的Weblate帐户。有关个人资料设置的更多信息，请参阅`这里 <https://docs.weblate.org/en/latest/user/profile.html>`_。

source: Once you are signed in to Weblate, you can navigate to the `Flower Framework project <https://hosted.weblate.org/projects/flower-docs/framework/>`_. Here, you should see the different existing languages that can be found on the website.
zh_hans: 登录到Weblate后，您可以导航到 "Flower Framework "项目<https://hosted.weblate.org/projects/flower-docs/framework/>`_。在这里，您可以看到网站上现有的各种语言。

source: Once you have selected the language you want to contribute to, you should see a similar interface to this:
zh_hans: 选择您要贡献的语言后，您应该会看到与此类似的界面：

source: The most straight forward option here is to click on the ``Translate`` button on the top right (in the ``Translation status`` section). This will automatically bring you to the translation interface for untranslated strings.
zh_hans: 最简单的方法是点击右上角（"翻译状态 "部分）的 "翻译 "按钮。这将自动带您进入未翻译字符串的翻译界面。

source: This is what the interface looks like:
zh_hans: 这就是界面的样子：

source: You input your translation in the textbox at the top and then, once you are happy with it, you either press ``Save and continue`` (to save the translation and go to the next untranslated string), ``Save and stay`` (to save the translation and stay on the same page), ``Suggest`` (to add your translation to suggestions for other users to view), or ``Skip`` (to go to the next untranslated string without saving anything).
zh_hans: 您可以在顶部的文本框中输入翻译内容，满意后按 "保存并继续"（保存翻译内容并转到下一个未翻译的字符串）、"保存并停留"（保存翻译内容并停留在同一页面）、"建议"（将您的翻译添加到建议中供其他用户查看）或 "跳过"（转到下一个未翻译的字符串而不保存任何内容）。

source: In order to help with the translations, you can see on the bottom the ``Nearby strings``, the ``Comments`` (from other contributors), the ``Automatic suggestions`` (from machine translation engines), the translations in ``Other languages``, and the ``History`` of translations for this string.
zh_hans: 为了帮助翻译，您可以在底部看到 "邻近字符串"、"评论"（来自其他贡献者）、"自动建议"（来自机器翻译引擎）、"其他语言 "中的翻译以及该字符串的 "历史翻译"。

source: On the right, under the ``String information`` section, you can also click the link under ``Source string location`` in order to view the source of the doc file containing the string.
zh_hans: 在右侧的 "字符串信息 "部分，您还可以单击 "源字符串位置 "下的链接，以查看包含字符串的 doc 文件的源文件。

source: For more information about translating using Weblate, you can check out this `in-depth guide <https://docs.weblate.org/en/latest/user/translating.html>`_.
zh_hans: 有关使用 Weblate 进行翻译的更多信息，您可以查看本 "深入指南 <https://docs.weblate.org/en/latest/user/translating.html>`_"。

source: Add new languages
zh_hans: 添加新语言

source: If you want to add a new language, you will first have to contact us, either on `Slack <https://flower.dev/join-slack>`_, or by opening an issue on our `GitHub repo <https://github.com/adap/flower>`_.
zh_hans: 如果您想添加新语言，请先联系我们，可以在 `Slack <https://flower.dev/join-slack>`_ 上联系，也可以在我们的 `GitHub repo <https://github.com/adap/flower>`_ 上提交问题。

source: Develop in VSCode Dev Containers
fr: Utiliser les conteneurs VS Code Remote
zh_hans: 使用 VSCode Dev Containers 进行开发

source: When working on the Flower framework we want to ensure that all contributors use the same developer environment to format code or run tests. For this purpose we are using the VSCode Remote Containers extension. What is it? Read the following quote:
fr: Lorsque nous travaillons sur Flower, nous voulons nous assurer que tous les contributeurs utilisent le même environnement de développement pour formater le code ou exécuter des tests. À cette fin, nous utilisons l'extension VSCode Remote Containers. Qu'est-ce que c'est ?
zh_hans: 在开发 Flower 框架时，我们希望确保所有贡献者使用相同的开发环境来格式化代码或运行测试。为此，我们使用了 VSCode 远程容器扩展。这是什么？请阅读下面这段话：

source: The Visual Studio Code Remote - Containers extension lets you use a Docker container as a fully-featured development environment. It allows you to open any folder inside (or mounted into) a container and take advantage of Visual Studio Code's full feature set. A :code:`devcontainer.json` file in your project tells VS Code how to access (or create) a development container with a well-defined tool and runtime stack. This container can be used to run an application or to separate tools, libraries, or runtimes needed for working with a codebase.
fr: L'extension Visual Studio Code Remote - Containers te permet d'utiliser un conteneur Docker comme environnement de développement complet. Elle te permet d'ouvrir n'importe quel dossier à l'intérieur (ou monté dans) d'un conteneur et de profiter de l'ensemble des fonctionnalités de Visual Studio Code. Un fichier :code:`devcontainer.json` dans ton projet indique à VS Code comment accéder à (ou créer) un conteneur de développement avec une pile d'outils et d'exécutions bien définie. Ce conteneur peut être utilisé pour exécuter une application ou pour séparer les outils, les bibliothèques ou les exécutions nécessaires pour travailler avec une base de code.
zh_hans: Visual Studio Code Remote - Containers扩展可让你将Docker容器用作功能齐全的开发环境。它允许你打开容器内（或挂载到容器内）的任何文件夹，并利用 Visual Studio Code 的全部功能集。项目中的 :code:`devcontainer.json` 文件会告诉 VS Code 如何访问（或创建）一个带有定义明确的工具和运行时栈的开发容器。该容器可用于运行应用程序，也可用于分离处理代码库所需的工具、库或运行时。

source: Workspace files are mounted from the local file system or copied or cloned into the container. Extensions are installed and run inside the container, where they have full access to the tools, platform, and file system. This means that you can seamlessly switch your entire development environment just by connecting to a different container.
fr: Les fichiers de l'espace de travail sont montés à partir du système de fichiers local ou copiés ou clonés dans le conteneur. Les extensions sont installées et exécutées à l'intérieur du conteneur, où elles ont un accès complet aux outils, à la plateforme et au système de fichiers. Cela signifie que tu peux changer de façon transparente tout ton environnement de développement simplement en te connectant à un autre conteneur.
zh_hans: 工作区文件从本地文件系统加载，或复制或克隆到容器中。扩展在容器内安装和运行，在容器内它们可以完全访问工具、平台和文件系统。这意味着，只需连接到不同的容器，就能无缝切换整个开发环境。

source: Source: `Official VSCode documentation <https://code.visualstudio.com/docs/remote/containers>`_
fr: Source : `Documentation officielle de VSCode <https://code.visualstudio.com/docs/remote/containers>`_
zh_hans: 来源：`VSCode 官方文档 <https://code.visualstudio.com/docs/remote/containers>`_

source: Getting started
fr: Pour commencer
zh_hans: 开始

source: Configuring and setting up the :code:`Dockerfile` as well the configuration for the devcontainer can be a bit more involved. The good thing is you want have to do it. Usually it should be enough to install Docker on your system and ensure its available on your command line. Additionally, install the `VSCode Containers Extension <vscode:extension/ms-vscode-remote.remote-containers>`_.
fr: La configuration et le paramétrage du :code:`Dockerfile` ainsi que la configuration du devcontainer peuvent être un peu plus complexes. L'avantage, c'est que tu veux avoir à le faire. En général, il devrait suffire d'installer Docker sur ton système et de s'assurer qu'il est disponible sur ta ligne de commande. En outre, installe l'extension `VSCode Containers Extension <vscode:extension/ms-vscode-remote.remote-containers>`_.
zh_hans: 配置和设置 :code:`Dockerfile` 以及 devcontainer 的配置可能比较复杂。好在你想做就得做。通常只需在系统中安装 Docker 并确保其在命令行中可用即可。此外，请安装 `VSCode Containers Extension <vscode:extension/ms-vscode-remote.remote-containers>`_。

source: Now you should be good to go. When starting VSCode, it will ask you to run in the container environment and - if you confirm - automatically build the container and use it. To manually instruct VSCode to use the devcontainer, you can, after installing the extension, click the green area in the bottom left corner of your VSCode window and select the option *(Re)Open Folder in Container*.
fr: Maintenant, tu devrais être prêt à partir. Au démarrage de VSCode, il te demandera de fonctionner dans l'environnement du conteneur et - si tu confirmes - construira automatiquement le conteneur et l'utilisera. Pour demander manuellement à VSCode d'utiliser le devcontainer, tu peux, après avoir installé l'extension, cliquer sur la zone verte dans le coin inférieur gauche de ta fenêtre VSCode et sélectionner l'option *(Re)Ouvrir le dossier dans le conteneur*.
zh_hans: 现在你应该可以开始了。启动 VSCode 时，它会要求你在容器环境中运行，如果你确认，它会自动构建容器并使用它。要手动指示 VSCode 使用 devcontainer，可以在安装扩展后，点击 VSCode 窗口左下角的绿色区域，然后选择 "*（重新）在容器中打开文件夹*"选项。

source: In some cases your setup might be more involved. For those cases consult the following sources:
fr: Dans certains cas, ton installation peut être plus complexe. Pour ces cas-là, consulte les sources suivantes :
zh_hans: 在某些情况下，您的设置可能更复杂。有关这些情况，请参考以下资料：

source: `Developing inside a Container <https://code.visualstudio.com/docs/remote/containers#_system-requirements>`_
fr: `Développement à l'intérieur d'un conteneur <https://code.visualstudio.com/docs/remote/containers#_system-requirements>`_
zh_hans: 在容器内开发 <https://code.visualstudio.com/docs/remote/containers#_system-requirements>`_

source: `Remote development in Containers <https://code.visualstudio.com/docs/remote/containers-tutorial>`_
fr: `Développement à distance dans les conteneurs <https://code.visualstudio.com/docs/remote/containers-tutorial>`_
zh_hans: 容器中的远程开发 <https://code.visualstudio.com/docs/remote/containers-tutorial>`_

source: Install development versions
fr: Installer les versions de développement de Flower
zh_hans: 安装开发版本

source: Install development versions of Flower
fr: Installe les versions de développement de Flower
zh_hans: 安装 Flower 的开发版本

source: Using Poetry (recommended)
fr: Utiliser la poésie (recommandé)
zh_hans: 使用诗歌（推荐）

source: Install a ``flwr`` pre-release from PyPI: update the ``flwr`` dependency in ``pyproject.toml`` and then reinstall (don't forget to delete ``poetry.lock`` (``rm poetry.lock``) before running ``poetry install``).
fr: Installez une pré-version ``flwr`` de PyPI : mettez à jour la dépendance ``flwr`` dans ``pyproject.toml`` puis réinstallez (n'oubliez pas de supprimer ``poetry.lock`` (``rm poetry.lock``) avant d'exécuter ``poetry install``).
zh_hans: 安装来自 PyPI 的 ``flwr`` 预发布版本：更新 ``pyproject.toml`` 中的 ``flwr`` 依赖关系，然后重新安装（运行 ``poetry install` 前，别忘了删除 ``poetry.lock` (``rm poetry.lock`))。

source: ``flwr = { version = "1.0.0a0", allow-prereleases = true }`` (without extras)
fr: ``flwr = { version = "1.0.0a0", allow-prereleases = true }`` (sans extras)
zh_hans: ``flwr = { version = "1.0.0a0", allow-prereleases = true }`` （不含额外内容）

source: ``flwr = { version = "1.0.0a0", allow-prereleases = true, extras = ["simulation"] }`` (with extras)
fr: ``flwr = { version = "1.0.0a0", allow-prereleases = true, extras = ["simulation"] }`` (avec extras)
zh_hans: ``flwr = { version = "1.0.0a0", allow-prereleases = true, extras = ["simulation"] }`` (包含额外内容)

source: Install ``flwr`` from a local copy of the Flower source code via ``pyproject.toml``:
fr: Installez ``flwr`` à partir d'une copie locale du code source de Flower via ``pyproject.toml`` :
zh_hans: 通过 ``pyproject.toml`` 从 Flower 源代码的本地副本安装 ``flwr``：

source: ``flwr = { path = "../../", develop = true }`` (without extras)
fr: ``flwr = { path = "../../", develop = true }`` (sans extras)
zh_hans: ``flwr = { path = "../../", develop = true }`` （不含额外内容）

source: ``flwr = { path = "../../", develop = true, extras = ["simulation"] }`` (with extras)
fr: ``flwr = { path = "../../", develop = true, extras = ["simulation"] }`` (avec extras)
zh_hans: ``flwr = { path = "../../", develop = true, extras = ["simulation"] }`` (包含额外内容)

source: Install ``flwr`` from a local wheel file via ``pyproject.toml``:
fr: Installez ``flwr`` à partir d'un fichier local via ``pyproject.toml`` :
zh_hans: 通过 ``pyproject.toml`` 从本地轮子文件安装 ``flwr``：

source: ``flwr = { path = "../../dist/flwr-1.0.0-py3-none-any.whl" }`` (without extras)
fr: ``flwr = { path = "../../dist/flwr-1.0.0-py3-none-any.whl" }`` (sans extras)
zh_hans: ``flwr = { path = "../../dist/flwr-1.0.0-py3-none-any.whl" }``（无额外内容）

source: ``flwr = { path = "../../dist/flwr-1.0.0-py3-none-any.whl", extras = ["simulation"] }`` (with extras)
fr: ``flwr = { path = "../../dist/flwr-1.0.0-py3-none-any.whl", extras = ["simulation"] }`` (avec extras)
zh_hans: ``flwr = { path = "../../dist/flwr-1.0.0-py3-none-any.whl", extras = ["simulation"] }`` (包含额外内容)

source: Please refer to the Poetry documentation for further details: `Poetry Dependency Specification <https://python-poetry.org/docs/dependency-specification/>`_
fr: Reporte-toi à la documentation de Poetry pour plus de détails : `Poetry Dependency Specification <https://python-poetry.org/docs/dependency-specification/>`_
zh_hans: 有关详细信息，请参阅 Poetry 文档： 诗歌依赖性规范 <https://python-poetry.org/docs/dependency-specification/>`_

source: Using pip (recommended on Colab)
fr: Utiliser pip (recommandé sur Colab)
zh_hans: 使用 pip（建议在 Colab 上使用）

source: Install a ``flwr`` pre-release from PyPI:
fr: Installe une pré-version de ``flwr`` depuis PyPI :
zh_hans: 从 PyPI 安装 ``flwr`` 预发行版：

source: ``pip install -U --pre flwr`` (without extras)
fr: ``pip install -U --pre flwr`` (sans les extras)
zh_hans: `pip install -U -pre flwr``（不含额外功能）

source: ``pip install -U --pre flwr[simulation]`` (with extras)
fr: ``pip install -U --pre flwr[simulation]`` (avec les extras)
zh_hans: `pip install -U -pre flwr[simulation]``（包含额外功能）

source: Python packages can be installed from git repositories. Use one of the following commands to install the Flower directly from GitHub.
fr: Les paquets Python peuvent être installés à partir des dépôts git. Utilise l'une des commandes suivantes pour installer Flower directement à partir de GitHub.
zh_hans: Python 软件包可以从 git 仓库安装。使用以下命令之一直接从 GitHub 安装 Flower。

source: Install ``flwr`` from the default GitHub branch (``main``):
fr: Installez ``flwr`` à partir de la branche GitHub par défaut (``main``) :
zh_hans: 从 GitHub 的默认分支 (``main`) 安装 ``flwr``：

source: ``pip install flwr@git+https://github.com/adap/flower.git`` (without extras)
fr: ``pip install flwr@git+https://github.com/adap/flower.git`` (sans les extras)
zh_hans: `pip install flwr@git+https://github.com/adap/flower.git`` （不含额外功能）

source: ``pip install flwr[simulation]@git+https://github.com/adap/flower.git`` (with extras)
fr: ``pip install flwr[simulation]@git+https://github.com/adap/flower.git`` (avec les extras)
zh_hans: `pip install flwr[simulation]@git+https://github.com/adap/flower.git``（带附加功能）

source: Install ``flwr`` from a specific GitHub branch (``branch-name``):
fr: Installez ``flwr`` à partir d'une branche GitHub spécifique (``nom-branche``) :
zh_hans: 从特定的 GitHub 分支 (`分支名`) 安装 ``flwr``：

source: ``pip install flwr@git+https://github.com/adap/flower.git@branch-name`` (without extras)
fr: ``pip install flwr@git+https://github.com/adap/flower.git@nom-branche`` (sans les extras)
zh_hans: `pip install flwr@git+https://github.com/adap/flower.git@branch-name`` （不含附加功能）

source: ``pip install flwr[simulation]@git+https://github.com/adap/flower.git@branch-name`` (with extras)
fr: ``pip install flwr[simulation]@git+https://github.com/adap/flower.git@nom-de-branche`` (avec des extras)
zh_hans: `pip安装flwr[模拟]@git+https://github.com/adap/flower.git@分支名``（带附加功能）

source: Open Jupyter Notebooks on Google Colab
fr: Ouvre les carnets Jupyter sur Google Colab
zh_hans: 在谷歌 Colab 上打开 Jupyter 笔记本

source: Open the notebook ``doc/source/tutorial-get-started-with-flower-pytorch.ipynb``:
fr: Ouvrir le notebook ``doc/source/tutorial/Flower-1-Intro-to-FL-PyTorch.ipynb`` :
zh_hans: 打开笔记本 ``doc/source/tutorial-get-started-with-flower-pytorch.ipynb``：

source: Open a development version of the same notebook from branch `branch-name` by changing ``main`` to ``branch-name`` (right after ``blob``):
fr: Ouvre une version de développement du même carnet à partir de la branche `nom-branche` en remplaçant `main` par `nom-branche` (juste après `blob`) :
zh_hans: 将 ``main`` 改为 ``branch-name``（紧跟在 ``blob``之后），从分支 `branch-name` 打开同一笔记本的开发版本：

source: Install a `whl` on Google Colab:
zh_hans: 在 Google Colab 上安装 `whl`：

source: In the vertical icon grid on the left hand side, select ``Files`` > ``Upload to session storage``
zh_hans: 在左侧的垂直图标网格中，选择 "文件">"上传到会话存储"
