Repository: lucacorbucci/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: fr, zh_hans

source: Instead of building on top of ``NumPyClient``, we can directly build on top of ``Client``.
fr: Au lieu de construire par-dessus `NumPyClient``, nous pouvons construire directement par-dessus `Client``.
zh_hans: 与其在 ``NumPyClient`` 上构建，我们可以直接在 ``Client`` 上构建。

source: Step 2: Moving from ``NumPyClient`` to ``Client``
fr: Étape 2 : Passer de ``NumPyClient`` à ``Client``
zh_hans: 步骤 2：从 ``NumPyClient`` 移至 ``Client``

source: Let's try to do the same thing using ``Client`` instead of ``NumPyClient``.
fr: Essayons de faire la même chose en utilisant ``Client`` au lieu de ``NumPyClient``.
zh_hans: 让我们尝试使用 ``Client`` 代替 ``NumPyClient`` 做同样的事情。

source: Before we discuss the code in more detail, let's try to run it! Gotta make sure our new ``Client``-based client works, right?
fr: Avant de discuter du code plus en détail, essayons de l'exécuter ! Nous devons nous assurer que notre nouveau client basé sur le ``Client`` fonctionne, n'est-ce pas ?
zh_hans: 在详细讨论代码之前，让我们试着运行它！必须确保我们基于 ``Client`` 的新客户端能正常运行，对吗？

source: That's it, we're now using ``Client``. It probably looks similar to what we've done with ``NumPyClient``. So what's the difference?
fr: Voilà, nous utilisons maintenant ``Client``. Cela ressemble probablement à ce que nous avons fait avec ``NumPyClient``. Alors quelle est la différence ?
zh_hans: 就是这样，我们现在开始使用 ``Client``。它看起来可能与我们使用 ``NumPyClient`` 所做的类似。那么有什么不同呢？

source: First of all, it's more code. But why? The difference comes from the fact that ``Client`` expects us to take care of parameter serialization and deserialization. For Flower to be able to send parameters over the network, it eventually needs to turn these parameters into ``bytes``. Turning parameters (e.g., NumPy ``ndarray``'s) into raw bytes is called serialization. Turning raw bytes into something more useful (like NumPy ``ndarray``'s) is called deserialization. Flower needs to do both: it needs to serialize parameters on the server-side and send them to the client, the client needs to deserialize them to use them for local training, and then serialize the updated parameters again to send them back to the server, which (finally!) deserializes them again in order to aggregate them with the updates received from other clients.
zh_hans: 首先，它的代码更多。但为什么呢？区别在于 ``Client`` 希望我们处理参数的序列化和反序列化。Flower 要想通过网络发送参数，最终需要将这些参数转化为 ``字节``。把参数（例如 NumPy 的 ``ndarray`` 参数）变成原始字节叫做序列化。将原始字节转换成更有用的东西（如 NumPy ``ndarray`）称为反序列化。Flower 需要同时做这两件事：它需要在服务器端序列化参数并将其发送到客户端，客户端需要反序列化参数以便将其用于本地训练，然后再次序列化更新后的参数并将其发送回服务器，服务器（最后）再次反序列化参数以便将其与从其他客户端接收到的更新汇总在一起。

source: The only *real* difference between Client and NumPyClient is that NumPyClient takes care of serialization and deserialization for you. It can do so because it expects you to return parameters as NumPy ndarray's, and it knows how to handle these. This makes working with machine learning libraries that have good NumPy support (most of them) a breeze.
fr: La seule *vraie* différence entre Client et NumPyClient est que NumPyClient s'occupe de la sérialisation et de la désérialisation pour toi. Il peut le faire parce qu'il s'attend à ce que tu renvoies des paramètres sous forme de NumPy ndarray, et il sait comment les gérer. Cela permet de travailler avec des bibliothèques d'apprentissage automatique qui ont une bonne prise en charge de NumPy (la plupart d'entre elles) en un clin d'œil.
zh_hans: Client 与 NumPyClient 之间的唯一**真正区别在于，NumPyClient 会为你处理序列化和反序列化。NumPyClient之所以能做到这一点，是因为它预计你会以NumPy ndarray的形式返回参数，而且它知道如何处理这些参数。这使得与具有良好 NumPy 支持的大多数机器学习库一起工作变得轻而易举。

source: In terms of API, there's one major difference: all methods in Client take exactly one argument (e.g., ``FitIns`` in ``Client.fit``) and return exactly one value (e.g., ``FitRes`` in ``Client.fit``). The methods in ``NumPyClient`` on the other hand have multiple arguments (e.g., ``parameters`` and ``config`` in ``NumPyClient.fit``) and multiple return values (e.g., ``parameters``, ``num_example``, and ``metrics`` in ``NumPyClient.fit``) if there are multiple things to handle. These ``*Ins`` and ``*Res`` objects in ``Client`` wrap all the individual values you're used to from ``NumPyClient``.
zh_hans: 在 API 方面，有一个主要区别：Client 中的所有方法都只接受一个参数（例如，``Client.fit`` 中的 ``FitIns``），并只返回一个值（例如，``Client.fit`` 中的 ``FitRes``）。另一方面，``NumPyClient``中的方法有多个参数（例如，``NumPyClient.fit``中的``parameters``和``config``）和多个返回值（例如，``NumPyClient.fit``中的``parameters``、``num_example``和``metrics``）。在 ``Client`` 中的这些 ``*Ins`` 和 ``*Res`` 对象封装了你在 ``NumPyClient`` 中习惯使用的所有单个值。

source: Step 3: Custom serialization
fr: Étape 3 : Sérialisation personnalisée
zh_hans: 步骤 3：自定义序列化

source: Here we will explore how to implement custom serialization with a simple example.
fr: Nous allons ici explorer comment mettre en œuvre une sérialisation personnalisée à l'aide d'un exemple simple.
zh_hans: 下面我们将通过一个简单的示例来探讨如何实现自定义序列化。

source: But first what is serialization? Serialization is just the process of converting an object into raw bytes, and equally as important, deserialization is the process of converting raw bytes back into an object. This is very useful for network communication. Indeed, without serialization, you could not just a Python object through the internet.
fr: Mais d'abord, qu'est-ce que la sérialisation ? La sérialisation est simplement le processus de conversion d'un objet en octets bruts, et tout aussi important, la désérialisation est le processus de reconversion des octets bruts en objet. Ceci est très utile pour la communication réseau. En effet, sans la sérialisation, tu ne pourrais pas faire passer un objet Python par Internet.
zh_hans: 首先，什么是序列化？序列化只是将对象转换为原始字节的过程，同样重要的是，反序列化是将原始字节转换回对象的过程。这对网络通信非常有用。事实上，如果没有序列化，你就无法通过互联网传输一个 Python 对象。

source: Federated Learning relies heavily on internet communication for training by sending Python objects back and forth between the clients and the server. This means that serialization is an essential part of Federated Learning.
fr: L'apprentissage fédéré s'appuie fortement sur la communication Internet pour la formation en envoyant des objets Python dans les deux sens entre les clients et le serveur, ce qui signifie que la sérialisation est un élément essentiel de l'apprentissage fédéré.
zh_hans: 通过在客户端和服务器之间来回发送 Python 对象，联合学习在很大程度上依赖于互联网通信进行训练。这意味着序列化是联邦学习的重要组成部分。

source: In the following section, we will write a basic example where instead of sending a serialized version of our ``ndarray``\ s containing our parameters, we will first convert the ``ndarray`` into sparse matrices, before sending them. This technique can be used to save bandwidth, as in certain cases where the weights of a model are sparse (containing many 0 entries), converting them to a sparse matrix can greatly improve their bytesize.
fr: Dans la section suivante, nous allons écrire un exemple de base où, au lieu d'envoyer une version sérialisée de nos ``ndarray`` contenant nos paramètres, nous allons d'abord convertir les ``ndarray`` en matrices éparses, avant de les envoyer. Cette technique peut être utilisée pour économiser de la bande passante, car dans certains cas où les poids d'un modèle sont épars (contenant de nombreuses entrées 0), les convertir en une matrice éparse peut grandement améliorer leur taille en octets.
zh_hans: 在下面的章节中，我们将编写一个基本示例，在发送包含参数的 ``ndarray`` 前，我们将首先把 ``ndarray`` 转换为稀疏矩阵，而不是发送序列化版本。这种技术可以用来节省带宽，因为在某些情况下，模型的参数是稀疏的（包含许多 0 条目），将它们转换成稀疏矩阵可以大大提高它们的字节数。

source: Our custom serialization/deserialization functions
fr: Nos fonctions de sérialisation/désérialisation personnalisées
zh_hans: 我们的定制序列化/反序列化功能

source: This is where the real serialization/deserialization will happen, especially in ``ndarray_to_sparse_bytes`` for serialization and ``sparse_bytes_to_ndarray`` for deserialization.
fr: C'est là que la véritable sérialisation/désérialisation se produira, en particulier dans ``ndarray_to_sparse_bytes`` pour la sérialisation et ``sparse_bytes_to_ndarray`` pour la désérialisation.
zh_hans: 这才是真正的序列化/反序列化，尤其是在用于序列化的 ``ndarray_too_sparse_bytes`` 和用于反序列化的 ``sparse_bytes_too_ndarray`` 中。

source: Note that we imported the ``scipy.sparse`` library in order to convert our arrays.
fr: Notez que nous avons importé la bibliothèque ``scipy.sparse`` afin de convertir nos tableaux.
zh_hans: 请注意，为了转换数组，我们导入了 ``scipy.sparse`` 库。

source: Client-side
fr: Côté client
zh_hans: 客户端

source: To be able to able to serialize our ``ndarray``\ s into sparse parameters, we will just have to call our custom functions in our ``flwr.client.Client``.
fr: Pour pouvoir sérialiser nos ``ndarray`` en paramètres sparse, il nous suffira d'appeler nos fonctions personnalisées dans notre ``flwr.client.Client``.
zh_hans: 为了能够将我们的 ``ndarray`` 序列化为稀疏参数，我们只需在 ``flwr.client.Client`` 中调用我们的自定义函数。

source: Indeed, in ``get_parameters`` we need to serialize the parameters we got from our network using our custom ``ndarrays_to_sparse_parameters`` defined above.
fr: En effet, dans ``get_parameters`` nous devons sérialiser les paramètres que nous avons obtenus de notre réseau en utilisant nos ``ndarrays_to_sparse_parameters`` personnalisés définis ci-dessus.
zh_hans: 事实上，在 `get_parameters` 中，我们需要使用上文定义的自定义 `ndarrays_too_sparse_parameters` 序列化从网络中获取的参数。

source: In ``fit``, we first need to deserialize the parameters coming from the server using our custom ``sparse_parameters_to_ndarrays`` and then we need to serialize our local results with ``ndarrays_to_sparse_parameters``.
fr: Dans ``fit``, nous devons d'abord désérialiser les paramètres provenant du serveur en utilisant notre ``sparse_parameters_to_ndarrays`` personnalisé, puis nous devons sérialiser nos résultats locaux avec ``ndarrays_to_sparse_parameters``.
zh_hans: 在 ``fit`` 中，我们首先需要使用自定义的 ``sparse_parameters_to_ndarrays`` 反序列化来自服务器的参数，然后使用 ``ndarrays_to_sparse_parameters`` 序列化本地结果。

source: In ``evaluate``, we will only need to deserialize the global parameters with our custom function.
fr: Dans ``evaluate``, nous n'aurons besoin que de désérialiser les paramètres globaux avec notre fonction personnalisée.
zh_hans: 在 ``evaluate`` 中，我们只需要用自定义函数反序列化全局参数。

source: Server-side
fr: Côté serveur
zh_hans: 服务器端

source: For this example, we will just use ``FedAvg`` as a strategy. To change the serialization and deserialization here, we only need to reimplement the ``evaluate`` and ``aggregate_fit`` functions of ``FedAvg``. The other functions of the strategy will be inherited from the super class ``FedAvg``.
fr: Pour cet exemple, nous utiliserons simplement ``FedAvg`` comme stratégie. Pour modifier la sérialisation et la désérialisation ici, il suffit de réimplémenter les fonctions ``evaluate`` et ``aggregate_fit`` de ``FedAvg``. Les autres fonctions de la stratégie seront héritées de la super-classe ``FedAvg``.
zh_hans: 在本例中，我们将只使用 ``FedAvg`` 作为策略。要改变这里的序列化和反序列化，我们只需重新实现 ``FedAvg`` 的 ``evaluate`` 和 ``aggregate_fit`` 函数。策略的其他函数将从超类 ``FedAvg`` 继承。

source: As you can see only one line as change in ``evaluate``:
fr: Comme tu peux le voir, seule une ligne a été modifiée dans ``evaluate`` :
zh_hans: 正如你所看到的，``evaluate``中只修改了一行：

source: And for ``aggregate_fit``, we will first deserialize every result we received:
fr: Et pour ``aggregate_fit``, nous allons d'abord désérialiser chaque résultat que nous avons reçu :
zh_hans: 而对于 ``aggregate_fit``，我们将首先反序列化收到的每个结果：

source: And then serialize the aggregated result:
fr: Puis sérialise le résultat agrégé :
zh_hans: 然后将汇总结果序列化：

source: We can now run our custom serialization example!
fr: Nous pouvons maintenant exécuter notre exemple de sérialisation personnalisée !
zh_hans: 现在我们可以运行自定义序列化示例！

source: In this part of the tutorial, we've seen how we can build clients by subclassing either ``NumPyClient`` or ``Client``. ``NumPyClient`` is a convenience abstraction that makes it easier to work with machine learning libraries that have good NumPy interoperability. ``Client`` is a more flexible abstraction that allows us to do things that are not possible in ``NumPyClient``. In order to do so, it requires us to handle parameter serialization and deserialization ourselves.
fr: Dans cette partie du tutoriel, nous avons vu comment construire des clients en sous-classant soit ``NumPyClient``, soit ``Client``. ``NumPyClient`` est une abstraction de commodité qui facilite le travail avec les bibliothèques d'apprentissage automatique qui ont une bonne interopérabilité NumPy. ``Client`` est une abstraction plus flexible qui nous permet de faire des choses qui ne sont pas possibles dans ``NumPyClient``. Pour ce faire, elle nous oblige à gérer nous-mêmes la sérialisation et la désérialisation des paramètres.
zh_hans: 在本部分教程中，我们已经了解了如何通过子类化 ``NumPyClient`` 或 ``Client`` 来构建客户端。NumPyClient "是一个便捷的抽象类，可以让我们更容易地与具有良好NumPy互操作性的机器学习库一起工作。``Client``是一个更灵活的抽象类，允许我们做一些在`NumPyClient``中做不到的事情。为此，它要求我们自己处理参数序列化和反序列化。

source: This is the final part of the Flower tutorial (for now!), congratulations! You're now well equipped to understand the rest of the documentation. There are many topics we didn't cover in the tutorial, we recommend the following resources:
fr: C'est la dernière partie du tutoriel Flower (pour l'instant !), félicitations ! Tu es maintenant bien équipé pour comprendre le reste de la documentation. Il y a de nombreux sujets que nous n'avons pas abordés dans le tutoriel, nous te recommandons les ressources suivantes :
zh_hans: 这暂时是 Flower 教程的最后一部分，恭喜您！您现在已经具备了理解其余文档的能力。本教程还有许多内容没有涉及，我们推荐您参考以下资源：

source: `Read Flower Docs <https://flower.dev/docs/>`__
fr: `Lire les docs sur les fleurs <https://flower.dev/docs/>`__
zh_hans: 阅读Flower文档 <https://flower.dev/docs/>`__

source: `Check out Flower Code Examples <https://github.com/adap/flower/tree/main/examples>`__
zh_hans: 查看 Flower 代码示例 <https://github.com/adap/flower/tree/main/examples>`__

source: `Use Flower Baselines for your research <https://flower.dev/docs/baselines/>`__
zh_hans: 使用 "Flower Baselines "进行研究 <https://flower.dev/docs/baselines/>`__

source: `Watch Flower Summit 2023 videos <https://flower.dev/conf/flower-summit-2023/>`__
zh_hans: 观看 2023 年Flower峰会视频 <https://flower.dev/conf/flower-summit-2023/>`__

source: Get started with Flower
zh_hans: 开始使用Flower

source: Welcome to the Flower federated learning tutorial!
fr: Bienvenue au tutoriel sur l'apprentissage fédéré de la fleur !
zh_hans: 欢迎阅读Flower联邦学习教程！

source: In this notebook, we'll build a federated learning system using Flower and PyTorch. In part 1, we use PyTorch for the model training pipeline and data loading. In part 2, we continue to federate the PyTorch-based pipeline using Flower.
fr: Dans ce carnet, nous allons construire un système d'apprentissage fédéré en utilisant Flower et PyTorch. Dans la première partie, nous utilisons PyTorch pour le pipeline d'entraînement des modèles et le chargement des données. Dans la deuxième partie, nous continuons à fédérer le pipeline basé sur PyTorch en utilisant Flower.
zh_hans: 在本笔记中，我们将使用 Flower 和 PyTorch 构建一个联邦学习系统。在第一部分中，我们使用 PyTorch 进行模型训练和数据加载。在第二部分中，我们将继续使用 Flower 联邦化基于 PyTorch 的框架。

source: Let's get stated!
fr: Allons-y, déclarons-le !
zh_hans: 让我们开始吧！

source: Before we begin with any actual code, let's make sure that we have everything we need.
fr: Avant de commencer à coder, assurons-nous que nous disposons de tout ce dont nous avons besoin.
zh_hans: 在开始编写实际代码之前，让我们先确保我们已经准备好了所需的一切。

source: Next, we install the necessary packages for PyTorch (``torch`` and ``torchvision``) and Flower (``flwr``):
fr: Ensuite, nous installons les paquets nécessaires pour PyTorch (``torch`` et ``torchvision``) et Flower (``flwr``) :
zh_hans: 接下来，我们为 PyTorch（`torch`` 和`torchvision``）和 Flower（`flwr`）安装必要的软件包：

source: Loading the data
fr: Chargement des données
zh_hans: 加载数据

source: Federated learning can be applied to many different types of tasks across different domains. In this tutorial, we introduce federated learning by training a simple convolutional neural network (CNN) on the popular CIFAR-10 dataset. CIFAR-10 can be used to train image classifiers that distinguish between images from ten different classes:
fr: L'apprentissage fédéré peut être appliqué à de nombreux types de tâches dans différents domaines. Dans ce tutoriel, nous présentons l'apprentissage fédéré en formant un simple réseau neuronal convolutionnel (CNN) sur l'ensemble de données populaire CIFAR-10. CIFAR-10 peut être utilisé pour former des classificateurs d'images qui font la distinction entre les images de dix classes différentes :
zh_hans: 联邦学习可应用于不同领域的多种不同类型任务。在本教程中，我们将通过在流行的 CIFAR-10 数据集上训练一个简单的卷积神经网络 (CNN) 来介绍联合学习。CIFAR-10 可用于训练图像分类器，以区分来自十个不同类别的图像：

source: We simulate having multiple datasets from multiple organizations (also called the "cross-silo" setting in federated learning) by splitting the original CIFAR-10 dataset into multiple partitions. Each partition will represent the data from a single organization. We're doing this purely for experimentation purposes, in the real world there's no need for data splitting because each organization already has their own data (so the data is naturally partitioned).
fr: Nous simulons le fait d'avoir plusieurs ensembles de données provenant de plusieurs organisations (également appelé le paramètre "cross-silo" dans l'apprentissage fédéré) en divisant l'ensemble de données CIFAR-10 original en plusieurs partitions. Chaque partition représentera les données d'une seule organisation. Nous faisons cela purement à des fins d'expérimentation, dans le monde réel, il n'y a pas besoin de diviser les données parce que chaque organisation a déjà ses propres données (les données sont donc naturellement partitionnées).
zh_hans: 我们通过将原始 CIFAR-10 数据集拆分成多个分区来模拟来自多个组织的多个数据集（也称为联邦学习中的 "跨分区 "设置）。每个分区代表一个组织的数据。我们这样做纯粹是为了实验目的，在现实世界中不需要拆分数据，因为每个组织都已经有了自己的数据（所以数据是自然分区的）。

source: Each organization will act as a client in the federated learning system. So having ten organizations participate in a federation means having ten clients connected to the federated learning server:
fr: Chaque organisation agira comme un client dans le système d'apprentissage fédéré. Ainsi, le fait que dix organisations participent à une fédération signifie que dix clients sont connectés au serveur d'apprentissage fédéré :
zh_hans: 每个组织都将充当联邦学习系统中的客户端。因此，有十个组织参与联邦学习，就意味着有十个客户端连接到联邦学习服务器：

source: Let's now load the CIFAR-10 training and test set, partition them into ten smaller datasets (each split into training and validation set), and wrap the resulting partitions by creating a PyTorch ``DataLoader`` for each of them:
fr: Chargeons maintenant l'ensemble de formation et de test CIFAR-10, partitionnons-les en dix ensembles de données plus petits (chacun divisé en ensemble de formation et de validation), et enveloppons les partitions résultantes en créant un PyTorch ``DataLoader`` pour chacun d'entre eux :
zh_hans: 现在，让我们加载 CIFAR-10 训练集和测试集，将它们分割成 10 个较小的数据集（每个数据集又分为训练集和验证集），并通过为每个数据集创建 PyTorch ``DataLoader`` 来包装由此产生的分割集：

source: We now have a list of ten training sets and ten validation sets (``trainloaders`` and ``valloaders``) representing the data of ten different organizations. Each ``trainloader``/``valloader`` pair contains 4500 training examples and 500 validation examples. There's also a single ``testloader`` (we did not split the test set). Again, this is only necessary for building research or educational systems, actual federated learning systems have their data naturally distributed across multiple partitions.
fr: Nous avons maintenant une liste de dix ensembles de formation et dix ensembles de validation (``trainloaders`` et ``valloaders``) représentant les données de dix organisations différentes. Chaque paire ``trainloader`/``valloader`` contient 4500 exemples de formation et 500 exemples de validation. Il y a également un seul ``testloader`` (nous n'avons pas divisé l'ensemble de test). Encore une fois, cela n'est nécessaire que pour construire des systèmes de recherche ou d'éducation, les systèmes d'apprentissage fédérés actuels ont leurs données naturellement distribuées à travers plusieurs partitions.
zh_hans: 现在，我们有一个包含十个训练集和十个验证集（`trainloaders`` 和`valloaders``）的列表，代表十个不同组织的数据。每对 ``trainloader``/``valloader`` 都包含 4500 个训练示例和 500 个验证数据。还有一个单独的 ``测试加载器``（我们没有拆分测试集）。同样，这只有在构建研究或教育系统时才有必要，实际的联邦学习系统的数据自然分布在多个分区中。

source: Let's take a look at the first batch of images and labels in the first training set (i.e., ``trainloaders[0]``) before we move on:
fr: Jetons un coup d'œil au premier lot d'images et d'étiquettes du premier ensemble d'entraînement (c'est-à-dire ``trainloaders[0]``) avant de poursuivre :
zh_hans: 在继续之前，让我们先看看第一个训练集中的第一批图像和标签（即 ``trainloaders[0]``）：

source: The output above shows a random batch of images from the first ``trainloader`` in our list of ten ``trainloaders``. It also prints the labels associated with each image (i.e., one of the ten possible labels we've seen above). If you run the cell again, you should see another batch of images.
fr: La sortie ci-dessus montre un lot aléatoire d'images provenant du premier ``chargeur de formation`` de notre liste de dix ``chargeurs de formation``. Elle imprime également les étiquettes associées à chaque image (c'est-à-dire l'une des dix étiquettes possibles que nous avons vues ci-dessus). Si tu exécutes à nouveau la cellule, tu devrais voir un autre lot d'images.
zh_hans: 上面的输出显示了来自十个 "trainloader "列表中第一个 "trainloader "的随机图像。它还打印了与每幅图像相关的标签（即我们上面看到的十个可能标签之一）。如果您再次运行该单元，应该会看到另一批图像。

source: Step 1: Centralized Training with PyTorch
fr: Étape 1 : Formation centralisée avec PyTorch
zh_hans: 步骤 1：使用 PyTorch 进行集中训练

source: Next, we're going to use PyTorch to define a simple convolutional neural network. This introduction assumes basic familiarity with PyTorch, so it doesn't cover the PyTorch-related aspects in full detail. If you want to dive deeper into PyTorch, we recommend `DEEP LEARNING WITH PYTORCH: A 60 MINUTE BLITZ <https://pytorch.org/tutorials/beginner/deep_learning_60min_blitz.html>`__.
fr: Ensuite, nous allons utiliser PyTorch pour définir un simple réseau neuronal convolutif. Cette introduction suppose une familiarité de base avec PyTorch, elle ne couvre donc pas en détail les aspects liés à PyTorch. Si tu veux plonger plus profondément dans PyTorch, nous te recommandons `DEEP LEARNING WITH PYTORCH : A 60 MINUTE BLITZ <https://pytorch.org/tutorials/beginner/deep_learning_60min_blitz.html>`__.
zh_hans: 接下来，我们将使用 PyTorch 来定义一个简单的卷积神经网络。本介绍假定您对 PyTorch 有基本的了解，因此不会详细介绍与 PyTorch 相关的内容。如果你想更深入地了解 PyTorch，我们推荐你阅读 `DEEP LEARNING WITH PYTORCH： a 60 minute blitz <https://pytorch.org/tutorials/beginner/deep_learning_60min_blitz.html>`__。

source: Defining the model
fr: Définir le modèle
zh_hans: 定义模型

source: We use the simple CNN described in the `PyTorch tutorial <https://pytorch.org/tutorials/beginner/blitz/cifar10_tutorial.html#define-a-convolutional-neural-network>`__:
fr: Nous utilisons le CNN simple décrit dans le tutoriel `PyTorch <https://pytorch.org/tutorials/beginner/blitz/cifar10_tutorial.html#define-a-convolutional-neural-network>`__ :
zh_hans: 我们使用` PyTorch 教程 <https://pytorch.org/tutorials/beginner/blitz/cifar10_tutorial.html#define-a-convolutional-neural-network>`__ 中描述的简单 CNN：

source: Let's continue with the usual training and test functions:
fr: Poursuivons avec les fonctions habituelles de formation et de test :
zh_hans: 让我们继续进行常规的训练和测试功能：

source: Training the model
fr: Entraîne le modèle
zh_hans: 训练模型
