Repository: lucacorbucci/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: fr, zh_hans

source: For simulations that use the Virtual Client Engine, ``flwr`` pre-releases should be installed with the ``simulation`` extra::
fr: Pour les simulations qui utilisent le moteur de client virtuel, les versions de ``flwr`` doivent être installées avec l'option ``simulation``: :
zh_hans: 对于使用虚拟客户端引擎的模拟，`flwr``预发行版应与`simulation``一起安装：

source: Install nightly release
fr: Installer la version nightly
zh_hans: 安装隔夜版本

source: The latest (potentially unstable) changes in Flower are available as nightly releases::
fr: Les dernières modifications (potentiellement instables) de Flower sont disponibles sous forme de versions nocturnes: :
zh_hans: Flower 中最新（可能不稳定）的更改以隔夜发布的形式提供：：

source: For simulations that use the Virtual Client Engine, ``flwr-nightly`` should be installed with the ``simulation`` extra::
fr: Pour les simulations qui utilisent le moteur de client virtuel, ``flwr-nightly`` doit être installé avec l'option ``simulation``: :
zh_hans: 对于使用虚拟客户端引擎的模拟，`flwr-nightly`应与`simulation`一起安装：

source: Monitor simulation
zh_hans: 监控模拟

source: Flower allows you to monitor system resources while running your simulation. Moreover, the Flower simulation engine is powerful and enables you to decide how to allocate resources per client manner and constrain the total usage. Insights from resource consumption can help you make smarter decisions and speed up the execution time.
fr: Flower te permet de surveiller les ressources du système pendant l'exécution de ta simulation. De plus, le moteur de simulation de Flower est puissant et te permet de décider comment allouer les ressources par manière de client et de limiter l'utilisation totale. Les informations sur la consommation des ressources peuvent t'aider à prendre des décisions plus intelligentes et à accélérer le temps d'exécution.
zh_hans: Flower 允许您在运行模拟时监控系统资源。此外，Flower 仿真引擎功能强大，能让您决定如何按客户端方式分配资源并限制总使用量。从资源消耗中获得的观察可以帮助您做出更明智的决策，并加快执行时间。

source: The specific instructions assume you are using macOS and have the `Homebrew <https://brew.sh/>`_ package manager installed.
fr: Les instructions spécifiques supposent que tu utilises macOS et que le gestionnaire de paquets `Homebrew <https://brew.sh/>`_ est installé.
zh_hans: 具体说明假定你使用的是 macOS，并且安装了 `Homebrew <https://brew.sh/>`_ 软件包管理器。

source: Downloads
fr: Téléchargements
zh_hans: 下载

source: `Prometheus <https://prometheus.io/>`_ is used for data collection, while `Grafana <https://grafana.com/>`_ will enable you to visualize the collected data. They are both well integrated with `Ray <https://www.ray.io/>`_ which Flower uses under the hood.
fr: `Prometheus <https://prometheus.io/>`_ est utilisé pour la collecte de données, tandis que `Grafana <https://grafana.com/>`_ te permettra de visualiser les données collectées. Ils sont tous deux bien intégrés à `Ray <https://www.ray.io/>`_ que Flower utilise sous le capot.
zh_hans: `Prometheus <https://prometheus.io/>`_ 用于收集数据，而 `Grafana <https://grafana.com/>`_ 则能让你将收集到的数据可视化。它们都与 Flower 在引擎下使用的 `Ray <https://www.ray.io/>`_ 紧密集成。

source: Overwrite the configuration files (depending on your device, it might be installed on a different path).
fr: Écrase les fichiers de configuration (selon ton appareil, il se peut qu'il soit installé sur un chemin différent).
zh_hans: 重写配置文件（根据设备的不同，可能安装在不同的路径上）。

source: If you are on an M1 Mac, it should be:
fr: Si tu es sur un Mac M1, il devrait l'être :
zh_hans: 如果你使用的是 M1 Mac，应该是这样：

source: On the previous generation Intel Mac devices, it should be:
fr: Sur les appareils Mac Intel de la génération précédente, ce devrait être le cas :
zh_hans: 在上一代英特尔 Mac 设备上，应该是这样：

source: Open the respective configuration files and change them. Depending on your device, use one of the two following commands:
fr: Ouvre les fichiers de configuration respectifs et modifie-les. Selon ton appareil, utilise l'une des deux commandes suivantes :
zh_hans: 打开相应的配置文件并修改它们。根据设备情况，使用以下两个命令之一：

source: and then delete all the text in the file and paste a new Prometheus config you see below. You may adjust the time intervals to your requirements:
fr: puis supprime tout le texte du fichier et colle une nouvelle configuration Prometheus que tu vois ci-dessous. Tu peux adapter les intervalles de temps à tes besoins :
zh_hans: 然后删除文件中的所有文本，粘贴一个新的 Prometheus 配置文件，如下所示。您可以根据需要调整时间间隔：

source: Now after you have edited the Prometheus configuration, do the same with the Grafana configuration files. Open those using one of the following commands as before:
fr: Maintenant, après avoir édité la configuration de Prometheus, fais de même avec les fichiers de configuration de Grafana. Ouvre ces derniers à l'aide de l'une des commandes suivantes, comme précédemment :
zh_hans: 编辑完 Prometheus 配置后，请对 Grafana 配置文件执行同样的操作。与之前一样，使用以下命令之一打开这些文件：

source: Your terminal editor should open and allow you to apply the following configuration as before.
fr: Ton éditeur de terminal devrait s'ouvrir et te permettre d'appliquer la configuration suivante comme précédemment.
zh_hans: 您的终端编辑器应该会打开，并允许您像之前一样应用以下配置。

source: Congratulations, you just downloaded all the necessary software needed for metrics tracking. Now, let’s start it.
fr: Félicitations, tu viens de télécharger tous les logiciels nécessaires au suivi des métriques, maintenant, démarrons-le.
zh_hans: 恭喜您，您刚刚下载了指标跟踪所需的所有软件。现在，让我们开始吧。

source: Tracking metrics
fr: Suivi des mesures
zh_hans: 跟踪指标

source: Before running your Flower simulation, you have to start the monitoring tools you have just installed and configured.
fr: Avant de lancer ta simulation Flower, tu dois démarrer les outils de surveillance que tu viens d'installer et de configurer.
zh_hans: 在运行 Flower 模拟之前，您必须启动刚刚安装和配置的监控工具。

source: Please include the following argument in your Python code when starting a simulation.
fr: Tu dois inclure l'argument suivant dans ton code Python lorsque tu démarres une simulation.
zh_hans: 开始模拟时，请在 Python 代码中加入以下参数。

source: Now, you are ready to start your workload.
fr: Maintenant, tu es prêt à commencer ta charge de travail.
zh_hans: 现在，您可以开始工作了。

source: Shortly after the simulation starts, you should see the following logs in your terminal:
fr: Peu de temps après le début de la simulation, tu devrais voir les journaux suivants dans ton terminal :
zh_hans: 模拟启动后不久，您就会在终端中看到以下日志：

source: You can look at everything at `<http://127.0.0.1:8265>`_ .
fr: Tu peux tout regarder sur `<http://127.0.0.1:8265>`_ .
zh_hans: 您可以在 `<http://127.0.0.1:8265>`_ 查看所有内容。

source: It's a Ray Dashboard. You can navigate to Metrics (on the left panel, the lowest option).
fr: Il s'agit d'un tableau de bord Ray. Tu peux naviguer vers Metrics (sur le panneau de gauche, l'option la plus basse).
zh_hans: 这是一个 Ray Dashboard。您可以导航到 "度量标准"（左侧面板，最低选项）。

source: Or alternatively, you can just see them in Grafana by clicking on the right-up corner, “View in Grafana”. Please note that the Ray dashboard is only accessible during the simulation. After the simulation ends, you can only use Grafana to explore the metrics. You can start Grafana by going to ``http://localhost:3000/``.
fr: Ou alors, tu peux simplement les voir dans Grafana en cliquant sur le coin supérieur droit, "View in Grafana". Sache que le tableau de bord Ray n'est accessible que pendant la simulation. Une fois la simulation terminée, tu ne peux utiliser Grafana que pour explorer les métriques. Tu peux démarrer Grafana en te rendant sur `http://localhost:3000/``.
zh_hans: 或者，您也可以点击右上角的 "在 Grafana 中查看"，在 Grafana 中查看它们。请注意，Ray 仪表盘只能在模拟期间访问。模拟结束后，您只能使用 Grafana 浏览指标。您可以访问 ``http://localhost:3000/``启动 Grafana。

source: After you finish the visualization, stop Prometheus and Grafana. This is important as they will otherwise block, for example port :code:`3000` on your machine as long as they are running.
fr: Après avoir terminé la visualisation, arrête Prometheus et Grafana. C'est important car sinon ils bloqueront, par exemple, le port :code:`3000` sur ta machine tant qu'ils seront en cours d'exécution.
zh_hans: 完成可视化后，请停止 Prometheus 和 Grafana。这一点很重要，否则只要它们在运行，就会阻塞机器上的端口 :code:`3000`。

source: Resource allocation
fr: Allocation des ressources
zh_hans: 资源分配

source: You must understand how the Ray library works to efficiently allocate system resources to simulation clients on your own.
fr: Tu dois comprendre le fonctionnement de la bibliothèque Ray pour allouer efficacement les ressources du système aux clients de simulation de ton côté.
zh_hans: 您必须了解 Ray 库是如何工作的，才能有效地为自己的仿真客户端分配系统资源。

source: Initially, the simulation (which Ray handles under the hood) starts by default with all the available resources on the system, which it shares among the clients. It doesn't mean it divides it equally among all of them, nor that the model training happens at all of them simultaneously. You will learn more about that in the later part of this blog. You can check the system resources by running the following:
fr: Au départ, la simulation (que Ray gère sous le capot) démarre par défaut avec toutes les ressources disponibles sur le système, qu'elle partage entre les clients. Cela ne signifie pas qu'elle les divise de manière égale entre tous, ni que l'apprentissage du modèle se fait sur tous les clients simultanément. Tu en apprendras plus à ce sujet dans la suite de ce blog. Tu peux vérifier les ressources du système en exécutant ce qui suit :
zh_hans: 最初，模拟（由 Ray 在引擎下处理）默认使用系统上的所有可用资源启动，并在客户端之间共享。但这并不意味着它会将资源平均分配给所有客户端，也不意味着模型训练会在所有客户端同时进行。您将在本博客的后半部分了解到更多相关信息。您可以运行以下命令检查系统资源：

source: In Google Colab, the result you see might be similar to this:
fr: Dans Google Colab, le résultat que tu obtiens peut ressembler à ceci :
zh_hans: 在 Google Colab 中，您看到的结果可能与此类似：

source: However, you can overwrite the defaults. When starting a simulation, do the following (you don't need to overwrite all of them):
fr: Cependant, tu peux écraser les valeurs par défaut. Lorsque tu démarres une simulation, fais ce qui suit (tu n'as pas besoin de les écraser toutes) :
zh_hans: 不过，您可以覆盖默认值。开始模拟时，请执行以下操作（不必全部覆盖）：

source: Let’s also specify the resource for a single client.
fr: Spécifions également la ressource pour un seul client.
zh_hans: 我们还可以为单个客户指定资源。

source: Now comes the crucial part. Ray will start a new client only when it has all the required resources (such that they run in parallel) when the resources allow.
fr: Ray ne démarrera un nouveau client que lorsqu'il disposera de toutes les ressources nécessaires (de manière à ce qu'ils fonctionnent en parallèle) lorsque les ressources le permettront.
zh_hans: 现在到了关键部分。只有在资源允许的情况下，Ray 才会在拥有所有所需资源（如并行运行）时启动新客户端。

source: In the example above, only one client will be run, so your clients won't run concurrently. Setting :code:`client_num_gpus = 0.5` would allow running two clients and therefore enable them to run concurrently. Be careful not to require more resources than available. If you specified :code:`client_num_gpus = 2`, the simulation wouldn't start (even if you had 2 GPUs but decided to set 1 in :code:`ray_init_args`).
fr: Dans l'exemple ci-dessus, un seul client sera exécuté, donc tes clients ne fonctionneront pas simultanément. En définissant :code:`client_num_gpus = 0.5`, tu pourras exécuter deux clients et donc les faire fonctionner simultanément. Fais attention à ne pas demander plus de ressources que celles disponibles. Si tu as spécifié :code:`client_num_gpus = 2`, la simulation ne démarrera pas (même si tu as 2 GPU mais que tu as décidé d'en définir 1 dans :code:`ray_init_args`).
zh_hans: 在上面的示例中，将只运行一个客户端，因此您的客户端不会并发运行。设置 :code:`client_num_gpus = 0.5` 将允许运行两个客户端，从而使它们能够并发运行。请注意，所需的资源不要超过可用资源。如果您指定 :code:`client_num_gpus = 2`，模拟将无法启动（即使您有 2 个 GPU，但决定在 :code:`ray_init_args` 中设置为 1）。

source: FAQ
zh_hans: 常见问题

source: Q: I don't see any metrics logged.
fr: Q : Je ne vois aucune mesure enregistrée.
zh_hans: 问：我没有看到任何指标记录。

source: A: The timeframe might not be properly set. The setting is in the top right corner ("Last 30 minutes" by default). Please change the timeframe to reflect the period when the simulation was running.
fr: R : Il se peut que le délai ne soit pas correctement défini. Le paramètre se trouve dans le coin supérieur droit ("Dernières 30 minutes" par défaut). Modifie le délai pour qu'il corresponde à la période pendant laquelle la simulation s'est déroulée.
zh_hans: 答：时间范围可能没有正确设置。设置在右上角（默认为 "最后 30 分钟"）。请更改时间框架，以反映模拟运行的时间段。

source: Q: I see “Grafana server not detected. Please make sure the Grafana server is running and refresh this page” after going to the Metrics tab in Ray Dashboard.
fr: Q : Je vois s'afficher "Serveur Grafana non détecté. Vérifie que le serveur Grafana fonctionne et actualise cette page" après avoir accédé à l'onglet Métriques dans Ray Dashboard.
zh_hans: 问：我看到 "未检测到 Grafana 服务器。请确保 Grafana 服务器正在运行并刷新此页面"。

source: A: You probably don't have Grafana running. Please check the running services
fr: R : Grafana n'est probablement pas en cours d'exécution. Vérifie les services en cours d'exécution
zh_hans: 答：您可能没有运行 Grafana。请检查正在运行的服务

source: Q: I see "This site can't be reached" when going to `<http://127.0.0.1:8265>`_.
fr: Q : Je vois "This site can't be reached" quand je vais sur `<http://127.0.0.1:8265>`_.
zh_hans: 问：在访问 `<http://127.0.0.1:8265>`_时，我看到 "无法访问该网站"。

source: A: Either the simulation has already finished, or you still need to start Prometheus.
fr: R : Soit la simulation est déjà terminée, soit tu dois encore démarrer Prometheus.
zh_hans: 答：要么模拟已经完成，要么您还需要启动Prometheus。

source: Resources
fr: Ressources
zh_hans: 资源

source: Ray Dashboard: `<https://docs.ray.io/en/latest/ray-core/ray-dashboard.html>`_
fr: Tableau de bord Ray : `<https://docs.ray.io/en/latest/ray-core/ray-dashboard.html>`_
zh_hans: Ray 仪表盘: `<https://docs.ray.io/en/latest/ray-core/ray-dashboard.html>`_

source: Ray Metrics: `<https://docs.ray.io/en/latest/ray-observability/ray-metrics.html>`_
zh_hans: Ray 指标: `<https://docs.ray.io/en/latest/ray-observability/ray-metrics.html>`_

source: Run simulations
zh_hans: 运行模拟

source: Simulating Federated Learning workloads is useful for a multitude of use-cases: you might want to run your workload on a large cohort of clients but without having to source, configure and mange a large number of physical devices; you might want to run your FL workloads as fast as possible on the compute systems you have access to without having to go through a complex setup process; you might want to validate your algorithm on different scenarios at varying levels of data and system heterogeneity, client availability, privacy budgets, etc. These are among some of the use-cases where simulating FL workloads makes sense. Flower can accommodate these scenarios by means of its `VirtualClientEngine <contributor-explanation-architecture.html#virtual-client-engine>`_ or VCE.
zh_hans: 模拟联邦学习工作负载可用于多种案例：您可能希望在大量客户端上运行您的工作负载，但无需采购、配置和管理大量物理设备；您可能希望在您可以访问的计算系统上尽可能快地运行您的 FL 工作负载，而无需经过复杂的设置过程；您可能希望在不同数据和系统异构性、客户端可用性、隐私预算等不同水平的场景中验证您的算法。这些都是模拟 FL 工作负载的一些案例。Flower 可以通过其 "虚拟客户端引擎"（VirtualClientEngine）<contributor-explanation-architecture.html#virtual-client-engine>_或 VCE 来匹配这些情况。

source: The :code:`VirtualClientEngine` schedules, launches and manages `virtual` clients. These clients are identical to `non-virtual` clients (i.e. the ones you launch via the command `flwr.client.start_client <ref-api-flwr.html#start-client>`_) in the sense that they can be configure by creating a class inheriting, for example, from `flwr.client.NumPyClient <ref-api-flwr.html#flwr.client.NumPyClient>`_ and therefore behave in an identical way. In addition to that, clients managed by the :code:`VirtualClientEngine` are:
zh_hans: :code:`VirtualClientEngine`用来规划，启动和管理`虚拟`客户端。这些客户端跟`非虚拟`客户端是一样的（即为您通过`flwr.client.start_client <ref-api-flwr.html#start-client>`_启动的客户端），因为它们可以通过创建一个继承自 `flwr.client.NumPyClient <ref-api-flwr.html#flwr.client.NumPyClient>`_ 的类进行配置，因此其行为方式相同。另外，由 `VirtualClientEngine` 管理的客户端有：

source: resource-aware: this means that each client gets assigned a portion of the compute and memory on your system. You as a user can control this at the beginning of the simulation and allows you to control the degree of parallelism of your Flower FL simulation. The fewer the resources per client, the more clients can run concurrently on the same hardware.
zh_hans: 资源感知：这意味着每个客户端都会分配到系统中的一部分计算和内存。作为用户，您可以在模拟开始时对其进行控制，从而控制 Flower FL 模拟的并行程度。每个客户端的资源越少，在同一硬件上并发运行的客户端就越多。

source: self-managed: this means that you as a user do not need to launch clients manually, instead this gets delegated to :code:`VirtualClientEngine`'s internals.
zh_hans: 自管理：这意味着用户无需手动启动客户端，而是由 :code:`VirtualClientEngine` 负责。

source: ephemeral: this means that a client is only materialized when it is required in the FL process (e.g. to do `fit() <ref-api-flwr.html#flwr.client.Client.fit>`_). The object is destroyed afterwards, releasing the resources it was assigned and allowing in this way other clients to participate.
zh_hans: 即时性：这意味着客户端只有在 FL 进程中需要它时才会被实体化（例如执行 `fit() <ref-api-flwr.html#flwr.client.Client.fit>`_ ）。之后该对象将被销毁，释放分配给它的资源，并允许其他客户端以这种方式参与。

source: The :code:`VirtualClientEngine` implements `virtual` clients using `Ray <https://www.ray.io/>`_, an open-source framework for scalable Python workloads. In particular, Flower's :code:`VirtualClientEngine` makes use of `Actors <https://docs.ray.io/en/latest/ray-core/actors.html>`_ to spawn `virtual` clients and run their workload.
zh_hans: :code:`VirtualClientEngine`使用`Ray <https://www.ray.io/>`_来实现`虚拟`客户端，这是一个用于可扩展 Python 工作负载的开源框架。特别地，Flower 的 :code:`VirtualClientEngine` 使用 `Actors <https://docs.ray.io/en/latest/ray-core/actors.html>`_ 来生成 `virtual` 客户端并运行它们的工作负载。

source: Launch your Flower simulation
zh_hans: 启动 Flower 模拟

source: Running Flower simulations still require you to define your client class, a strategy, and utility functions to download and load (and potentially partition) your dataset. With that out of the way, launching your simulation is done with `start_simulation <ref-api-flwr.html#flwr.simulation.start_simulation>`_ and a minimal example looks as follows:
zh_hans: 运行 Flower 模拟器仍然需要定义客户端类、策略以及下载和加载（可能还需要分割）数据集的实用程序。在完成这些工作后，就可以使用 "start_simulation <ref-api-flwr.html#flwr.simulation.start_simulation>`_" 来启动模拟了，一个最简单的示例如下：

source: VirtualClientEngine resources
zh_hans: 虚拟客户端引擎资源

source: By default the VCE has access to all system resources (i.e. all CPUs, all GPUs, etc) since that is also the default behavior when starting Ray. However, in some settings you might want to limit how many of your system resources are used for simulation. You can do this via the :code:`ray_init_args` input argument to :code:`start_simulation` which the VCE internally passes to Ray's :code:`ray.init` command. For a complete list of settings you can configure check the `ray.init <https://docs.ray.io/en/latest/ray-core/api/doc/ray.init.html#ray-init>`_ documentation. Do not set :code:`ray_init_args` if you want the VCE to use all your system's CPUs and GPUs.
zh_hans: 默认情况下，VCE 可以访问所有系统资源（即所有 CPU、所有 GPU 等），因为这也是启动 Ray 时的默认行为。不过，在某些设置中，您可能希望限制有多少系统资源用于模拟。您可以通过 :code:`ray_init_args` 输入到 :code:`start_simulation` 的参数来做到这一点，VCE 会在内部将该参数传递给 Ray 的 :code:`ray.init` 命令。有关您可以配置的设置的完整列表，请查看 `ray.init <https://docs.ray.io/en/latest/ray-core/api/doc/ray.init.html#ray-init>`_ 文档。如果希望 VCE 使用系统中所有的 CPU 和 GPU，请不要设置 :code:`ray_init_args`。

source: Assigning client resources
zh_hans: 分配客户端资源

source: By default the :code:`VirtualClientEngine` assigns a single CPU core (and nothing else) to each virtual client. This means that if your system has 10 cores, that many virtual clients can be concurrently running.
zh_hans: 默认情况下，:code:`VirtualClientEngine` 会为每个虚拟客户端分配一个 CPU 内核（不分配其他任何内核）。这意味着，如果系统有 10 个内核，那么可以同时运行这么多虚拟客户端。

source: More often than not, you would probably like to adjust the resources your clients get assigned based on the complexity (i.e. compute and memory footprint) of your FL workload. You can do so when starting your simulation by setting the argument `client_resources` to `start_simulation <ref-api-flwr.html#flwr.simulation.start_simulation>`_. Two keys are internally used by Ray to schedule and spawn workloads (in our case Flower clients):
zh_hans: 通常情况下，您可能希望根据 FL 工作负载的复杂性（即计算和内存占用）来调整分配给客户端的资源。您可以在启动模拟时将参数 `client_resources` 设置为 `start_simulation <ref-api-flwr.html#flwr.simulation.start_simulation>`_ 。Ray 内部使用两个键来调度和生成工作负载（在我们的例子中是 Flower 客户端）：

source: :code:`num_cpus` indicates the number of CPU cores a client would get.
zh_hans: :code:`num_cpus` 表示客户端将获得的 CPU 内核数量。

source: :code:`num_gpus` indicates the **ratio** of GPU memory a client gets assigned.
zh_hans: :code:`num_gpus` 表示分配给客户端的 GPU 内存的**比例**。

source: Let's see a few examples:
zh_hans: 让我们来看几个例子：

source: While the :code:`client_resources` can be used to control the degree of concurrency in your FL simulation, this does not stop you from running dozens, hundreds or even thousands of clients in the same round and having orders of magnitude more `dormant` (i.e. not participating in a round) clients. Let's say you want to have 100 clients per round but your system can only accommodate 8 clients concurrently. The :code:`VirtualClientEngine` will schedule 100 jobs to run (each simulating a client sampled by the strategy) and then will execute them in a resource-aware manner in batches of 8.
zh_hans: 虽然 :code:`client_resources` 可用来控制 FL 模拟的并发程度，但这并不能阻止您在同一轮模拟中运行几十、几百甚至上千个客户端，并拥有数量级更多的 "休眠"（即不参与一轮模拟）客户端。比方说，您希望每轮有 100 个客户端，但您的系统只能同时容纳 8 个客户端。:code:`VirtualClientEngine` 将安排运行 100 个工作（每个工作模拟策略采样的一个客户端），然后以资源感知的方式分批执行。

source: To understand all the intricate details on how resources are used to schedule FL clients and how to define custom resources, please take a look at the `Ray documentation <https://docs.ray.io/en/latest/ray-core/scheduling/resources.html>`_.
zh_hans: 要了解资源如何用于调度 FL 客户端以及如何定义自定义资源的所有复杂细节，请查看 `Ray 文档 <https://docs.ray.io/en/latest/ray-core/scheduling/resources.html>`_。

source: Simulation examples
zh_hans: 模拟示例

source: A few ready-to-run complete examples for Flower simulation in Tensorflow/Keras and PyTorch are provided in the `Flower repository <https://github.com/adap/flower>`_. You can run them on Google Colab too:
zh_hans: 在 Tensorflow/Keras 和 PyTorch 中进行 Flower 模拟的几个可随时运行的完整示例已在 `Flower 库 <https://github.com/adap/flower>`_ 中提供。您也可以在 Google Colab 上运行它们：

source: `Tensorflow/Keras Simulation <https://github.com/adap/flower/tree/main/examples/simulation-tensorflow>`_: 100 clients collaboratively train a MLP model on MNIST.
zh_hans: Tensorflow/Keras模拟 <https://github.com/adap/flower/tree/main/examples/simulation-tensorflow>`_：100个客户端在MNIST上协作训练一个MLP模型。

source: `PyTorch Simulation <https://github.com/adap/flower/tree/main/examples/simulation-pytorch>`_: 100 clients collaboratively train a CNN model on MNIST.
zh_hans: PyTorch 模拟 <https://github.com/adap/flower/tree/main/examples/simulation-pytorch>`_：100 个客户端在 MNIST 上协作训练一个 CNN 模型。

source: Multi-node Flower simulations
zh_hans: 多节点 Flower 模拟

source: Flower's :code:`VirtualClientEngine` allows you to run FL simulations across multiple compute nodes. Before starting your multi-node simulation ensure that you:
zh_hans: Flower 的 :code:`VirtualClientEngine` 允许您在多个计算节点上运行 FL 模拟。在开始多节点模拟之前，请确保：

source: Have the same Python environment in all nodes.
zh_hans: 所有节点都有相同的 Python 环境。

source: Have a copy of your code (e.g. your entire repo) in all nodes.
zh_hans: 在所有节点上都有一份代码副本（例如整个软件包）。

source: Have a copy of your dataset in all nodes (more about this in :ref:`simulation considerations <considerations-for-simulations>`)
zh_hans: 在所有节点中都有一份数据集副本（更多相关信息请参阅 :ref:`模拟注意事项<considerations-for-simulations>`）
