Repository: lucacorbucci/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: fr, zh_hans

source: The concept of federating an existing workload is always the same and easy to understand. We have to start a *server* and then use the code in :code:`jax_training.py` for the *clients* that are connected to the *server*. The *server* sends model parameters to the clients. The *clients* run the training and update the parameters. The updated parameters are sent back to the *server*, which averages all received parameter updates. This describes one round of the federated learning process, and we repeat this for multiple rounds.
fr: Le concept de fédération d'une charge de travail existante est toujours le même et facile à comprendre. Nous devons démarrer un *serveur*, puis utiliser le code dans :code:`jax_training.py` pour les *clients* qui sont connectés au *serveur*.Le *serveur* envoie les paramètres du modèle aux clients.Les *clients* exécutent la formation et mettent à jour les paramètres.Les paramètres mis à jour sont renvoyés au *serveur*, qui fait la moyenne de toutes les mises à jour de paramètres reçues.Ceci décrit un tour du processus d'apprentissage fédéré, et nous répétons cette opération pour plusieurs tours.
zh_hans: 把现有工作联邦化的概念始终是相同的，也很容易理解。我们要启动一个*服务器*，然后对连接到*服务器*的*客户端*运行 :code:`jax_training.py`中的代码。*服务器*向客户端发送模型参数，*客户端*运行训练并更新参数。更新后的参数被发回*服务器*，然后服务器对所有收到的参数进行平均聚合。以上的描述构成了一轮联邦学习，我们将重复进行多轮学习。

source: Our example consists of one *server* and two *clients*. Let's set up :code:`server.py` first. The *server* needs to import the Flower package :code:`flwr`. Next, we use the :code:`start_server` function to start a server and tell it to perform three rounds of federated learning.
fr: Notre exemple consiste en un *serveur* et deux *clients*. Commençons par configurer :code:`server.py`. Le *serveur* doit importer le paquet Flower :code:`flwr`. Ensuite, nous utilisons la fonction :code:`start_server` pour démarrer un serveur et lui demander d'effectuer trois cycles d'apprentissage fédéré.
zh_hans: 我们的示例包括一个*服务器*和两个*客户端*。让我们先设置 :code:`server.py`。*服务器*需要导入 Flower 软件包 :code:`flwr`。接下来，我们使用 :code:`start_server` 函数启动服务器，并让它执行三轮联邦学习。

source: We can already start the *server*:
fr: Nous pouvons déjà démarrer le *serveur* :
zh_hans: 我们已经可以启动*服务器*了：

source: Finally, we will define our *client* logic in :code:`client.py` and build upon the previously defined JAX training in :code:`jax_training.py`. Our *client* needs to import :code:`flwr`, but also :code:`jax` and :code:`jaxlib` to update the parameters on our JAX model:
fr: Enfin, nous allons définir la logique de notre *client* dans :code:`client.py` et nous appuyer sur la formation JAX définie précédemment dans :code:`jax_training.py`. Notre *client* doit importer :code:`flwr`, mais aussi :code:`jax` et :code:`jaxlib` pour mettre à jour les paramètres de notre modèle JAX :
zh_hans: 最后，我们将在 :code:`client.py` 中定义我们的 *client* 逻辑，并以之前在 :code:`jax_training.py` 中定义的 JAX 训练为基础。我们的 *client* 需要导入 :code:`flwr`，还需要导入 :code:`jax` 和 :code:`jaxlib` 以更新 JAX 模型的参数：

source: Implementing a Flower *client* basically means implementing a subclass of either :code:`flwr.client.Client` or :code:`flwr.client.NumPyClient`. Our implementation will be based on :code:`flwr.client.NumPyClient` and we'll call it :code:`FlowerClient`. :code:`NumPyClient` is slightly easier to implement than :code:`Client` if you use a framework with good NumPy interoperability (like JAX) because it avoids some of the boilerplate that would otherwise be necessary. :code:`FlowerClient` needs to implement four methods, two methods for getting/setting model parameters, one method for training the model, and one method for testing the model:
fr: L'implémentation d'un *client* Flower signifie essentiellement l'implémentation d'une sous-classe de :code:`flwr.client.Client` ou :code:`flwr.client.NumPyClient`. Notre implémentation sera basée sur :code:`flwr.client.NumPyClient` et nous l'appellerons :code:`FlowerClient`. :code:`NumPyClient` est légèrement plus facile à implémenter que :code:`Client` si vous utilisez un framework avec une bonne interopérabilité NumPy (comme JAX) parce qu'il évite une partie du boilerplate qui serait autrement nécessaire. :code:`FlowerClient` doit implémenter quatre méthodes, deux méthodes pour obtenir/régler les paramètres du modèle, une méthode pour former le modèle, et une méthode pour tester le modèle :
zh_hans: 实现一个 Flower *client*基本上意味着去实现一个 :code:`flwr.client.Client` 或 :code:`flwr.client.NumPyClient` 的子类。我们的代码实现将基于 :code:`flwr.client.NumPyClient`，并将其命名为 :code:`FlowerClient`。如果使用具有良好 NumPy 互操作性的框架（如 JAX），:code:`NumPyClient` 比 :code:`Client`更容易实现，因为它避免了一些不必要的操作。:code:`FlowerClient` 需要实现四个方法，两个用于获取/设置模型参数，一个用于训练模型，一个用于测试模型：

source: :code:`set_parameters (optional)`
zh_hans: :code:`set_parameters (可选)`

source: set the model parameters on the local model that are received from the server
fr: règle les paramètres du modèle local reçus du serveur
zh_hans: 在本地模型上设置从服务器接收的模型参数

source: transform parameters to NumPy :code:`ndarray`'s
fr: transforme les paramètres en NumPy :code:`ndarray`'s
zh_hans: 将参数转换为 NumPy :code:`ndarray`格式

source: loop over the list of model parameters received as NumPy :code:`ndarray`'s (think list of neural network layers)
fr: boucle sur la liste des paramètres du modèle reçus sous forme de NumPy :code:`ndarray`'s (pensez à la liste des couches du réseau neuronal)
zh_hans: 循环遍历以 NumPy :code:`ndarray` 形式接收的模型参数列表（可以看作神经网络的列表）

source: get the model parameters and return them as a list of NumPy :code:`ndarray`'s (which is what :code:`flwr.client.NumPyClient` expects)
fr: récupère les paramètres du modèle et les renvoie sous forme de liste de :code:`ndarray` NumPy (ce qui correspond à ce que :code:`flwr.client.NumPyClient` attend)
zh_hans: 获取模型参数，并以 NumPy :code:`ndarray`的列表形式返回（这正是 :code:`flwr.client.NumPyClient`所匹配的格式）

source: update the parameters of the local model with the parameters received from the server
fr: mettre à jour les paramètres du modèle local avec les paramètres reçus du serveur
zh_hans: 用从服务器接收到的参数更新本地模型的参数

source: train the model on the local training set
fr: entraîne le modèle sur l'ensemble d'apprentissage local
zh_hans: 在本地训练集上训练模型

source: get the updated local model parameters and return them to the server
fr: récupère les paramètres du modèle local mis à jour et les renvoie au serveur
zh_hans: 获取更新后的本地模型参数并返回服务器

source: evaluate the updated model on the local test set
fr: évaluer le modèle mis à jour sur l'ensemble de test local
zh_hans: 在本地测试集上评估更新后的模型

source: return the local loss to the server
fr: renvoie la perte locale au serveur
zh_hans: 向服务器返回本地损失值

source: The challenging part is to transform the JAX model parameters from :code:`DeviceArray` to :code:`NumPy ndarray` to make them compatible with `NumPyClient`.
fr: La partie la plus difficile consiste à transformer les paramètres du modèle JAX de :code:`DeviceArray` en :code:`NumPy ndarray` pour les rendre compatibles avec `NumPyClient`.
zh_hans: 具有挑战性的部分是将 JAX 模型参数从 :code:`DeviceArray` 转换为 :code:`NumPy ndarray`，使其与 `NumPyClient` 兼容。

source: The two :code:`NumPyClient` methods :code:`fit` and :code:`evaluate` make use of the functions :code:`train()` and :code:`evaluate()` previously defined in :code:`jax_training.py`. So what we really do here is we tell Flower through our :code:`NumPyClient` subclass which of our already defined functions to call for training and evaluation. We included type annotations to give you a better understanding of the data types that get passed around.
fr: Les deux méthodes :code:`NumPyClient` :code:`fit` et :code:`evaluate` utilisent les fonctions :code:`train()` et :code:`evaluate()` définies précédemment dans :code:`jax_training.py`. Ce que nous faisons vraiment ici, c'est que nous indiquons à Flower, par le biais de notre sous-classe :code:`NumPyClient`, laquelle de nos fonctions déjà définies doit être appelée pour l'entraînement et l'évaluation. Nous avons inclus des annotations de type pour te donner une meilleure compréhension des types de données qui sont transmis.
zh_hans: 这两个 :code:`NumPyClient` 方法 :code:`fit` 和 :code:`evaluate` 使用了之前在 :code:`jax_training.py` 中定义的函数 :code:`train()` 和 :code:`evaluate()`。因此，我们在这里要做的就是通过 :code:`NumPyClient` 子类告知 Flower 在训练和评估时要调用哪些已定义的函数。我们加入了类型注解，以便让您更好地理解传递的数据类型。

source: Having defined the federation process, we can run it.
fr: Après avoir défini le processus de fédération, nous pouvons l'exécuter.
zh_hans: 定义了联邦进程后，我们就可以运行它了。

source: And that's it. You can now open two additional terminal windows and run
fr: Tu peux maintenant ouvrir deux autres fenêtres de terminal et exécuter les commandes suivantes
zh_hans: 就是这样，现在你可以打开另外两个终端窗口，然后运行

source: in each window (make sure that the server is still running before you do so) and see your JAX project run federated learning across two clients. Congratulations!
fr: dans chaque fenêtre (assure-toi que le serveur est toujours en cours d'exécution avant de le faire) et tu verras que ton projet JAX exécute l'apprentissage fédéré sur deux clients. Félicitations !
zh_hans: 确保服务器仍在运行，然后在每个客户端窗口就能看到你的 JAX 项目在两个客户端上运行联邦学习了。祝贺!

source: The source code of this example was improved over time and can be found here: `Quickstart JAX <https://github.com/adap/flower/blob/main/examples/quickstart-jax>`_. Our example is somewhat over-simplified because both clients load the same dataset.
zh_hans: 此示例的源代码经过长期改进，可在此处找到： `Quickstart JAX <https://github.com/adap/flower/blob/main/examples/quickstart-jax>`_。我们的示例有些过于简单，因为两个客户端都加载了相同的数据集。

source: You're now prepared to explore this topic further. How about using a more sophisticated model or using a different dataset? How about adding more clients?
fr: Tu es maintenant prêt à approfondir ce sujet. Pourquoi ne pas utiliser un modèle plus sophistiqué ou un ensemble de données différent ? Pourquoi ne pas ajouter d'autres clients ?
zh_hans: 现在，您已准备好进行更深一步探索了。例如使用更复杂的模型或使用不同的数据集会如何？增加更多客户端会如何？

source: Example: MXNet - Run MXNet Federated
fr: Exemple : MXNet - Exécuter MXNet Federated
zh_hans: 示例： MXNet - 运行联邦式 MXNet

source: This tutorial will show you how to use Flower to build a federated version of an existing MXNet workload. We are using MXNet to train a Sequential model on the MNIST dataset. We will structure the example similar to our `PyTorch - From Centralized To Federated <https://github.com/adap/flower/blob/main/examples/pytorch-from-centralized-to-federated>`_ walkthrough. MXNet and PyTorch are very similar and a very good comparison between MXNet and PyTorch is given `here <https://mxnet.apache.org/versions/1.7.0/api/python/docs/tutorials/getting-started/to-mxnet/pytorch.html>`_. First, we build a centralized training approach based on the `Handwritten Digit Recognition <https://mxnet.apache.org/versions/1.7.0/api/python/docs/tutorials/packages/gluon/image/mnist.html>`_ tutorial. Then, we build upon the centralized training code to run the training in a federated fashion.
zh_hans: 本教程将向您展示如何使用 Flower 构建现有 MXNet 的联学习版本。我们将使用 MXNet 在 MNIST 数据集上训练一个序列模型。另外，我们将采用与我们的 `PyTorch - 从集中式到联邦式 <https://github.com/adap/flower/blob/main/examples/pytorch-from-centralized-to-federated>`_ 教程类似的示例结构。MXNet 和 PyTorch 非常相似，参考 `此处 <https://mxnet.apache.org/versions/1.7.0/api/python/docs/tutorials/getting-started/to-mxnet/pytorch.html>`_对 MXNet 和 PyTorch 进行了详细的比较。首先，我们根据 `手写数字识别 <https://mxnet.apache.org/versions/1.7.0/api/python/docs/tutorials/packages/gluon/image/mnist.html>` 教程 建立了集中式训练方法。然后，我们在集中式训练代码的基础上，以联邦方式运行训练。

source: Before we start setting up our MXNet example, we install the :code:`mxnet` and :code:`flwr` packages:
fr: Avant de commencer à configurer notre exemple MXNet, nous installons les paquets :code:`mxnet` et :code:`flwr` :
zh_hans: 在开始设置 MXNet 示例之前，我们先安装 :code:`mxnet` 和 :code:`flwr` 软件包：

source: MNIST Training with MXNet
fr: Formation MNIST avec MXNet
zh_hans: 使用 MXNet 进行 MNIST 训练

source: We begin with a brief description of the centralized training code based on a :code:`Sequential` model. If you want a more in-depth explanation of what's going on then have a look at the official `MXNet tutorial <https://mxnet.apache.org/versions/1.7.0/api/python/docs/tutorials/>`_.
fr: Nous commençons par une brève description du code d'entraînement centralisé basé sur un modèle :code:`Sequential`. Si tu veux une explication plus approfondie de ce qui se passe, jette un coup d'œil au tutoriel officiel `MXNet <https://mxnet.apache.org/versions/1.7.0/api/python/docs/tutorials/>`_.
zh_hans: 首先，我们将简要介绍基于 :code:`Sequential` 模型的集中式训练代码。如果您想获得更深入的解释，请参阅官方的 `MXNet教程 <https://mxnet.apache.org/versions/1.7.0/api/python/docs/tutorials/>`_。

source: Let's create a new file called:code:`mxnet_mnist.py` with all the components required for a traditional (centralized) MNIST training. First, the MXNet package :code:`mxnet` needs to be imported. You can see that we do not yet import the :code:`flwr` package for federated learning. This will be done later.
fr: Créons un nouveau fichier appelé :code:`mxnet_mnist.py` avec tous les composants requis pour un apprentissage MNIST traditionnel (centralisé). Tout d'abord, le package MXNet :code:`mxnet` doit être importé. Tu peux voir que nous n'avons pas encore importé le package :code:`flwr` pour l'apprentissage fédéré. Cela sera fait plus tard.
zh_hans: 让我们创建一个名为:code:`mxnet_mnist.py`的新文件，其中包含传统（集中式）MNIST 训练所需的所有组件。首先，需要导入 MXNet 包 :code:`mxnet`。您可以看到，我们尚未导入用于联合学习的 :code:`flwr` 包，这将在稍后完成。

source: The :code:`load_data()` function loads the MNIST training and test sets.
fr: La fonction :code:`load_data()` charge les ensembles d'entraînement et de test MNIST.
zh_hans: :code:`load_data()` 函数加载 MNIST 训练集和测试集。

source: As already mentioned, we will use the MNIST dataset for this machine learning workload. The model architecture (a very simple :code:`Sequential` model) is defined in :code:`model()`.
fr: Comme nous l'avons déjà mentionné, nous utiliserons l'ensemble de données MNIST pour cette charge de travail d'apprentissage automatique. L'architecture du modèle (un modèle :code:`Séquentiel` très simple) est définie dans :code:`model()`.
zh_hans: 如前所述，我们将使用 MNIST 数据集进行机器学习。模型架构（一个非常简单的 :code:`Sequential` 模型）在 :code:`model()` 中定义。

source: We now need to define the training (function :code:`train()`) which loops over the training set and measures the loss for each batch of training examples.
fr: Nous devons maintenant définir la formation (fonction :code:`train()`) qui passe en boucle sur l'ensemble de la formation et mesure la perte pour chaque lot d'exemples de formation.
zh_hans: 现在，我们需要定义训练函数（ :code:`train()`），该函数在训练集上循环训练，并计算每批训练示例的损失值。

source: The evaluation of the model is defined in function :code:`test()`. The function loops over all test samples and measures the loss and accuracy of the model based on the test dataset.
fr: L'évaluation du modèle est définie dans la fonction :code:`test()`. Cette fonction passe en boucle sur tous les échantillons de test et mesure la perte et la précision du modèle en fonction de l'ensemble des données de test.
zh_hans: 模型的评估在函数 :code:`test()` 中定义。该函数循环遍历所有测试样本，并根据测试数据集计算模型的损失值和准确度。

source: Having defined the data loading, model architecture, training, and evaluation we can put everything together and train our model on MNIST. Note that the GPU/CPU device for the training and testing is defined within the :code:`ctx` (context).
fr: Après avoir défini le chargement des données, l'architecture du modèle, l'entraînement et l'évaluation, nous pouvons tout assembler et entraîner notre modèle sur MNIST. Note que le dispositif GPU/CPU pour l'entraînement et le test est défini dans le :code:`ctx` (contexte).
zh_hans: 在定义了数据加载、模型架构、训练和评估之后，我们就可以把所有放在一起，在 MNIST 上训练我们的模型了。请注意，用于训练和测试的 GPU/CPU 设备是在 :code:`ctx`中定义的。

source: You can now run your (centralized) MXNet machine learning workload:
fr: Tu peux maintenant exécuter ta charge de travail (centralisée) d'apprentissage automatique MXNet :
zh_hans: 现在，您可以运行（集中式）MXNet 机器学习工作：

source: So far this should all look fairly familiar if you've used MXNet (or even PyTorch) before. Let's take the next step and use what we've built to create a simple federated learning system consisting of one server and two clients.
fr: Jusqu'à présent, tout cela devrait te sembler assez familier si tu as déjà utilisé MXNet (ou même PyTorch). Passons à l'étape suivante et utilisons ce que nous avons construit pour créer un simple système d'apprentissage fédéré composé d'un serveur et de deux clients.
zh_hans: 到目前为止，如果你以前使用过 MXNet（甚至 PyTorch），这一切看起来应该相当熟悉。下一步，让我们利用已构建的内容创建一个简单联邦学习系统（由一个服务器和两个客户端组成）。

source: MXNet meets Flower
fr: MXNet rencontre Flower
zh_hans: MXNet 结合 Flower

source: So far, it was not easily possible to use MXNet workloads for federated learning because federated learning is not supported in MXNet. Since Flower is fully agnostic towards the underlying machine learning framework, it can be used to federated arbitrary machine learning workloads. This section will show you how Flower can be used to federate our centralized MXNet workload.
fr: Jusqu'à présent, il n'était pas facile d'utiliser les charges de travail MXNet pour l'apprentissage fédéré car l'apprentissage fédéré n'est pas pris en charge dans MXNet. Comme Flower est totalement agnostique vis-à-vis du cadre d'apprentissage automatique sous-jacent, il peut être utilisé pour fédérer des charges de travail d'apprentissage automatique arbitraires. Cette section te montrera comment Flower peut être utilisé pour fédérer notre charge de travail MXNet centralisée.
zh_hans: 由于 MXNet 目前不支持联邦学习，因此无法轻松地直接将 MXNet 用于联邦学习之中。Flower 与底层机器学习框架完全无关，因此它可用于任意联邦式机器学习工作。本节将向你展示如何使用 Flower 将我们的集中式 MXNet 改为联邦式训练。

source: The concept to federate an existing workload is always the same and easy to understand. We have to start a *server* and then use the code in :code:`mxnet_mnist.py` for the *clients* that are connected to the *server*. The *server* sends model parameters to the clients. The *clients* run the training and update the parameters. The updated parameters are sent back to the *server* which averages all received parameter updates. This describes one round of the federated learning process and we repeat this for multiple rounds.
fr: Le concept pour fédérer une charge de travail existante est toujours le même et facile à comprendre. Nous devons démarrer un *serveur* et ensuite utiliser le code dans :code:`mxnet_mnist.py` pour les *clients* qui sont connectés au *serveur*. Le *serveur* envoie les paramètres du modèle aux clients. Les *clients* exécutent la formation et mettent à jour les paramètres. Les paramètres mis à jour sont renvoyés au *serveur* qui fait la moyenne de toutes les mises à jour de paramètres reçues. Ceci décrit un tour du processus d'apprentissage fédéré et nous répétons cette opération pour plusieurs tours.
zh_hans: 将现有模型框架联邦化的概念始终是相同的，也很容易理解。我们必须启动一个*服务器*，然后对连接到*服务器*的*客户端*使用 :code:`mxnet_mnist.py`中的代码。*服务器*向客户端发送模型参数，然后*客户端*运行训练并更新参数。更新后的参数被发回*服务器*，然后会对所有收到的参数更新进行平均聚合。以上描述的是一轮联邦学习过程，我们将重复进行多轮学习。

source: Finally, we will define our *client* logic in :code:`client.py` and build upon the previously defined MXNet training in :code:`mxnet_mnist.py`. Our *client* needs to import :code:`flwr`, but also :code:`mxnet` to update the parameters on our MXNet model:
fr: Enfin, nous allons définir la logique de notre *client* dans :code:`client.py` et nous appuyer sur l'entraînement MXNet défini précédemment dans :code:`mxnet_mnist.py`. Notre *client* doit importer :code:`flwr`, mais aussi :code:`mxnet` pour mettre à jour les paramètres de notre modèle MXNet :
zh_hans: 最后，我们将在 :code:`client.py` 中定义我们的 *client* 逻辑，并以之前在 :code:`mxnet_mnist.py` 中定义的 MXNet 训练为基础。我们的 *client* 不仅需要导入 :code:`flwr`，还需要导入 :code:`mxnet`，以更新 MXNet 模型的参数：

source: Implementing a Flower *client* basically means implementing a subclass of either :code:`flwr.client.Client` or :code:`flwr.client.NumPyClient`. Our implementation will be based on :code:`flwr.client.NumPyClient` and we'll call it :code:`MNISTClient`. :code:`NumPyClient` is slighly easier to implement than :code:`Client` if you use a framework with good NumPy interoperability (like PyTorch or MXNet) because it avoids some of the boilerplate that would otherwise be necessary. :code:`MNISTClient` needs to implement four methods, two methods for getting/setting model parameters, one method for training the model, and one method for testing the model:
zh_hans: 实现 Flower *client*基本上意味着要实现 :code:`flwr.client.Client` 或 :code:`flwr.client.NumPyClient` 的子类。我们的代码实现将基于 :code:`flwr.client.NumPyClient`，并将其命名为 :code:`MNISTClient`。如果使用具有良好 NumPy 互操作性的框架（如 PyTorch 或 MXNet），:code:`NumPyClient` 比 :code:`Client`更容易实现，因为它避免了一些不必要的操作。:code:`MNISTClient` 需要实现四个方法，两个用于获取/设置模型参数，一个用于训练模型，一个用于测试模型：

source: transform MXNet :code:`NDArray`'s to NumPy :code:`ndarray`'s
fr: transforme les :code:`NDArray` du MXNet en :code:`ndarray` de NumPy
zh_hans: 将 MXNet :code:`NDArray` 转换为 NumPy :code:`ndarray`

source: get the updated local model weights and return them to the server
fr: récupère les poids du modèle local mis à jour et les renvoie au serveur
zh_hans: 获取更新后的本地模型参数并发送回服务器

source: return the local loss and accuracy to the server
fr: renvoie la perte locale et la précision au serveur
zh_hans: 向服务器返回本地损失值和精确度

source: The challenging part is to transform the MXNet parameters from :code:`NDArray` to :code:`NumPy Arrays` to make it readable for Flower.
fr: La partie la plus difficile est de transformer les paramètres MXNet de :code:`NDArray` en :code:`NumPy Arrays` pour les rendre lisibles pour Flower.
zh_hans: 具有挑战性的部分是将 MXNet 参数从 :code:`NDArray` 转换为 :code:`NumPy Arrays` 以便 Flower 可以读取。

source: The two :code:`NumPyClient` methods :code:`fit` and :code:`evaluate` make use of the functions :code:`train()` and :code:`test()` previously defined in :code:`mxnet_mnist.py`. So what we really do here is we tell Flower through our :code:`NumPyClient` subclass which of our already defined functions to call for training and evaluation. We included type annotations to give you a better understanding of the data types that get passed around.
fr: Les deux méthodes :code:`NumPyClient` :code:`fit` et :code:`evaluate` utilisent les fonctions :code:`train()` et :code:`test()` définies précédemment dans :code:`mxnet_mnist.py`. Ce que nous faisons vraiment ici, c'est que nous indiquons à Flower, par le biais de notre sous-classe :code:`NumPyClient`, laquelle de nos fonctions déjà définies doit être appelée pour l'entraînement et l'évaluation. Nous avons inclus des annotations de type pour te donner une meilleure compréhension des types de données qui sont transmis.
zh_hans: 这两个 :code:`NumPyClient` 方法 :code:`fit` 和 :code:`evaluate` 使用了之前在 :code:`mxnet_mnist.py` 中定义的函数 :code:`train()` 和 :code:`test()`。因此，我们要做的就是通过 :code:`NumPyClient` 子类告知 Flower 在训练和评估时要调用哪些已定义的函数。我们加入了类型注解，以便让您更好地理解传递的数据类型。

source: Having defined data loading, model architecture, training, and evaluation we can put everything together and train our :code:`Sequential` model on MNIST.
fr: Après avoir défini le chargement des données, l'architecture du modèle, la formation et l'évaluation, nous pouvons tout rassembler et former notre modèle :code:`Sequential` sur MNIST.
zh_hans: 在定义了数据加载、模型架构、训练和评估之后，我们就可以将所有内容整合在一起，在 MNIST 上训练我们的 :code:`Sequential` 模型。

source: in each window (make sure that the server is still running before you do so) and see your MXNet project run federated learning across two clients. Congratulations!
fr: dans chaque fenêtre (assure-toi que le serveur est toujours en cours d'exécution avant de le faire) et tu verras ton projet MXNet exécuter l'apprentissage fédéré sur deux clients. Félicitations !
zh_hans: 确保服务器仍在运行后，然后就能在每个窗口中看到 MXNet 项目在两个客户端上运行联邦学习了。祝贺!
