Repository: lucacorbucci/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: fr, zh_hans

source: In case you are a researcher you might be just fine using the self-signed certificates generated using the scripts which are part of this guide.
fr: Si tu es un chercheur, tu peux très bien utiliser les certificats auto-signés générés à l'aide des scripts qui font partie de ce guide.
zh_hans: 如果你是一名研究人员，使用本指南中的脚本生成的自签名证书就可以了。

source: Server
fr: Serveur
zh_hans: 服务器

source: We are now going to show how to write a sever which uses the previously generated scripts.
fr: Nous allons maintenant montrer comment écrire un serveur qui utilise les scripts générés précédemment.
zh_hans: 现在，我们将展示如何编写一个使用先前生成的脚本的服务器。

source: When providing certificates, the server expects a tuple of three certificates. :code:`Path` can be used to easily read the contents of those files into byte strings, which is the data type :code:`start_server` expects.
fr: Lorsqu'il fournit des certificats, le serveur attend un tuple de trois certificats. :code:`Path` peut être utilisé pour lire facilement le contenu de ces fichiers en chaînes d'octets, ce qui est le type de données attendu par :code:`start_server`.
zh_hans: 在提供证书时，服务器希望得到由三个证书组成的元组。 :code:`Path` 可用于轻松地将这些文件的内容读取为字节字符串，这就是 :code:`start_server` 期望的数据类型。

source: Client
zh_hans: 客户端

source: We are now going to show how to write a client which uses the previously generated scripts:
fr: Nous allons maintenant montrer comment écrire un client qui utilise les scripts générés précédemment :
zh_hans: 现在我们将演示如何编写一个客户端，使用之前生成的脚本：

source: When setting :code:`root_certificates`, the client expects the PEM-encoded root certificates as a byte string. We are again using :code:`Path` to simplify reading those as byte strings.
fr: En définissant :code:`root_certificates`, le client s'attend à recevoir les certificats racine codés en PEM sous forme de chaîne d'octets. Nous utilisons à nouveau :code:`Path` pour simplifier la lecture de ces certificats sous forme de chaînes d'octets.
zh_hans: 当设置 :code:`root_certificates` 时，客户端希望 PEM 编码的根证书是字节字符串。我们再次使用 :code:`Path` 来简化以字节字符串形式读取证书的过程。

source: Conclusion
zh_hans: 总结

source: You should now have learned how to generate self-signed certificates using the given script, start a SSL-enabled server, and have a client establish a secure connection to it.
fr: Tu devrais maintenant avoir appris à générer des certificats auto-signés à l'aide du script donné, à démarrer un serveur compatible SSL et à demander à un client d'établir une connexion sécurisée avec lui.
zh_hans: 现在，你应该已经学会了如何使用给定的脚本生成自签名证书、启动启用 SSL 的服务器并让客户端与其建立安全连接。

source: Additional resources
zh_hans: 补充资源

source: These additional sources might be relevant if you would like to dive deeper into the topic of certificates:
fr: Ces sources supplémentaires peuvent être pertinentes si tu souhaites approfondir le sujet des certificats :
zh_hans: 如果您想更深入地了解证书主题，这些额外的资料来源可能有帮助：

source: `Let's Encrypt <https://letsencrypt.org/docs/>`_
zh_hans: `让我们加密 <https://letsencrypt.org/docs/>`_

source: Implement strategies
zh_hans: 实施策略

source: The strategy abstraction enables implementation of fully custom strategies. A strategy is basically the federated learning algorithm that runs on the server. Strategies decide how to sample clients, how to configure clients for training, how to aggregate updates, and how to evaluate models. Flower provides a few built-in strategies which are based on the same API described below.
fr: L'abstraction de la stratégie permet de mettre en œuvre des stratégies entièrement personnalisées. Une stratégie est essentiellement l'algorithme d'apprentissage fédéré qui s'exécute sur le serveur. Les stratégies décident comment échantillonner les clients, comment configurer les clients pour la formation, comment agréger les mises à jour et comment évaluer les modèles. Flower fournit quelques stratégies intégrées qui sont basées sur la même API que celle décrite ci-dessous.
zh_hans: 策略抽象类可以实现完全定制的策略。策略基本上就是在服务器上运行的联邦学习算法。策略决定如何对客户端进行采样、如何配置客户端进行训练、如何聚合参数更新以及如何评估模型。Flower 提供了一些内置策略，这些策略基于下文所述的相同 API。

source: The :code:`Strategy` abstraction
fr: L'abstraction :code:`Stratégie`
zh_hans: :code:`策略 ` 抽象类

source: All strategy implementation are derived from the abstract base class :code:`flwr.server.strategy.Strategy`, both built-in implementations and third party implementations. This means that custom strategy implementations have the exact same capabilities at their disposal as built-in ones.
fr: Toutes les implémentations de stratégies sont dérivées de la classe de base abstraite :code:`flwr.server.strategy.Strategy`, qu'il s'agisse d'implémentations intégrées ou d'implémentations tierces. Cela signifie que les implémentations de stratégies personnalisées ont exactement les mêmes capacités à leur disposition que les implémentations intégrées.
zh_hans: 所有策略实现均源自抽象基类 :code:`flwr.server.strategy.Strategy`，包括内置实现和第三方实现。这意味着自定义策略实现与内置实现具有完全相同的功能。

source: The strategy abstraction defines a few abstract methods that need to be implemented:
fr: L'abstraction de la stratégie définit quelques méthodes abstraites qui doivent être mises en œuvre :
zh_hans: 策略抽象定义了一些需要实现的抽象方法：

source: Creating a new strategy means implementing a new :code:`class` (derived from the abstract base class :code:`Strategy`) that implements for the previously shown abstract methods:
fr: La création d'une nouvelle stratégie implique la mise en œuvre d'une nouvelle :code:`classe` (dérivée de la classe de base abstraite :code:`Stratégie`) qui met en œuvre les méthodes abstraites présentées précédemment :
zh_hans: 创建一个新策略意味着要实现一个新的 :code:`class`（从抽象基类 :code:`Strategy` 派生），该类要实现前面显示的抽象方法：

source: The Flower server calls these methods in the following order:
fr: Le serveur Flower appelle ces méthodes dans l'ordre suivant :
zh_hans: Flower 服务器按以下顺序调用这些方法：

source: The following sections describe each of those methods in more detail.
fr: Les sections suivantes décrivent chacune de ces méthodes plus en détail.
zh_hans: 下文将详细介绍每种方法。

source: The :code:`initialize_parameters` method
fr: La méthode :code:`initialize_parameters` (initialisation des paramètres)
zh_hans: :code:`初始化参数` 方法

source: :code:`initialize_parameters` is called only once, at the very beginning of an execution. It is responsible for providing the initial global model parameters in a serialized form (i.e., as a :code:`Parameters` object).
fr: :code:`initialize_parameters` n'est appelé qu'une seule fois, au tout début d'une exécution. Il est chargé de fournir les paramètres initiaux du modèle global sous une forme sérialisée (c'est-à-dire sous la forme d'un objet :code:`Parameters`).
zh_hans: :code:`initialize_parameters` 只调用一次，即在执行开始时。它负责以序列化形式（即 :code:`Parameters` 对象）提供初始全局模型参数。

source: Built-in strategies return user-provided initial parameters. The following example shows how initial parameters can be passed to :code:`FedAvg`:
fr: Les stratégies intégrées renvoient les paramètres initiaux fournis par l'utilisateur. L'exemple suivant montre comment les paramètres initiaux peuvent être transmis à :code:`FedAvg` :
zh_hans: 内置策略会返回用户提供的初始参数。下面的示例展示了如何将初始参数传递给 :code:`FedAvg`：

source: The Flower server will call :code:`initialize_parameters`, which either returns the parameters that were passed to :code:`initial_parameters`, or :code:`None`. If no parameters are returned from :code:`initialize_parameters` (i.e., :code:`None`), the server will randomly select one client and ask it to provide its parameters. This is a convenience feature and not recommended in practice, but it can be useful for prototyping. In practice, it is recommended to always use server-side parameter initialization.
fr: Le serveur Flower appelle :code:`initialize_parameters`, qui renvoie les paramètres passés à :code:`initial_parameters`, ou :code:`None`. Si aucun paramètre n'est renvoyé par :code:`initialize_parameters` (c'est-à-dire :code:`None`), le serveur sélectionne au hasard un client et lui demande de fournir ses paramètres. Il s'agit d'une fonction de commodité qui n'est pas recommandée dans la pratique, mais qui peut être utile pour le prototypage. Dans la pratique, il est recommandé de toujours utiliser l'initialisation des paramètres du côté du serveur.
zh_hans: Flower 服务器将调用 :code:`initialize_parameters`，返回传给 :code:`initial_parameters` 的参数或 :code:`None`。如果 :code:`initialize_parameters` 没有返回任何参数（即 :code:`None`），服务器将随机选择一个客户端并要求其提供参数。这只是一个便捷的功能，在实际应用中并不推荐使用，但在原型开发中可能很有用。在实践中，建议始终使用服务器端参数初始化。

source: Server-side parameter initialization is a powerful mechanism. It can be used, for example, to resume training from a previously saved checkpoint. It is also the fundamental capability needed to implement hybrid approaches, for example, to fine-tune a pre-trained model using federated learning.
fr: L'initialisation des paramètres côté serveur est un mécanisme puissant. Elle peut être utilisée, par exemple, pour reprendre l'entraînement à partir d'un point de contrôle précédemment sauvegardé. C'est également la capacité fondamentale nécessaire pour mettre en œuvre des approches hybrides, par exemple, pour affiner un modèle pré-entraîné à l'aide de l'apprentissage fédéré.
zh_hans: 服务器端参数初始化是一种强大的机制。例如，它可以用来从先前保存的检查点恢复训练。它也是实现混合方法所需的基本能力，例如，使用联邦学习对预先训练好的模型进行微调。

source: The :code:`configure_fit` method
fr: La méthode :code:`configure_fit`
zh_hans: :code:`configure_fit`方法

source: :code:`configure_fit` is responsible for configuring the upcoming round of training. What does *configure* mean in this context? Configuring a round means selecting clients and deciding what instructions to send to these clients. The signature of :code:`configure_fit` makes this clear:
fr: :code:`configure_fit` est chargé de configurer le prochain tour de formation. Que signifie *configurer* dans ce contexte ? Configurer un tour signifie sélectionner des clients et décider des instructions à leur envoyer. La signature de :code:`configure_fit` l'indique clairement :
zh_hans: :code:`configure_fit` 负责配置即将开始的一轮训练。*配置*在这里是什么意思？配置一轮训练意味着选择客户并决定向这些客户发送什么指令。:code:`configure_fit` 说明了这一点：

source: The return value is a list of tuples, each representing the instructions that will be sent to a particular client. Strategy implementations usually perform the following steps in :code:`configure_fit`:
fr: La valeur de retour est une liste de tuples, chacun représentant les instructions qui seront envoyées à un client particulier. Les implémentations de stratégies effectuent généralement les étapes suivantes dans :code:`configure_fit` :
zh_hans: 返回值是一个元组列表，每个元组代表将发送到特定客户端的指令。策略实现通常在 :code:`configure_fit` 中执行以下步骤：

source: Use the :code:`client_manager` to randomly sample all (or a subset of) available clients (each represented as a :code:`ClientProxy` object)
fr: Utilise le :code:`client_manager` pour échantillonner au hasard tous les clients disponibles (ou un sous-ensemble d'entre eux) (chacun représenté par un objet :code:`ClientProxy`)
zh_hans: 使用 :code:`client_manager` 随机抽样所有（或部分）可用客户端（每个客户端都表示为 :code:`ClientProxy` 对象）

source: Pair each :code:`ClientProxy` with the same :code:`FitIns` holding the current global model :code:`parameters` and :code:`config` dict
fr: Associe chaque :code:`ClientProxy` au même :code:`FitIns` contenant le modèle global actuel :code:`parameters` et :code:`config` dict
zh_hans: 将每个 :code:`ClientProxy` 与持有当前全局模型 :code:`parameters` 和 :code:`config` dict 的 :code:`FitIns` 配对

source: More sophisticated implementations can use :code:`configure_fit` to implement custom client selection logic. A client will only participate in a round if the corresponding :code:`ClientProxy` is included in the the list returned from :code:`configure_fit`.
fr: Les implémentations plus sophistiquées peuvent utiliser :code:`configure_fit` pour mettre en œuvre une logique de sélection des clients personnalisée. Un client ne participera à un tour que si le :code:`ClientProxy` correspondant est inclus dans la liste renvoyée par :code:`configure_fit`.
zh_hans: 更复杂的实现可以使用 :code:`configure_fit` 来实现自定义的客户端选择逻辑。只有当相应的 :code:`ClientProxy` 包含在 :code:`configure_fit` 返回的列表中时，客户端才会参与进来。

source: The structure of this return value provides a lot of flexibility to the user. Since instructions are defined on a per-client basis, different instructions can be sent to each client. This enables custom strategies to train, for example, different models on different clients, or use different hyperparameters on different clients (via the :code:`config` dict).
fr: La structure de cette valeur de retour offre beaucoup de souplesse à l'utilisateur. Comme les instructions sont définies par client, des instructions différentes peuvent être envoyées à chaque client, ce qui permet d'élaborer des stratégies personnalisées pour former, par exemple, différents modèles sur différents clients, ou utiliser différents hyperparamètres sur différents clients (via le dict :code:`config`).
zh_hans: 该返回值的结构为用户提供了很大的灵活性。由于指令是按客户端定义的，因此可以向每个客户端发送不同的指令。这使得自定义策略成为可能，例如在不同的客户端上训练不同的模型，或在不同的客户端上使用不同的超参数（通过 :code:`config` dict）。

source: The :code:`aggregate_fit` method
fr: La méthode :code:`aggregate_fit` (agrégation)
zh_hans: :code:`aggregate_fit` 方法

source: :code:`aggregate_fit` is responsible for aggregating the results returned by the clients that were selected and asked to train in :code:`configure_fit`.
fr: :code:`aggregate_fit` est chargé d'agréger les résultats renvoyés par les clients qui ont été sélectionnés et à qui on a demandé de s'entraîner dans :code:`configure_fit`.
zh_hans: :code:`aggregate_fit` 负责汇总在 :code:`configure_fit` 中选择并要求训练的客户端所返回的结果。

source: Of course, failures can happen, so there is no guarantee that the server will get results from all the clients it sent instructions to (via :code:`configure_fit`). :code:`aggregate_fit` therefore receives a list of :code:`results`, but also a list of :code:`failures`.
fr: Bien sûr, des échecs peuvent se produire, il n'y a donc aucune garantie que le serveur obtienne des résultats de tous les clients auxquels il a envoyé des instructions (via :code:`configure_fit`). :code:`aggregate_fit` reçoit donc une liste de :code:`résultats`, mais aussi une liste de :code:`échecs`.
zh_hans: 当然，失败是有可能发生的，因此无法保证服务器会从它发送指令（通过 :code:`configure_fit`）的所有客户端获得结果。因此 :code:`aggregate_fit` 会收到 :code:`results` 的列表，但也会收到 :code:`failures` 的列表。

source: :code:`aggregate_fit` returns an optional :code:`Parameters` object and a dictionary of aggregated metrics. The :code:`Parameters` return value is optional because :code:`aggregate_fit` might decide that the results provided are not sufficient for aggregation (e.g., too many failures).
fr: :code:`aggregate_fit` renvoie un objet :code:`Parameters` facultatif et un dictionnaire de métriques agrégées. La valeur de retour :code:`Parameters` est facultative car :code:`aggregate_fit` peut décider que les résultats fournis ne sont pas suffisants pour l'agrégation (par exemple, trop d'échecs).
zh_hans: :code:`aggregate_fit` 返回一个可选的 :code:`Parameters` 对象和一个聚合度量的字典。:code:`Parameters` 返回值是可选的，因为 :code:`aggregate_fit` 可能会认为所提供的结果不足以进行聚合（例如，失败次数过多）。

source: The :code:`configure_evaluate` method
fr: La méthode :code:`configure_evaluate` (en anglais)
zh_hans: :code:`configure_evaluate`方法

source: :code:`configure_evaluate` is responsible for configuring the upcoming round of evaluation. What does *configure* mean in this context? Configuring a round means selecting clients and deciding what instructions to send to these clients. The signature of :code:`configure_evaluate` makes this clear:
fr: :code:`configure_evaluate` est chargé de configurer le prochain tour d'évaluation. Que signifie *configurer* dans ce contexte ? Configurer un tour signifie sélectionner des clients et décider des instructions à leur envoyer. La signature de :code:`configure_evaluate` l'indique clairement :
zh_hans: :code:`configure_evaluate` 负责配置下一轮评估。*配置*在这里是什么意思？配置一轮评估意味着选择客户端并决定向这些客户端发送什么指令。:code:`configure_evaluate` 说明了这一点：

source: The return value is a list of tuples, each representing the instructions that will be sent to a particular client. Strategy implementations usually perform the following steps in :code:`configure_evaluate`:
fr: La valeur de retour est une liste de tuples, chacun représentant les instructions qui seront envoyées à un client particulier. Les implémentations de stratégies effectuent généralement les étapes suivantes dans :code:`configure_evaluate` :
zh_hans: 返回值是一个元组列表，每个元组代表将发送到特定客户端的指令。策略实现通常在 :code:`configure_evaluate` 中执行以下步骤：

source: Pair each :code:`ClientProxy` with the same :code:`EvaluateIns` holding the current global model :code:`parameters` and :code:`config` dict
fr: Associe chaque :code:`ClientProxy` au même :code:`EvaluateIns` contenant le modèle global actuel :code:`parameters` et :code:`config` dict
zh_hans: 将每个 :code:`ClientProxy` 与持有当前全局模型 :code:`parameters` 和 :code:`config` dict 的 :code:`EvaluateIns` 配对

source: More sophisticated implementations can use :code:`configure_evaluate` to implement custom client selection logic. A client will only participate in a round if the corresponding :code:`ClientProxy` is included in the the list returned from :code:`configure_evaluate`.
fr: Les implémentations plus sophistiquées peuvent utiliser :code:`configure_evaluate` pour mettre en œuvre une logique de sélection des clients personnalisée. Un client ne participera à un tour que si le :code:`ClientProxy` correspondant est inclus dans la liste renvoyée par :code:`configure_evaluate`.
zh_hans: 更复杂的实现可以使用 :code:`configure_evaluate` 来实现自定义的客户端选择逻辑。只有当相应的 :code:`ClientProxy` 包含在 :code:`configure_evaluate` 返回的列表中时，客户端才会参与进来。

source: The structure of this return value provides a lot of flexibility to the user. Since instructions are defined on a per-client basis, different instructions can be sent to each client. This enables custom strategies to evaluate, for example, different models on different clients, or use different hyperparameters on different clients (via the :code:`config` dict).
fr: La structure de cette valeur de retour offre beaucoup de souplesse à l'utilisateur. Comme les instructions sont définies par client, des instructions différentes peuvent être envoyées à chaque client. Cela permet aux stratégies personnalisées d'évaluer, par exemple, différents modèles sur différents clients, ou d'utiliser différents hyperparamètres sur différents clients (via le dict :code:`config`).
zh_hans: 该返回值的结构为用户提供了很大的灵活性。由于指令是按客户端定义的，因此可以向每个客户端发送不同的指令。这使得自定义策略可以在不同客户端上评估不同的模型，或在不同客户端上使用不同的超参数（通过 :code:`config` dict）。

source: The :code:`aggregate_evaluate` method
fr: La méthode :code:`aggregate_evaluate` (agréger_évaluer)
zh_hans: :code:`aggregate_evaluate` 方法

source: :code:`aggregate_evaluate` is responsible for aggregating the results returned by the clients that were selected and asked to evaluate in :code:`configure_evaluate`.
fr: :code:`aggregate_evaluate` est chargé d'agréger les résultats renvoyés par les clients qui ont été sélectionnés et à qui l'on a demandé d'évaluer dans :code:`configure_evaluate`.
zh_hans: :code:`aggregate_evaluate` 负责汇总在 :code:`configure_evaluate` 中选择并要求评估的客户端返回的结果。

source: Of course, failures can happen, so there is no guarantee that the server will get results from all the clients it sent instructions to (via :code:`configure_evaluate`). :code:`aggregate_evaluate` therefore receives a list of :code:`results`, but also a list of :code:`failures`.
fr: Bien sûr, des échecs peuvent se produire, il n'y a donc aucune garantie que le serveur obtienne des résultats de tous les clients auxquels il a envoyé des instructions (via :code:`configure_evaluate`). :code:`aggregate_evaluate` reçoit donc une liste de :code:`résultats`, mais aussi une liste d' :code:`échecs`.
zh_hans: 当然，失败是有可能发生的，因此无法保证服务器会从它发送指令（通过 :code:`configure_evaluate`）的所有客户端获得结果。因此， :code:`aggregate_evaluate` 会接收 :code:`results` 的列表，但也会接收 :code:`failures` 的列表。

source: :code:`aggregate_evaluate` returns an optional :code:`float` (loss) and a dictionary of aggregated metrics. The :code:`float` return value is optional because :code:`aggregate_evaluate` might decide that the results provided are not sufficient for aggregation (e.g., too many failures).
fr: :code:`aggregate_evaluate` renvoie un :code:`float` facultatif (perte) et un dictionnaire de mesures agrégées. La valeur de retour :code:`float` est facultative car :code:`aggregate_evaluate` peut décider que les résultats fournis ne sont pas suffisants pour l'agrégation (par exemple, trop d'échecs).
zh_hans: :code:`aggregate_evaluate` 返回一个可选的 :code:`float`（损失值）和一个聚合指标字典。:code:`float` 返回值是可选的，因为 :code:`aggregate_evaluate` 可能会认为所提供的结果不足以进行聚合（例如，失败次数过多）。

source: The :code:`evaluate` method
fr: La méthode :code:`évaluer`
zh_hans: :code:`evaluate`方法

source: :code:`evaluate` is responsible for evaluating model parameters on the server-side. Having :code:`evaluate` in addition to :code:`configure_evaluate`/:code:`aggregate_evaluate` enables strategies to perform both servers-side and client-side (federated) evaluation.
fr: le fait d'avoir :code:`evaluate` en plus de :code:`configure_evaluate`/:code:`aggregate_evaluate` permet aux stratégies d'effectuer des évaluations à la fois côté serveur et côté client (fédéré).
zh_hans: :code:`evaluate` 负责在服务器端评估模型参数。除了 :code:`configure_evaluate`/:code:`aggregate_evaluate` 之外，:code:`evaluate` 可以使策略同时执行服务器端和客户端（联邦）评估。

source: The return value is again optional because the strategy might not need to implement server-side evaluation or because the user-defined :code:`evaluate` method might not complete successfully (e.g., it might fail to load the server-side evaluation data).
fr: La valeur de retour est à nouveau facultative parce que la stratégie peut ne pas avoir besoin de mettre en œuvre l'évaluation côté serveur ou parce que la méthode :code:`evaluate` définie par l'utilisateur peut ne pas se terminer avec succès (par exemple, elle peut échouer à charger les données de l'évaluation côté serveur).
zh_hans: 返回值也是可选的，因为策略可能不需要执行服务器端评估，或者因为用户定义的 :code:`evaluate` 方法可能无法成功完成（例如，它可能无法加载服务器端评估数据）。

source: Install Flower
zh_hans: 安装Flower

source: Python version
zh_hans: Python 版本

source: Install stable release
fr: Installe la version stable
zh_hans: 安装稳定版

source: Stable releases are available on `PyPI <https://pypi.org/project/flwr/>`_::
fr: Les versions stables sont disponibles sur `PyPI <https://pypi.org/project/flwr/>`_: :
zh_hans: 稳定版本可在 `PyPI <https://pypi.org/project/flwr/>`_:：

source: For simulations that use the Virtual Client Engine, ``flwr`` should be installed with the ``simulation`` extra::
fr: Pour les simulations qui utilisent le moteur de client virtuel, ``flwr`` doit être installé avec l'option ``simulation``: :
zh_hans: 对于使用虚拟客户端引擎的模拟，`flwr`` 应与`simulation`` 一起安装：

source: Verify installation
fr: Vérifie l'installation
zh_hans: 验证安装

source: The following command can be used to verfiy if Flower was successfully installed. If everything worked, it should print the version of Flower to the command line::
fr: La commande suivante peut être utilisée pour vérifier si Flower a été installé avec succès. Si tout a fonctionné, la version de Flower devrait être imprimée sur la ligne de commande: :
zh_hans: 可以使用以下命令来验证 Flower 是否安装成功。如果一切正常，它将在命令行中打印 Flower 的版本：：

source: Advanced installation options
fr: Options d'installation avancées
zh_hans: 高级安装选项

source: Install pre-release
fr: Installer la version pre-release
zh_hans: 安装预发布版本

source: New (possibly unstable) versions of Flower are sometimes available as pre-release versions (alpha, beta, release candidate) before the stable release happens::
fr: Les nouvelles versions (éventuellement instables) de Flower sont parfois disponibles en tant que versions préliminaires (alpha, bêta, release candidate) avant que la version stable n'arrive : :
zh_hans: 在稳定版发布之前，Flower 的新版本（可能是不稳定版）有时会作为预发布版本（alpha、beta、候选发布版本）提供：：
