Repository: lucacorbucci/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: fr, zh_hans

source: Pass :code:`ray_init_args={"address"="auto"}` to `start_simulation <ref-api-flwr.html#flwr.simulation.start_simulation>`_ so the :code:`VirtualClientEngine` attaches to a running Ray instance.
zh_hans: 将 :code:`ray_init_args={"address"="auto"}`传递给 `start_simulation <ref-api-flwr.html#flwr.simulation.start_simulation>`_ ，这样 :code:`VirtualClientEngine`就会连接到正在运行的 Ray 实例。

source: Start Ray on you head node: on the terminal type :code:`ray start --head`. This command will print a few lines, one of which indicates how to attach other nodes to the head node.
zh_hans: 在头部节点上启动 Ray：在终端上输入 :code:`raystart--head`。该命令将打印几行输出，其中一行说明如何将其他节点连接到头部节点。

source: Attach other nodes to the head node: copy the command shown after starting the head and execute it on terminal of a new node: for example :code:`ray start --address='192.168.1.132:6379'`
zh_hans: 将其他节点附加到头部节点：复制启动头部后显示的命令，并在新节点的终端上执行：例如 :code:`ray start --address='192.168.1.132:6379'`

source: With all the above done, you can run your code from the head node as you would if the simulation was running on a single node.
zh_hans: 完成上述所有操作后，您就可以在头部节点上运行代码了，就像在单个节点上运行模拟一样。

source: Once your simulation is finished, if you'd like to dismantle your cluster you simply need to run the command :code:`ray stop` in each node's terminal (including the head node).
zh_hans: 模拟结束后，如果要拆除集群，只需在每个节点（包括头部节点）的终端运行 :code:`ray stop` 命令即可。

source: Multi-node simulation good-to-know
zh_hans: 了解多节点模拟

source: Here we list a few interesting functionality when running multi-node FL simulations:
zh_hans: 在此，我们列举了运行多节点 FL 模拟时的一些有趣功能：

source: User :code:`ray status` to check all nodes connected to your head node as well as the total resources available to the :code:`VirtualClientEngine`.
zh_hans: 使用 :code:`ray status` 查看连接到头部节点的所有节点，以及 :code:`VirtualClientEngine` 可用的总资源。

source: When attaching a new node to the head, all its resources (i.e. all CPUs, all GPUs) will be visible by the head node. This means that the :code:`VirtualClientEngine` can schedule as many `virtual` clients as that node can possible run. In some settings you might want to exclude certain resources from the simulation. You can do this by appending `--num-cpus=<NUM_CPUS_FROM_NODE>` and/or `--num-gpus=<NUM_GPUS_FROM_NODE>` in any :code:`ray start` command (including when starting the head)
zh_hans: 将新节点附加到头部节点时，头部节点将可见其所有资源（即所有 CPU 和 GPU）。这意味着 :code:`VirtualClientEngine` 可以调度尽可能多的 "虚拟 "客户端来运行该节点。在某些设置中，您可能希望将某些资源排除在模拟之外。为此，您可以在任何 :code:`ray start` 命令（包括启动头部时）中添加 `--num-cpus=<NUM_CPUS_FROM_NODE>`和/或 `--num-gpus=<NUM_GPUS_FROM_NODE>`

source: Considerations for simulations
zh_hans: 模拟的注意事项

source: We are actively working on these fronts so to make it trivial to run any FL workload with Flower simulation.
zh_hans: 我们正在积极开展这些方面的工作，以便使 FL 工作负载与 Flower 模拟的运行变得轻而易举。

source: The current VCE allows you to run Federated Learning workloads in simulation mode whether you are prototyping simple scenarios on your personal laptop or you want to train a complex FL pipeline across multiple high-performance GPU nodes. While we add more capabilities to the VCE, the points below highlight some of the considerations to keep in mind when designing your FL pipeline with Flower. We also highlight a couple of current limitations in our implementation.
zh_hans: 当前的 VCE 允许您在模拟模式下运行联邦学习工作负载，无论您是在个人笔记本电脑上建立简单的场景原型，还是要在多个高性能 GPU 节点上训练复杂的 FL情景。虽然我们为 VCE 增加了更多的功能，但以下几点强调了在使用 Flower 设计 FL 时需要注意的一些事项。我们还强调了我们的实现中目前存在的一些局限性。

source: GPU resources
zh_hans: GPU 资源

source: The VCE assigns a share of GPU memory to a client that specifies the key :code:`num_gpus` in :code:`client_resources`. This being said, Ray (used internally by the VCE) is by default:
zh_hans: VCE 会为指定 :code:`client_resources` 中 :code:`num_gpus` 关键字的客户端分配 GPU 内存份额。也就是说，Ray（VCE 内部使用）是默认的：

source: not aware of the total VRAM available on the GPUs. This means that if you set :code:`num_gpus=0.5` and you have two GPUs in your system with different (e.g. 32GB and 8GB) VRAM amounts, they both would run 2 clients concurrently.
zh_hans: 不知道 GPU 上可用的总 VRAM。这意味着，如果您设置 :code:`num_gpus=0.5`，而系统中有两个不同（如 32GB 和 8GB）VRAM 的 GPU，它们都将同时运行 2 个客户端。

source: not aware of other unrelated (i.e. not created by the VCE) workloads are running on the GPU. Two takeaways from this are:
zh_hans: 不知道 GPU 上正在运行其他无关（即不是由 VCE 创建）的工作负载。从中可以得到以下两点启示：

source: Your Flower server might need a GPU to evaluate the `global model` after aggregation (by instance when making use of the `evaluate method <how-to-implement-strategies.html#the-evaluate-method>`_)
zh_hans: 您的 Flower 服务器可能需要 GPU 来评估聚合后的 "全局模型"（例如在使用 "评估方法"<how-to-implement-strategies.html#the-evaluate-method>`_时）

source: If you want to run several independent Flower simulations on the same machine you need to mask-out your GPUs with :code:`CUDA_VISIBLE_DEVICES="<GPU_IDs>"` when launching your experiment.
zh_hans: 如果您想在同一台机器上运行多个独立的 Flower 模拟，则需要在启动实验时使用 :code:`CUDA_VISIBLE_DEVICES="<GPU_IDs>"` 屏蔽 GPU。

source: In addition, the GPU resource limits passed to :code:`client_resources` are not `enforced` (i.e. they can be exceeded) which can result in the situation of client using more VRAM than the ratio specified when starting the simulation.
zh_hans: 此外，传递给 :code:`client_resources` 的 GPU 资源限制并不是 "强制 "的（即可以超出），这可能导致客户端使用的 VRAM 超过启动模拟时指定的比例。

source: TensorFlow with GPUs
zh_hans: 使用 GPU 的 TensorFlow

source: When `using a GPU with TensorFlow <https://www.tensorflow.org/guide/gpu>`_ nearly your entire GPU memory of all your GPUs visible to the process will be mapped. This is done by TensorFlow for optimization purposes. However, in settings such as FL simulations where we want to split the GPU into multiple `virtual` clients, this is not a desirable mechanism. Luckily we can disable this default behavior by `enabling memory growth <https://www.tensorflow.org/guide/gpu#limiting_gpu_memory_growth>`_.
zh_hans: 在 TensorFlow <https://www.tensorflow.org/guide/gpu>`_ 中使用 GPU 时，几乎所有进程可见的 GPU 内存都将被映射。TensorFlow 这样做是出于优化目的。然而，在 FL 模拟等设置中，我们希望将 GPU 分割成多个 "虚拟 "客户端，这并不是一个理想的机制。幸运的是，我们可以通过 `启用内存增长 <https://www.tensorflow.org/guide/gpu#limiting_gpu_memory_growth>`_来禁用这一默认行为。

source: This would need to be done in the main process (which is where the server would run) and in each Actor created by the VCE. By means of :code:`actor_kwargs` we can pass the reserved key `"on_actor_init_fn"` in order to specify a function to be executed upon actor initialization. In this case, to enable GPU growth for TF workloads. It would look as follows:
zh_hans: 这需要在主进程（也就是服务器运行的地方）和 VCE 创建的每个角色中完成。通过 :code:`actor_kwargs`，我们可以传递保留关键字`"on_actor_init_fn"`，以指定在角色初始化时执行的函数。在本例中，为了使 TF 工作负载的 GPU 增长，它看起来如下：

source: This is precisely the mechanism used in `Tensorflow/Keras Simulation <https://github.com/adap/flower/tree/main/examples/simulation-tensorflow>`_ example.
zh_hans: 这正是 "Tensorflow/Keras 模拟 <https://github.com/adap/flower/tree/main/examples/simulation-tensorflow>`_"示例中使用的机制。

source: Multi-node setups
zh_hans: 多节点设置

source: The VCE does not currently offer a way to control on which node a particular `virtual` client is executed. In other words, if more than a single node have the resources needed by a client to run, then any of those nodes could get the client workload scheduled onto. Later in the FL process (i.e. in a different round) the same client could be executed by a different node. Depending on how your clients access their datasets, this might require either having a copy of all dataset partitions on all nodes or a dataset serving mechanism (e.g. using nfs, a database) to circumvent data duplication.
zh_hans: VCE 目前不提供控制特定 "虚拟 "客户端在哪个节点上执行的方法。换句话说，如果不止一个节点拥有客户端运行所需的资源，那么这些节点中的任何一个都可能被调度到客户端工作负载上。在 FL 进程的稍后阶段（即在另一轮中），同一客户端可以由不同的节点执行。根据客户访问数据集的方式，这可能需要在所有节点上复制所有数据集分区，或采用数据集服务机制（如使用 nfs 或数据库）来避免数据重复。

source: By definition virtual clients are `stateless` due to their ephemeral nature. A client state can be implemented as part of the Flower client class but users need to ensure this saved to persistent storage (e.g. a database, disk) and that can be retrieve later by the same client regardless on which node it is running from. This is related to the point above also since, in some way, the client's dataset could be seen as a type of `state`.
zh_hans: 根据定义，虚拟客户端是 "无状态 "的，因为它们具有即时性。客户机状态可以作为 Flower 客户机类的一部分来实现，但用户需要确保将其保存到持久存储（如数据库、磁盘）中，而且无论客户机在哪个节点上运行，都能在以后检索到。这也与上述观点有关，因为在某种程度上，客户端的数据集可以被视为一种 "状态"。

source: Save and load model checkpoints
zh_hans: 保存和加载模型检查点

source: Flower does not automatically save model updates on the server-side. This how-to guide describes the steps to save (and load) model checkpoints in Flower.
zh_hans: Flower 不会在服务器端自动保存模型更新。本指南将介绍在 Flower 中保存（和加载）模型检查点的步骤。

source: Model checkpointing
zh_hans: 模型检查点

source: Model updates can be persisted on the server-side by customizing :code:`Strategy` methods. Implementing custom strategies is always an option, but for many cases it may be more convenient to simply customize an existing strategy. The following code example defines a new :code:`SaveModelStrategy` which customized the existing built-in :code:`FedAvg` strategy. In particular, it customizes :code:`aggregate_fit` by calling :code:`aggregate_fit` in the base class (:code:`FedAvg`). It then continues to save returned (aggregated) weights before it returns those aggregated weights to the caller (i.e., the server):
fr: Les mises à jour du modèle peuvent être conservées côté serveur en personnalisant les méthodes :code:`Strategy`. L'implémentation de stratégies personnalisées est toujours possible, mais dans de nombreux cas, il peut être plus pratique de simplement personnaliser une stratégie existante. L'exemple de code suivant définit une nouvelle :code:`SaveModelStrategy` qui personnalise la stratégie intégrée :code:`FedAvg` existante. En particulier, il personnalise :code:`aggregate_fit` en appelant :code:`aggregate_fit` dans la classe de base (:code:`FedAvg`). Il continue ensuite à sauvegarder les poids retournés (agrégés) avant de renvoyer ces poids agrégés à l'appelant (c'est-à-dire le serveur) :
zh_hans: 模型更新可通过自定义 :code:`Strategy` 方法在服务器端持久化。实现自定义策略始终是一种选择，但在许多情况下，简单地自定义现有策略可能更方便。下面的代码示例定义了一个新的 :code:`SaveModelStrategy`，它自定义了现有的内置 :code:`FedAvg` 策略。特别是，它通过调用基类（:code:`FedAvg`）中的 :code:`aggregate_fit` 来定制 :code:`aggregate_fit`。然后继续保存返回的（聚合）参数，然后再将这些聚合参数返回给调用者（即服务器）：

source: Save and load PyTorch checkpoints
zh_hans: 保存和加载 PyTorch 检查点

source: Similar to the previous example but with a few extra steps, we'll show how to store a PyTorch checkpoint we'll use the ``torch.save`` function. Firstly, ``aggregate_fit`` returns a ``Parameters`` object that has to be transformed into a list of NumPy ``ndarray``'s, then those are transformed into the PyTorch ``state_dict`` following the ``OrderedDict`` class structure.
zh_hans: 与前面的例子类似，但多了几个步骤，我们将展示如何存储一个 PyTorch 检查点，我们将使用 ``torch.save`` 函数。首先，``aggregate_fit`` 返回一个 ``Parameters`` 对象，它必须被转换成一个 NumPy ``ndarray`` 的列表，然后这些对象按照 ``OrderedDict`` 类结构被转换成 PyTorch `state_dict` 对象。

source: To load your progress, you simply append the following lines to your code. Note that this will iterate over all saved checkpoints and load the latest one:
fr: Pour charger ta progression, il te suffit d'ajouter les lignes suivantes à ton code. Note que cela va itérer sur tous les points de contrôle sauvegardés et charger le plus récent :
zh_hans: 要加载进度，只需在代码中添加以下几行。请注意，这将遍历所有已保存的检查点，并加载最新的检查点：

source: Upgrade to Flower 1.0
fr: Passe à Flower 1.0
zh_hans: 升级至 Flower 1.0

source: Flower 1.0 is here. Along with new features, Flower 1.0 provides a stable foundation for future growth. Compared to Flower 0.19 (and other 0.x series releases), there are a few breaking changes that make it necessary to change the code of existing 0.x-series projects.
fr: Flower 1.0 est arrivé. En plus de nouvelles fonctionnalités, Flower 1.0 fournit une base stable pour la croissance future. Par rapport à Flower 0.19 (et aux autres versions de la série 0.x), il y a quelques changements qui nécessitent de modifier le code des projets de la série 0.x existants.
zh_hans: Flower 1.0 正式发布。除了新功能，Flower 1.0 还为未来的发展奠定了稳定的基础。与 Flower 0.19（以及其他 0.x 系列版本）相比，有一些破坏性改动需要修改现有 0.x 系列项目的代码。

source: Install update
fr: Installer la mise à jour
zh_hans: 安装更新

source: Here's how to update an existing installation to Flower 1.0 using either pip or Poetry:
fr: Voici comment mettre à jour une installation existante vers Flower 1.0 en utilisant soit pip soit Poetry :
zh_hans: 下面介绍如何使用 pip 或 Poetry 将现有安装更新到 Flower 1.0：

source: pip: add ``-U`` when installing.
fr: pip : ajoute ``-U`` lors de l'installation.
zh_hans: pip: 安装时添加 ``-U``.

source: ``python -m pip install -U flwr`` (when using ``start_server`` and ``start_client``)
fr: ``python -m pip install -U flwr`` (lors de l'utilisation de ``start_server`` et ``start_client``)
zh_hans: `python -m pip install -U flwr``（当使用`start_server`和`start_client`时）

source: ``python -m pip install -U flwr[simulation]`` (when using ``start_simulation``)
fr: ``python -m pip install -U flwr[simulation]`` (lors de l'utilisation de ``start_simulation``)
zh_hans: `python -m pip install -U flwr[simulation]``（当使用`start_simulation``时）

source: Poetry: update the ``flwr`` dependency in ``pyproject.toml`` and then reinstall (don't forget to delete ``poetry.lock`` via ``rm poetry.lock`` before running ``poetry install``).
fr: Poetry : mettez à jour la dépendance ``flwr`` dans ``pyproject.toml`` puis réinstallez (n'oubliez pas de supprimer ``poetry.lock`` via ``rm poetry.lock`` avant d'exécuter ``poetry install``).
zh_hans: Poetry：更新 ``pyproject.toml`` 中的 ``flwr`` 依赖包，然后重新安装（运行 ``poetry install`` 前，别忘了通过 ``rm poetry.lock` 删除 ``poetry.lock`）。

source: ``flwr = "^1.0.0"`` (when using ``start_server`` and ``start_client``)
fr: ``flwr = "^1.0.0"`` (lors de l'utilisation de ``start_server`` et ``start_client``)
zh_hans: ``flwr = "^1.0.0"`` （当使用 ``start_server` 和 ``start_client` 时）

source: ``flwr = { version = "^1.0.0", extras = ["simulation"] }`` (when using ``start_simulation``)
fr: ``flwr = { version = "^1.0.0", extras = ["simulation"] }`` (lors de l'utilisation de ``start_simulation``)
zh_hans: ``flwr = { version = "^1.0.0", extras = ["simulation"] }``（当使用``start_simulation``时）

source: Required changes
fr: Changements nécessaires
zh_hans: 所需变更

source: The following breaking changes require manual updates.
fr: Les changements de rupture suivants nécessitent des mises à jour manuelles.
zh_hans: 以下更改需要手动更新。

source: General
fr: Généralités
zh_hans: 一般情况

source: Pass all arguments as keyword arguments (not as positional arguments). Here's an example:
fr: Passe tous les arguments comme des arguments de mots-clés (et non comme des arguments de position). Voici un exemple :
zh_hans: 将所有参数作为关键字参数传递（而不是位置参数）。下面是一个例子：

source: Flower 0.19 (positional arguments): ``start_client("127.0.0.1:8080", FlowerClient())``
fr: Flower 0.19 (arguments positionnels) : ``start_client("127.0.0.1:8080", FlowerClient())``
zh_hans: Flower 0.19 (位置参数)： ``start_client("127.0.0.1:8080", FlowerClient())``

source: Flower 1.0 (keyword arguments): ``start_client(server_address="127.0.0.1:8080", client=FlowerClient())``
fr: Fleur 1.0 (arguments de mots-clés) : ``start_client(server_address="127.0.0.1:8080", client=FlowerClient())``
zh_hans: Flower 1.0（关键字参数）： ``start_client(server_address="127.0.0.1:8080", client=FlowerClient())``

source: Subclasses of ``NumPyClient``: change ``def get_parameters(self):``` to ``def get_parameters(self, config):``
fr: Sous-classes de ``NumPyClient`` : changez ``def get_parameters(self):`` en ``def get_parameters(self, config):``
zh_hans: NumPyClient的子类：将``def get_parameters(self):```改为``def get_parameters(self,config):``

source: Subclasses of ``Client``: change ``def get_parameters(self):``` to ``def get_parameters(self, ins: GetParametersIns):``
fr: Sous-classes de ``Client`` : changez ``def get_parameters(self):`` en ``def get_parameters(self, ins : GetParametersIns):``
zh_hans: 客户端 "的子类：将 "get_parameters(self): "改为 "get_parameters(self, ins: GetParametersIns):"

source: Strategies / ``start_server`` / ``start_simulation``
fr: Stratégies / ``démarrer_serveur`` / ``démarrer_simulation``
zh_hans: 策略 / ``start_server`` / ``start_simulation``

source: Pass ``ServerConfig`` (instead of a dictionary) to ``start_server`` and ``start_simulation``. Here's an example:
fr: Passez ``ServerConfig`` (au lieu d'un dictionnaire) à ``start_server`` et ``start_simulation``. Voici un exemple :
zh_hans: 向 ``start_server`` 和 ``start_simulation` 传递 ``ServerConfig``（而不是 dictionary）。下面是一个例子：

source: Replace ``num_rounds=1`` in ``start_simulation`` with the new ``config=ServerConfig(...)`` (see previous item)
fr: Remplacer ``num_rounds=1`` dans ``start_simulation`` par le nouveau ``config=ServerConfig(...)`` (voir point précédent)
zh_hans: 将`start_simulation``中的`num_rounds=1``替换为新的`config=ServerConfig(...)`（参见前一项）

source: Remove ``force_final_distributed_eval`` parameter from calls to ``start_server``. Distributed evaluation on all clients can be enabled by configuring the strategy to sample all clients for evaluation after the last round of training.
fr: Supprime le paramètre ``force_final_distributed_eval`` des appels à ``start_server``. L'évaluation distribuée sur tous les clients peut être activée en configurant la stratégie pour échantillonner tous les clients pour l'évaluation après le dernier tour de formation.
zh_hans: 删除调用 ``start_server`` 时的 ``force_final_distributed_eval` 参数。可以通过配置策略，在最后一轮训练后对所有客户端进行抽样评估，从而启用对所有客户端的分布式评估。

source: Rename parameter/ndarray conversion functions:
fr: Renomme les fonctions de conversion des paramètres et des tableaux :
zh_hans: 重命名参数/数组转换函数：

source: Strategy initialization: if the strategy relies on the default values for ``fraction_fit`` and ``fraction_evaluate``, set ``fraction_fit`` and ``fraction_evaluate`` manually to ``0.1``. Projects that do not manually create a strategy (by calling ``start_server`` or ``start_simulation`` without passing a strategy instance) should now manually initialize FedAvg with ``fraction_fit`` and ``fraction_evaluate`` set to ``0.1``.
fr: Initialisation de la stratégie : si la stratégie repose sur les valeurs par défaut de ``fraction_fit`` et ``fraction_evaluate``, fixer manuellement ``fraction_fit`` et ``fraction_evaluate`` à `0.1``. Les projets qui ne créent pas manuellement une stratégie (en appelant ``start_server` ou ``start_simulation`` sans passer une instance de stratégie) doivent maintenant initialiser manuellement FedAvg avec ``fraction_fit`` et ``fraction_evaluate`` fixés à ``0.1``.
zh_hans: 策略初始化：如果策略依赖于 ``fraction_fit`` 和 ``fraction_evaluate`` 的默认值，请手动将 ``fraction_fit`` 和 ``fraction_evaluate`` 设置为 ``0.1``。未手动创建策略的项目（调用 ``start_server` 或 ``start_simulation` 时未传递策略实例）现在应手动初始化 FedAvg，并将 `fraction_fit` 和 `fraction_evaluate` 设为 `0.1``。

source: Rename built-in strategy parameters (e.g., ``FedAvg``):
fr: Renommer les paramètres de stratégie intégrés (par exemple, ``FedAvg``) :
zh_hans: 重命名内置策略参数（例如，`FedAvg``）：

source: Rename ``rnd`` to ``server_round``. This impacts multiple methods and functions, for example, ``configure_fit``, ``aggregate_fit``, ``configure_evaluate``, ``aggregate_evaluate``, and ``evaluate_fn``.
fr: Renommez ``rnd`` en ``server_round``. Cela a un impact sur plusieurs méthodes et fonctions, par exemple, ``configure_fit``, ``aggregate_fit``, ``configure_evaluate``, ``aggregate_evaluate``, et ``evaluate_fn``.
zh_hans: 将 `rnd` 更名为 `server_round`。这会影响多个方法和函数，例如 ``configure_fit``、``aggregate_fit``、``configure_evaluate``、`aggregate_evaluate`` 和 ``evaluate_fn``。

source: Add ``server_round`` and ``config`` to ``evaluate_fn``:
fr: Ajoute ``server_round`` et ``config`` à `evaluate_fn`` :
zh_hans: 在 ``evaluate_fn` 中添加 ``server_round` 和 ``config`：

source: Custom strategies
fr: Stratégies personnalisées
zh_hans: 定制策略

source: The type of parameter ``failures`` has changed from ``List[BaseException]`` to ``List[Union[Tuple[ClientProxy, FitRes], BaseException]]`` (in ``aggregate_fit``) and ``List[Union[Tuple[ClientProxy, EvaluateRes], BaseException]]`` (in ``aggregate_evaluate``)
fr: Le type du paramètre ``failures`` a changé de ``List[BaseException]`` à ``List[Union[Tuple[ClientProxy, FitRes], BaseException]]`` (dans ``aggregate_fit``) et ``List[Union[Tuple[ClientProxy, EvaluateRes], BaseException]]`` (dans ``aggregate_evaluate``)
zh_hans: 参数``failures``的类型已从``List[BaseException]``变为``List[Union[Tuple[ClientProxy, FitRes], BaseException]]``（在``agregate_fit``中）和``List[Union[Tuple[ClientProxy, EvaluateRes], BaseException]]``（在``agregate_evaluate``中）

source: The ``Strategy`` method ``evaluate`` now receives the current round of federated learning/evaluation as the first parameter:
fr: La méthode ``Stratégie`` `évaluer`` reçoit maintenant le cycle actuel d'apprentissage/évaluation fédéré comme premier paramètre :
zh_hans: ``Strategy``方法 的``evaluate``现在会接收当前一轮联邦学习/评估作为第一个参数：

source: Optional improvements
fr: Améliorations facultatives
zh_hans: 可选的改进措施

source: Along with the necessary changes above, there are a number of potential improvements that just became possible:
fr: En plus des changements nécessaires mentionnés ci-dessus, il existe un certain nombre d'améliorations potentielles qui viennent d'être rendues possibles :
zh_hans: 除了上述必要的改动之外，还有一些潜在的改进措施：

source: Remove "placeholder" methods from subclasses of ``Client`` or ``NumPyClient``. If you, for example, use server-side evaluation, then empy placeholder implementations of ``evaluate`` are no longer necessary.
fr: Supprime les méthodes "placeholder" des sous-classes de ``Client`` ou de ``NumPyClient``. Si tu utilises, par exemple, l'évaluation côté serveur, alors les implémentations "placeholder" de ``evaluate`` ne sont plus nécessaires.
zh_hans: 删除 ``Client`` 或 ``NumPyClient`` 子类中的 "占位符 "方法。例如，如果你使用服务器端评估，那么就不再需要``evaluate``的 "空占位符 "实现。

source: Configure the round timeout via ``start_simulation``: ``start_simulation(..., config=flwr.server.ServerConfig(num_rounds=3, round_timeout=600.0), ...)``
fr: Configurez le délai d'attente de la ronde via ``start_simulation`` : ``start_simulation(..., config=flwr.server.ServerConfig(num_rounds=3, round_timeout=600.0), ...)``
zh_hans: 通过 ``start_simulation`` 配置循环超时： ``start_simulation(..., config=flwr.server.ServerConfig(num_rounds=3, round_timeout=600.0), ...)``

source: Further help
fr: Aide supplémentaire
zh_hans: 更多帮助

source: Most official `Flower code examples <https://github.com/adap/flower/tree/main/examples>`_ are already updated to Flower 1.0, they can serve as a reference for using the Flower 1.0 API. If there are further questionsm, `join the Flower Slack <https://flower.dev/join-slack/>`_ and use the channgel ``#questions``.
fr: La plupart des `exemples de code Flower officiels <https://github.com/adap/flower/tree/main/examples>`_ sont déjà mis à jour vers Flower 1.0, ils peuvent servir de référence pour l'utilisation de l'API Flower 1.0. Si vous avez d'autres questions, `joins le Slack Flower <https://flower.dev/join-slack/>`_ et utilise le canal ``#questions``.
zh_hans: 大多数官方的 `Flower 代码示例 <https://github.com/adap/flower/tree/main/examples>`_ 已经更新到 Flower 1.0，它们可以作为使用 Flower 1.0 API 的参考。如果还有其他问题，请加入 Flower Slack <https://flower.dev/join-slack/>`_ 并使用 "#questions``"。

source: Use strategies
zh_hans: 使用策略

source: Flower allows full customization of the learning process through the :code:`Strategy` abstraction. A number of built-in strategies are provided in the core framework.
fr: Flower permet une personnalisation complète du processus d'apprentissage grâce à l'abstraction :code:`Stratégie`. Un certain nombre de stratégies intégrées sont fournies dans le cadre principal.
zh_hans: Flower 允许通过 :code:`Strategy` 抽象类对学习过程进行完全定制。核心框架中提供了许多内置策略。
