Repository: lucacorbucci/flower
Catalog: doc/locales/*/LC_MESSAGES/framework-docs.po
Languages: fr, zh_hans

source: Or simply install all dependencies using Poetry:
fr: Ou installe simplement toutes les dépendances à l'aide de Poetry :
zh_hans: 或者直接使用 Poetry 安装所有依赖项：

source: Now that we have all our dependencies installed, let's run a simple distributed training with two clients and one server. However, before setting up the client and server, we will define all functionalities that we need for our federated learning setup within :code:`utils.py`. The :code:`utils.py` contains different functions defining all the machine learning basics:
fr: Maintenant que toutes nos dépendances sont installées, exécutons une formation distribuée simple avec deux clients et un serveur. Cependant, avant de configurer le client et le serveur, nous allons définir toutes les fonctionnalités dont nous avons besoin pour notre configuration d'apprentissage fédéré dans :code:`utils.py`. Le :code:`utils.py` contient différentes fonctions définissant toutes les bases de l'apprentissage automatique :
zh_hans: 现在我们已经安装了所有的依赖项，让我们用两个客户端和一个服务器来运行一个简单的分布式训练。不过，在设置客户端和服务器之前，我们将在 :code:`utils.py` 中定义联邦学习设置所需的所有功能。:code:`utils.py`包含定义所有机器学习基础知识的不同函数：

source: Returns the paramters of a :code:`sklearn` LogisticRegression model
fr: Renvoie les paramètres d'un modèle de régression logistique :code:`sklearn`
zh_hans: 返回 :code:`sklearn` LogisticRegression 模型的参数

source: Sets the parameters of a :code:`sklean` LogisticRegression model
fr: Définit les paramètres d'un modèle de régression logistique :code:`sklean`
zh_hans: 设置:code:`sklean`的LogisticRegression模型的参数

source: Initializes the model parameters that the Flower server will ask for
fr: Initialise les paramètres du modèle que le serveur de Flower demandera
zh_hans: 初始化 Flower 服务器将要求的模型参数

source: Loads the MNIST dataset using OpenML
fr: Charge l'ensemble de données MNIST à l'aide d'OpenML
zh_hans: 使用 OpenML 加载 MNIST 数据集

source: Shuffles data and its label
fr: Mélange les données et leur étiquette
zh_hans: 对数据及其标签进行洗牌

source: Splits datasets into a number of partitions
fr: Divise les ensembles de données en un certain nombre de partitions
zh_hans: 将数据集分割成多个分区

source: Please check out :code:`utils.py` `here <https://github.com/adap/flower/blob/main/examples/sklearn-logreg-mnist/utils.py>`_ for more details. The pre-defined functions are used in the :code:`client.py` and imported. The :code:`client.py` also requires to import several packages such as Flower and scikit-learn:
fr: Tu peux consulter :code:`utils.py` `ici <https://github.com/adap/flower/blob/main/examples/sklearn-logreg-mnist/utils.py>`_ pour plus de détails. Les fonctions prédéfinies sont utilisées dans :code:`client.py` et importées. :code:`client.py` nécessite également d'importer plusieurs paquets tels que Flower et scikit-learn :
zh_hans: 更多详情请查看 :code:`utils.py`` 这里 <https://github.com/adap/flower/blob/main/examples/sklearn-logreg-mnist/utils.py>`_。在 :code:`client.py` 中使用并导入了预定义函数。:code:`client.py` 还需要导入几个软件包，如 Flower 和 scikit-learn：

source: We load the MNIST dataset from `OpenML <https://www.openml.org/d/554>`_, a popular image classification dataset of handwritten digits for machine learning. The utility :code:`utils.load_mnist()` downloads the training and test data. The training set is split afterwards into 10 partitions with :code:`utils.partition()`.
fr: Nous chargeons l'ensemble de données MNIST de `OpenML <https://www.openml.org/d/554>`_, un ensemble de données de classification d'images populaires de chiffres manuscrits pour l'apprentissage automatique. L'utilitaire :code:`utils.load_mnist()` télécharge les données d'entraînement et de test. L'ensemble d'entraînement est ensuite divisé en 10 partitions avec :code:`utils.partition()`.
zh_hans: 我们从 `OpenML <https://www.openml.org/d/554>`_ 中加载 MNIST 数据集，这是一个用于机器学习的流行手写数字图像分类数据集。实用程序 :code:`utils.load_mnist()` 下载训练和测试数据。然后使用 :code:`utils.partition()`将训练集分割成 10 个分区。

source: Next, the logistic regression model is defined and initialized with :code:`utils.set_initial_params()`.
fr: Ensuite, le modèle de régression logistique est défini et initialisé avec :code:`utils.set_initial_params()`.
zh_hans: 接下来，使用 :code:`utils.set_initial_params()` 对逻辑回归模型进行定义和初始化。

source: The Flower server interacts with clients through an interface called :code:`Client`. When the server selects a particular client for training, it sends training instructions over the network. The client receives those instructions and calls one of the :code:`Client` methods to run your code (i.e., to fit the logistic regression we defined earlier).
fr: Le serveur Flower interagit avec les clients par le biais d'une interface appelée :code:`Client`. Lorsque le serveur sélectionne un client particulier pour la formation, il envoie des instructions de formation sur le réseau. Le client reçoit ces instructions et appelle l'une des méthodes :code:`Client` pour exécuter ton code (c'est-à-dire pour ajuster la régression logistique que nous avons définie plus tôt).
zh_hans: Flower 服务器通过一个名为 :code:`Client` 的接口与客户端交互。当服务器选择一个特定的客户端进行训练时，它会通过网络发送训练指令。客户端接收到这些指令后，会调用 :code:`Client` 方法之一来运行您的代码（即拟合我们之前定义的逻辑回归）。

source: Flower provides a convenience class called :code:`NumPyClient` which makes it easier to implement the :code:`Client` interface when your workload uses scikit-learn. Implementing :code:`NumPyClient` usually means defining the following methods (:code:`set_parameters` is optional though):
fr: Flower fournit une classe de commodité appelée :code:`NumPyClient` qui facilite la mise en œuvre de l'interface :code:`Client` lorsque ta charge de travail utilise scikit-learn. Mettre en œuvre :code:`NumPyClient` signifie généralement définir les méthodes suivantes (:code:`set_parameters` est cependant facultatif) :
zh_hans: Flower 提供了一个名为 :code:`NumPyClient` 的便捷类，当你的工作负载使用 scikit-learn 时，它可以让你更容易地实现 :code:`Client` 接口。实现 :code:`NumPyClient` 通常意味着定义以下方法（:code:`set_parameters` 是可选的）：

source: is directly imported with :code:`utils.set_model_params()`
fr: est directement importé avec :code:`utils.set_model_params()`
zh_hans: 直接导入 :code:`utils.set_model_params()`

source: The methods can be implemented in the following way:
fr: Les méthodes peuvent être mises en œuvre de la manière suivante :
zh_hans: 这些方法可以通过以下方式实现：

source: We can now create an instance of our class :code:`MnistClient` and add one line to actually run this client:
fr: Nous pouvons maintenant créer une instance de notre classe :code:`MnistClient` et ajouter une ligne pour exécuter ce client :
zh_hans: 现在我们可以创建一个 :code:`MnistClient` 类的实例，并添加一行来实际运行该客户端：

source: The following Flower server is a little bit more advanced and returns an evaluation function for the server-side evaluation. First, we import again all required libraries such as Flower and scikit-learn.
fr: Le serveur Flower suivant est un peu plus avancé et renvoie une fonction d'évaluation pour l'évaluation côté serveur. Tout d'abord, nous importons à nouveau toutes les bibliothèques requises telles que Flower et scikit-learn.
zh_hans: 下面的 Flower 服务器更先进一些，会返回一个用于服务器端评估的评估函数。首先，我们再次导入所有需要的库，如 Flower 和 scikit-learn。

source: :code:`server.py`, import Flower and start the server:
fr: :code:`server.py`, importe Flower et démarre le serveur :
zh_hans: :code:`server.py`, 导入 Flower 并启动服务器：

source: The number of federated learning rounds is set in :code:`fit_round()` and the evaluation is defined in :code:`get_evaluate_fn()`. The evaluation function is called after each federated learning round and gives you information about loss and accuracy.
fr: Le nombre de tours d'apprentissage fédéré est défini dans :code:`fit_round()` et l'évaluation est définie dans :code:`get_evaluate_fn()`. La fonction d'évaluation est appelée après chaque tour d'apprentissage fédéré et te donne des informations sur la perte et la précision.
zh_hans: 联邦学习轮数在 :code:`fit_round()` 中设置，评估在 :code:`get_evaluate_fn()` 中定义。每轮联邦学习后都会调用评估函数，并提供有关损失值和准确率的信息。

source: The :code:`main` contains the server-side parameter initialization :code:`utils.set_initial_params()` as well as the aggregation strategy :code:`fl.server.strategy:FedAvg()`. The strategy is the default one, federated averaging (or FedAvg), with two clients and evaluation after each federated learning round. The server can be started with the command :code:`fl.server.start_server(server_address="0.0.0.0:8080", strategy=strategy, config=fl.server.ServerConfig(num_rounds=3))`.
fr: Le :code:`main` contient l'initialisation des paramètres côté serveur :code:`utils.set_initial_params()` ainsi que la stratégie d'agrégation :code:`fl.server.strategy:FedAvg()`. La stratégie est celle par défaut, la moyenne fédérée (ou FedAvg), avec deux clients et une évaluation après chaque tour d'apprentissage fédéré. Le serveur peut être démarré avec la commande :code:`fl.server.start_server(server_address="0.0.0.0:8080", strategy=strategy, config=fl.server.ServerConfig(num_rounds=3))`.
zh_hans: :code:`main`包含服务器端参数初始化:code:`utils.set_initial_params()`以及聚合策略 :code:`fl.server.strategy:FedAvg()`。该策略是默认的联邦平均（或 FedAvg）策略，有两个客户端，在每轮联邦学习后进行评估。可以使用 :code:`fl.server.start_server(server_address="0.0.0.0:8080", strategy=strategy, config=fl.server.ServerConfig(num_rounds=3))` 命令启动服务器。

source: With both client and server ready, we can now run everything and see federated learning in action. Federated learning systems usually have a server and multiple clients. We, therefore, have to start the server first:
fr: Le client et le serveur étant prêts, nous pouvons maintenant tout lancer et voir l'apprentissage fédéré en action. Les systèmes d'apprentissage fédéré ont généralement un serveur et plusieurs clients. Nous devons donc commencer par lancer le serveur :
zh_hans: 客户端和服务器都准备就绪后，我们现在就可以运行一切，看看联邦学习的运行情况。联邦学习系统通常有一个服务器和多个客户端。因此，我们必须先启动服务器：

source: Congratulations! You've successfully built and run your first federated learning system. The full `source code <https://github.com/adap/flower/tree/main/examples/sklearn-logreg-mnist>`_ for this example can be found in :code:`examples/sklearn-logreg-mnist`.
fr: Félicitations ! Tu as réussi à construire et à faire fonctionner ton premier système d'apprentissage fédéré. Le code source complet <https://github.com/adap/flower/tree/main/examples/sklearn-logreg-mnist>`_ de cet exemple se trouve dans :code:`examples/sklearn-logreg-mnist`.
zh_hans: 恭喜您！您已经成功构建并运行了第一个联邦学习系统。本示例的`完整源代码 <https://github.com/adap/flower/tree/main/examples/sklearn-logreg-mnist>`_ 可以在 :code:`examples/sklearn-logreg-mnist` 中找到。

source: Check out this Federated Learning quickstart tutorial for using Flower with TensorFlow to train a MobilNetV2 model on CIFAR-10.
zh_hans: 查看此联邦学习快速入门教程，了解如何使用 Flower 和 TensorFlow 在 CIFAR-10 上训练 MobilNetV2 模型。

source: Quickstart TensorFlow
fr: Démarrage rapide de TensorFlow
zh_hans: 快速入门 TensorFlow

source: Let's build a federated learning system in less than 20 lines of code!
fr: Construisons un système d'apprentissage fédéré en moins de 20 lignes de code !
zh_hans: 让我们用不到 20 行代码构建一个联邦学习系统！

source: Before Flower can be imported we have to install it:
fr: Avant de pouvoir importer une fleur, nous devons l'installer :
zh_hans: 在导入 Flower 之前，我们必须先安装它：

source: Since we want to use the Keras API of TensorFlow (TF), we have to install TF as well:
fr: Comme nous voulons utiliser l'API Keras de TensorFlow (TF), nous devons également installer TF :
zh_hans: 由于我们要使用 TensorFlow (TF) 的 Keras API，因此还必须安装 TF：

source: Next, in a file called :code:`client.py`, import Flower and TensorFlow:
fr: Ensuite, dans un fichier appelé :code:`client.py`, importe Flower et TensorFlow :
zh_hans: 接下来，在名为 :code:`client.py` 的文件中导入 Flower 和 TensorFlow：

source: We use the Keras utilities of TF to load CIFAR10, a popular colored image classification dataset for machine learning. The call to :code:`tf.keras.datasets.cifar10.load_data()` downloads CIFAR10, caches it locally, and then returns the entire training and test set as NumPy ndarrays.
fr: Nous utilisons les utilitaires Keras de TF pour charger CIFAR10, un ensemble de données de classification d'images colorées populaire pour l'apprentissage automatique. L'appel à :code:`tf.keras.datasets.cifar10.load_data()` télécharge CIFAR10, le met en cache localement, puis renvoie l'ensemble d'entraînement et de test sous forme de NumPy ndarrays.
zh_hans: 我们使用 TF 的 Keras 实用程序加载 CIFAR10，这是一个用于机器学习的流行彩色图像分类数据集。调用 :code:`tf.keras.datasets.cifar10.load_data()` 会下载 CIFAR10，将其缓存到本地，然后以 NumPy ndarrays 的形式返回整个训练集和测试集。

source: Next, we need a model. For the purpose of this tutorial, we use MobilNetV2 with 10 output classes:
fr: Ensuite, nous avons besoin d'un modèle. Pour les besoins de ce tutoriel, nous utilisons MobilNetV2 avec 10 classes de sortie :
zh_hans: 接下来，我们需要一个模型。在本教程中，我们使用带有 10 个输出类的 MobilNetV2：

source: Flower provides a convenience class called :code:`NumPyClient` which makes it easier to implement the :code:`Client` interface when your workload uses Keras. The :code:`NumPyClient` interface defines three methods which can be implemented in the following way:
fr: Flower fournit une classe de commodité appelée :code:`NumPyClient` qui facilite la mise en œuvre de l'interface :code:`Client` lorsque ta charge de travail utilise Keras. L'interface :code:`NumPyClient` définit trois méthodes qui peuvent être mises en œuvre de la manière suivante :
zh_hans: Flower 提供了一个名为 :code:`NumPyClient` 的便捷类，当您的工作负载使用 Keras 时，该类可以更轻松地实现 :code:`Client` 接口。:code:`NumPyClient` 接口定义了三个方法，可以通过以下方式实现：

source: Each client will have its own dataset.
fr: Chaque client aura son propre ensemble de données.
zh_hans: 每个客户都有自己的数据集。

source: You should now see how the training does in the very first terminal (the one that started the server):
fr: Tu devrais maintenant voir comment la formation se déroule dans le tout premier terminal (celui qui a démarré le serveur) :
zh_hans: 现在你应该能在第一个终端（启动服务器的终端）看到训练的效果了：

source: Congratulations! You've successfully built and run your first federated learning system. The full `source code <https://github.com/adap/flower/blob/main/examples/quickstart-tensorflow/client.py>`_ for this can be found in :code:`examples/quickstart-tensorflow/client.py`.
zh_hans: 恭喜您！您已经成功构建并运行了第一个联邦学习系统。`完整的源代码 <https://github.com/adap/flower/blob/main/examples/quickstart-tensorflow/client.py>`_ 可以在 :code:`examples/quickstart-tensorflow/client.py` 中找到。

source: Check out this Federated Learning quickstart tutorial for using Flower with XGBoost to train classification models on trees.
zh_hans: 查看此联邦学习 快速入门教程，了解如何使用 Flower 和 XGBoost 上训练分类模型。

source: Quickstart XGBoost
fr: Démarrage rapide XGBoost
zh_hans: XGBoost快速入门

source: Federated XGBoost
zh_hans: 联邦化 XGBoost

source: EXtreme Gradient Boosting (**XGBoost**) is a robust and efficient implementation of gradient-boosted decision tree (**GBDT**), that maximises the computational boundaries for boosted tree methods. It's primarily designed to enhance both the performance and computational speed of machine learning models. In XGBoost, trees are constructed concurrently, unlike the sequential approach taken by GBDT.
zh_hans: EXtreme Gradient Boosting（**XGBoost**）是梯度提升决策树（**GBDT**）的一种稳健而高效的实现方法，能最大限度地提高提升树方法的计算边界。它主要用于提高机器学习模型的性能和计算速度。在 XGBoost 中，决策树是并发构建的，与 GBDT 采用的顺序方法不同。

source: Often, for tabular data on medium-sized datasets with fewer than 10k training examples, XGBoost surpasses the results of deep learning techniques.
zh_hans: 对于训练示例少于 10k 的中型数据集上的表格数据，XGBoost 的结果往往超过深度学习技术。

source: Why federated XGBoost?
zh_hans: 为什么选择联邦 XGBoost？

source: Indeed, as the demand for data privacy and decentralized learning grows, there's an increasing requirement to implement federated XGBoost systems for specialised applications, like survival analysis and financial fraud detection.
zh_hans: 事实上，随着对数据隐私和分散学习的需求不断增长，越来越多的专业应用（如生存分析和金融欺诈检测）需要实施联邦 XGBoost 系统。

source: Federated learning ensures that raw data remains on the local device, making it an attractive approach for sensitive domains where data security and privacy are paramount. Given the robustness and efficiency of XGBoost, combining it with federated learning offers a promising solution for these specific challenges.
zh_hans: 联邦学习可确保原始数据保留在本地设备上，因此对于数据安全和隐私至关重要的敏感领域来说，这是一种极具吸引力的方法。鉴于 XGBoost 的稳健性和高效性，将其与联邦学习相结合为应对这些特定挑战提供了一种前景广阔的解决方案。

source: In this tutorial we will learn how to train a federated XGBoost model on HIGGS dataset using Flower and :code:`xgboost` package. We use a simple example (`full code xgboost-quickstart <https://github.com/adap/flower/tree/main/examples/xgboost-quickstart>`_) with two *clients* and one *server* to demonstrate how federated XGBoost works, and then we dive into a more complex example (`full code xgboost-comprehensive <https://github.com/adap/flower/tree/main/examples/xgboost-comprehensive>`_) to run various experiments.
zh_hans: 在本教程中，我们将学习如何使用 Flower 和 :code:`xgboost` 软件包在 HIGGS 数据集上训练联邦 XGBoost 模型。我们将使用一个包含两个 * 客户端* 和一个 * 服务器* 的简单示例 (`完整代码 xgboost-quickstart <https://github.com/adap/flower/tree/main/examples/xgboost-quickstart>`_)来演示联邦 XGBoost 如何工作，然后我们将深入到一个更复杂的示例 (`完整代码 xgboost-comprehensive <https://github.com/adap/flower/tree/main/examples/xgboost-comprehensive>`_)，以运行各种实验。

source: Environment Setup
zh_hans: 环境设定

source: We first need to install Flower and Flower Datasets. You can do this by running :
zh_hans: 我们首先需要安装 Flower 和 Flower Datasets。您可以通过运行 ：

source: Since we want to use :code:`xgboost` package to build up XGBoost trees, let's go ahead and install :code:`xgboost`:
zh_hans: 既然我们要使用 :code:`xgboost` 软件包来构建 XGBoost 树，那就继续安装 :code:`xgboost`：

source: *Clients* are responsible for generating individual weight-updates for the model based on their local datasets. Now that we have all our dependencies installed, let's run a simple distributed training with two clients and one server.
zh_hans: *客户端*负责根据其本地数据集为模型生成单独的模型参数更新。现在我们已经安装了所有的依赖项，让我们用两个客户端和一个服务器来运行一个简单的分布式训练。

source: In a file called :code:`client.py`, import xgboost, Flower, Flower Datasets and other related functions:
zh_hans: 在名为 :code:`client.py` 的文件中，导入 xgboost、Flower、Flower Datasets 和其他相关函数：

source: Dataset partition and hyper-parameter selection
zh_hans: 数据集划分和超参数选择

source: Prior to local training, we require loading the HIGGS dataset from Flower Datasets and conduct data partitioning for FL:
zh_hans: 在本地训练之前，我们需要从 Flower Datasets 加载 HIGGS 数据集，并对 FL 进行数据分区：

source: In this example, we split the dataset into two partitions with uniform distribution (:code:`IidPartitioner(num_partitions=2)`). Then, we load the partition for the given client based on :code:`node_id`:
zh_hans: 在此示例中，我们将数据集分割成两个均匀分布的分区（:code:`IidPartitioner(num_partitions=2)`）。然后，我们根据 :code:`node_id` 为给定客户端加载分区：

source: After that, we do train/test splitting on the given partition (client's local data), and transform data format for :code:`xgboost` package.
zh_hans: 然后，我们在给定的分区（客户端的本地数据）上进行训练/测试分割，并为 :code:`xgboost` 软件包转换数据格式。

source: The functions of :code:`train_test_split` and :code:`transform_dataset_to_dmatrix` are defined as below:
zh_hans: :code:`train_test_split` 和 :code:`transform_dataset_too_dmatrix` 的函数定义如下：

source: Finally, we define the hyper-parameters used for XGBoost training.
zh_hans: 最后，我们定义了用于 XGBoost 训练的超参数。

source: The :code:`num_local_round` represents the number of iterations for local tree boost. We use CPU for the training in default. One can shift it to GPU by setting :code:`tree_method` to :code:`gpu_hist`. We use AUC as evaluation metric.
zh_hans: 代码:`num_local_round`表示本地树的迭代次数。我们默认使用 CPU 进行训练。可以通过将 :code:`tree_method` 设置为 :code:`gpu_hist`，将其转换为 GPU。我们使用 AUC 作为评估指标。

source: Flower client definition for XGBoost
zh_hans: 用于 XGBoost 的 Flower 客户端定义

source: After loading the dataset we define the Flower client. We follow the general rule to define :code:`XgbClient` class inherited from :code:`fl.client.Client`.
zh_hans: 加载数据集后，我们定义 Flower 客户端。我们按照一般规则定义从 :code:`fl.client.Client` 继承而来的 :code:`XgbClient` 类。

source: The :code:`self.bst` is used to keep the Booster objects that remain consistent across rounds, allowing them to store predictions from trees integrated in earlier rounds and maintain other essential data structures for training.
zh_hans: 代码:`self.bst`用于保存在各轮中保持一致的 Booster 对象，使其能够存储在前几轮中集成的树的预测结果，并维护其他用于训练的重要数据结构。

source: Then, we override :code:`get_parameters`, :code:`fit` and :code:`evaluate` methods insides :code:`XgbClient` class as follows.
zh_hans: 然后，我们在 :code:`XgbClient` 类中重写 :code:`get_parameters`、:code:`fit` 和 :code:`evaluate` 方法如下。

source: Unlike neural network training, XGBoost trees are not started from a specified random weights. In this case, we do not use :code:`get_parameters` and :code:`set_parameters` to initialise model parameters for XGBoost. As a result, let's return an empty tensor in :code:`get_parameters` when it is called by the server at the first round.
zh_hans: 与神经网络训练不同，XGBoost 树不是从指定的随机参数开始的。在这种情况下，我们不使用 :code:`get_parameters` 和 :code:`set_parameters` 来初始化 XGBoost 的模型参数。因此，当服务器在第一轮调用 :code:`get_parameters` 时，让我们在 :code:`get_parameters` 中返回一个空张量。

source: In :code:`fit`, at the first round, we call :code:`xgb.train()` to build up the first set of trees. the returned Booster object and config are stored in :code:`self.bst` and :code:`self.config`, respectively. From the second round, we load the global model sent from server to :code:`self.bst`, and then update model weights on local training data with function :code:`local_boost` as follows:
zh_hans: 在 :code:`fit`中，第一轮我们调用 :code:`xgb.train()`来建立第一组树，返回的 Booster 对象和 config 分别存储在 :code:`self.bst` 和 :code:`self.config` 中。从第二轮开始，我们将服务器发送的全局模型加载到 :code:`self.bst`，然后使用函数 :code:`local_boost`更新本地训练数据的模型权重，如下所示：

source: Given :code:`num_local_round`, we update trees by calling :code:`self.bst.update` method. After training, the last :code:`N=num_local_round` trees will be extracted to send to the server.
zh_hans: 给定 :code:`num_local_round`，我们通过调用 :code:`self.bst.update`方法更新树。训练结束后，我们将提取最后一个 :code:`N=num_local_round` 树并发送给服务器。

source: In :code:`evaluate`, we call :code:`self.bst.eval_set` function to conduct evaluation on valid set. The AUC value will be returned.
zh_hans: 在 :code:`evaluate`中，我们调用 :code:`self.bst.eval_set`函数对有效集合进行评估。将返回 AUC 值。

source: Now, we can create an instance of our class :code:`XgbClient` and add one line to actually run this client:
zh_hans: 现在，我们可以创建一个 :code:`XgbClient` 类的实例，并添加一行来实际运行该客户端：

source: That's it for the client. We only have to implement :code:`Client`and call :code:`fl.client.start_client()`. The string :code:`"[::]:8080"` tells the client which server to connect to. In our case we can run the server and the client on the same machine, therefore we use :code:`"[::]:8080"`. If we run a truly federated workload with the server and clients running on different machines, all that needs to change is the :code:`server_address` we point the client at.
zh_hans: 这就是客户端。我们只需实现 :code:`客户端`并调用 :code:`fl.client.start_client()`。字符串 :code:`"[::]:8080"`会告诉客户端要连接的服务器。在本例中，我们可以在同一台机器上运行服务器和客户端，因此我们使用 :code:`"[::]:8080"`。如果我们运行的是真正的联邦工作负载，服务器和客户端运行在不同的机器上，那么需要改变的只是客户端指向的 :code:`server_address`。

source: These updates are then sent to the *server* which will aggregate them to produce a better model. Finally, the *server* sends this improved version of the model back to each *client* to finish a complete FL round.
zh_hans: 然后，这些更新会被发送到*服务器*，由*服务器*聚合后生成一个更好的模型。最后，*服务器*将这个改进版的模型发回给每个*客户端*，以完成一轮完整的 FL。

source: In a file named :code:`server.py`, import Flower and FedXgbBagging from :code:`flwr.server.strategy`.
zh_hans: 在名为 :code:`server.py` 的文件中，从 :code:`flwr.server.strategy` 导入 Flower 和 FedXgbBagging。

source: We first define a strategy for XGBoost bagging aggregation.
zh_hans: 我们首先定义了 XGBoost bagging聚合策略。

source: We use two clients for this example. An :code:`evaluate_metrics_aggregation` function is defined to collect and wighted average the AUC values from clients.
zh_hans: 本示例使用两个客户端。我们定义了一个 :code:`evaluate_metrics_aggregation` 函数，用于收集客户机的 AUC 值并求取平均值。
